{
"people" : [
{"id":3, "name":"Albert Finney", "description":"Albert Finney   is an English actor.  Beginning in the theatre, Finney was especially successful in plays by William Shakespeare before he switched to films.", "drootid": 3, "condition":[], "buildingid":0, "image":"PERSON3.png"}, 
{"id":7, "name":"Joseph Goebbels", "description":"Paul Joseph Goebbels  was a German politician and Reich Minister of Propaganda in Nazi Germany from 1933 to 1945.  One of Adolf Hitler's close associates and most devoted followers, he was known for his skills in public speaking and his deep and virulent antisemitism, which led to his supporting the extermination of the Jews in the Holocaust.", "drootid": 17, "condition":[], "buildingid":0, "image":"PERSON7.png"}, 
{"id":11, "name":"Henri Poincaré", "description":"Jules Henri Poincaré   was a French mathematician, theoretical physicist, engineer, and philosopher of science.  He is often described as a polymath, and in mathematics as The Last Universalist by Eric Temple Bell, since he excelled in all fields of the discipline as it existed during his lifetime.", "drootid": 33, "condition":[], "buildingid":0, "image":"PERSON11.png"}, 
{"id":16, "name":"Elsa Einstein", "description":"Elsa Einstein  was the second wife and double first cousin of Albert Einstein.  Elsa had the surname of Einstein at birth, lost it when she took the name of her first husband Max Löwenthal, and regained it in 1919 when she married her cousin Albert.", "drootid": 51, "condition":[], "buildingid":0, "image":"PERSON16.png"}, 
{"id":22, "name":"Alternating current", "description":"Alternating current , is an electric current in which the flow of electric charge periodically reverses direction, whereas in direct current , the flow of electric charge is only in one direction.  AC is the form in which electric power is delivered to businesses and residences, and it is the form of electric power that consumers typically use when they plug kitchen appliances, televisions and electric lamps into a wall socket.", "drootid": 70, "condition":[], "buildingid":0, "image":"PERSON22.png"}, 
{"id":1, "name":"Nathan Alcock", "description":"Nathan Alcock  was an English physician.", "drootid": 8, "condition":[4], "buildingid":1, "image":"PERSON1.png"}, 
{"id":2, "name":"Joseph Hewes", "description":"Joseph Hewes  was a native of Princeton, New Jersey, where he was born in 1730.  Hewes’s parents were members of the Society of Friends, commonly known as Quakers.", "drootid": 12, "condition":[6], "buildingid":2, "image":"PERSON2.png"}, 
{"id":5, "name":"H. A. Sinclair de Rochemont", "description":"Whilst studying Indology at Leiden University, he became associated with the rightist professor Gerardus Johannes Petrus Josephus Bolland .  After leaving the university in 1924, he set up the country's first fascist movement, the Verbond van Actualisten, with Alfred Haighton.", "drootid": 25, "condition":[11], "buildingid":5, "image":"PERSON5.png"}, 
{"id":8, "name":"Victoria Koblenko", "description":"Victoria Koblenko   is a Ukrainian-Dutch actress, presenter and columnist.", "drootid": 23, "condition":[11], "buildingid":5, "image":"PERSON8.png"}, 
{"id":6, "name":"Emil Wiesemann", "description":"Emil Wiesmann  was a Hauptsturmführer in the Waffen SS who was awarded a posthumous Knight's Cross of the Iron Cross after being killed in action on 14 November 1943, while in command of the 2nd Battery, 1st SS Sturmgeschütz  Battalion, 1st SS Division Leibstandarte SS Adolf Hitler.", "drootid": 29, "condition":[13], "buildingid":6, "image":"PERSON6.png"}, 
{"id":15, "name":"Hans von Zedlitz", "description":"Hans von Zedlitz  was a German film actor.", "drootid": 65, "condition":[27], "buildingid":12, "image":"PERSON15.png"}, 
{"id":12, "name":"Wolfgang Wilhelm", "description":"Wolfgang Wilhelm  was a German-born screenwriter who later settled in Britain.  He worked in the German film industry before leaving after the Nazi taking of power in 1933.", "drootid": 39, "condition":[16], "buildingid":11, "image":"PERSON12.png"}, 
{"id":18, "name":"Rudolf Bauer", "description":"Alexander Georg Rudolf Bauer  was a German-born painter who was involved in the avant-garde group Der Sturm in Berlin, and whose work would become central to the Non-Objective art collection of Solomon R.  Guggenheim.", "drootid": 62, "condition":[26], "buildingid":11, "image":"PERSON18.png"}, 
{"id":20, "name":"Harry Giese", "description":" Harry Giese  was a German theatre and voice actor born in Magdeburg, Province of Saxony.  He is best known for providing voiceovers on German newsreels during the Second World War and for being the narrator of the anti-semitic propaganda film The Eternal Jew .", "drootid": 78, "condition":[32], "buildingid":15, "image":"PERSON20.png"}, 
{"id":23, "name":"Harry Giese", "description":" Harry Giese  was a German theatre and voice actor born in Magdeburg, Province of Saxony.  He is best known for providing voiceovers on German newsreels during the Second World War and for being the narrator of the anti-semitic propaganda film The Eternal Jew .", "drootid": 76, "condition":[32], "buildingid":15, "image":"PERSON23.png"}, 
{"id":10, "name":"Fahredin Nuri", "description":"Fahredin Nuri  was a notable Albanian hydraulic engineer.", "drootid": 47, "condition":[20], "buildingid":9, "image":"PERSON10.png"}, 
{"id":13, "name":"Fritz Mannheimer", "description":"Fritz Sjölin Mannheimer  was a German-born and, from 1936, Dutch banker and art collector who was the director of the Amsterdam branch of the Berlin-based investment bank Mendelssohn & Co.  that was for some time the main supporter of the Dutch capital market.", "drootid": 44, "condition":[19], "buildingid":9, "image":"PERSON13.png"}, 
{"id":17, "name":"Erhard Hübener", "description":"Dr.  Erhard Hübener  was a German politician and member of the German Democratic Party  until 1933.", "drootid": 57, "condition":[23], "buildingid":14, "image":"PERSON17.png"}, 
{"id":21, "name":"Paul Stewart", "description":"Paul Stewart  was an American character actor, director and producer who worked in theatre, radio, films and television.  He frequently portrayed cynical and sinister characters throughout his lengthy career.", "drootid": 85, "condition":[34], "buildingid":16, "image":"PERSON21.png"}, 
{"id":24, "name":"Chris Rock", "description":"Christopher Julius \"Chris\" Rock III  is an American comedian, actor, and producer.  After working as a standup comic and appearing in small film roles, Rock came to wider prominence as a cast member of Saturday Night Live in the early 1990s.", "drootid": 83, "condition":[34], "buildingid":16, "image":"PERSON24.png"}],
"items":[{"id":1, "name":"1779 deaths", "description":"It is a book about 1779 deaths. It says: 1779 deaths.  The following people are mentioned:  Joseph Hewes Nathan Alcock   And the following places: Switzerland and Kingston, New Jersey", "condition": [5], "eventid": 6, "buildingid":4, "itemtype":"book", "image":"null"}, 
{"id":0, "name":"Leiden University", "description":"It is a letter about Leiden University. It says: Leiden University , located in the city of Leiden, is the oldest university in the Netherlands.  The university was founded in 1575 by William, Prince of Orange, leader of the Dutch Revolt in the Eighty Years' War.  The following people are mentioned:  Nathan Alcock   And the following place: Cheshire", "condition": [2], "eventid": 4, "buildingid":3, "itemtype":"letter", "image":"null"}, 
{"id":4, "name":"فرنك فرنسي", "description":"It is a photograph about فرنك فرنسي. In a corner, it says:The franc , also commonly distinguished as the French franc , was a currency of France.  Between 1360 and 1641, it was the name of coins worth 1 livre tournois and it remained in common parlance as a term for this amount of money.  There are names written behind: France Andorra Monaco Blaise Pascal", "condition": [18], "eventid": 19, "buildingid":10, "itemtype":"photograph", "image":"null"}, 
{"id":2, "name":"Leiden University", "description":"It is a letter about Leiden University. It says: Leiden University , located in the city of Leiden, is the oldest university in the Netherlands.  The university was founded in 1575 by William, Prince of Orange, leader of the Dutch Revolt in the Eighty Years' War.  The following people are mentioned:  Adriaan Blaauw Victoria Koblenko H. A. Sinclair de Rochemont   And the following place: Hilversum", "condition": [9], "eventid": 11, "buildingid":7, "itemtype":"letter", "image":"null"}, 
{"id":3, "name":"Waffen SS", "description":"It is a book about Waffen SS. It says: Waffen SS.  The following people are mentioned:  Kārlis Mūsiņš Emil Wiesemann   And the following place: Berlin", "condition": [12], "eventid": 13, "buildingid":8, "itemtype":"book", "image":"null"}, 
{"id":5, "name":"German Revolution", "description":"It is a book about German Revolution. It says: The German Revolution or November Revolution  was a civil conflict in the German Empire at the end of the First World War that resulted in the replacement of Germany's Imperial government with a republic.  The revolutionary period lasted from November 1918 until the establishment in August 1919 of a republic that later became known as the Weimar Republic.  The following people are mentioned:  German_Empire German Empire Hungarian Soviet Republic Reichstag building Königsberg", "condition": [25], "eventid": 26, "buildingid":13, "itemtype":"book", "image":"null"}, 
{"id":6, "name":"Der ewige Jude", "description":"It is a list about Der ewige Jude. It says: The Eternal Jew  is an antisemitic German Nazi propaganda film, presented as a documentary.  The film's title in German is Der Ewige Jude, the German term for the character of the \"Wandering Jew\" in medieval folklore.  The following people are mentioned:  Harry Giese   And the following place: German Empire", "condition": [30], "eventid": 32, "buildingid":17, "itemtype":"list", "image":"null"}, 
{"id":7, "name":"Schauspieler", "description":"It is a letter about Schauspieler. It says: An actor  is one who portrays a character in a performance.  The actor performs \"in the flesh\" in the traditional medium of the theatre, and/or in modern mediums such as film, radio, and television.  The following people are mentioned:  Chris Rock Paul Stewart (actor) Kevin Nealon   And the following place: Manhattan", "condition": [33], "eventid": 34, "buildingid":18, "itemtype":"letter", "image":"null"}],
"buildings":[{"id":0, "name":"House of Albert Einstein", "description":" and Swiss Confederation  Switzerland , officially the Swiss Confederation is a federal republic in Europe", "locktype": "null", "coordx": 158, "coordy": 135, "condition":[], "cityid":0, "peopleid":[3,7,11,16,22], "itemsid":[], "image":"BUILDING0.png"}, 
{"id":4, "name":"Temple", "description":" While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\"  The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east", "locktype": "null", "coordx": 296, "coordy": 229, "condition":[5], "cityid":0, "peopleid":[], "itemsid":[1], "image":"BUILDING4.png"}, 
{"id":1, "name":"House of Nathan Alcock", "description":"Cheshire  is a county in North West England, bordering Merseyside and Greater Manchester to the north, Derbyshire to the east, Staffordshire and Shropshire to the south and Wales to the west  Cheshire's county town is Chester; the largest town is Warrington", "locktype": "null", "coordx": 241, "coordy": 294, "condition":[4], "cityid":1, "peopleid":[1], "itemsid":[], "image":"BUILDING1.png"}, 
{"id":3, "name":"Forest", "description":" Other major towns include Congleton, Crewe, Ellesmere Port, Macclesfield, Northwich, Runcorn, Widnes, Wilmslow, and Winsford The county covers 2,343 square kilometres  and has a population of around 1 million", "locktype": "null", "coordx": 241, "coordy": 99, "condition":[2], "cityid":1, "peopleid":[], "itemsid":[0], "image":"BUILDING3.png"}, 
{"id":2, "name":"House of Joseph Hewes", "description":"Kingston is an unincorporated community and census designated place  along the border of South Brunswick Township in Middlesex County and Franklin Township in Somerset County, in New Jersey, United States At the 2010 United States Census, the CDP's population was 1,493, of which 1,222 were in South Brunswick Township and 271 in Franklin Township", "locktype": "null", "coordx": 205, "coordy": 225, "condition":[6], "cityid":2, "peopleid":[2], "itemsid":[], "image":"BUILDING2.png"}, 
{"id":10, "name":"Police Station", "description":" The New Jersey State Planning Commission created the Kingston Village Advisory Committee to address issues related to this distinct area Both South Brunswick and Franklin appoint members to the committee, which holds an annual meeting to discuss issues pertinent to the Kingston area", "locktype": "null", "coordx": 220, "coordy": 64, "condition":[18], "cityid":2, "peopleid":[], "itemsid":[4], "image":"BUILDING10.png"}, 
{"id":5, "name":"House of H. A. Sinclair de Rochemont", "description":"Hilversum  is a municipality and a city in the Netherlands, in the province of North Holland Located in the region called \"Het Gooi\", it is the largest town in that area", "locktype": "null", "coordx": 340, "coordy": 243, "condition":[11,11], "cityid":3, "peopleid":[5,8], "itemsid":[], "image":"BUILDING5.png"}, 
{"id":7, "name":"Library", "description":" It is surrounded by heathland, woods, meadows, lakes, and smaller towns Hilversum is part of the Randstad, one of the largest conurbations in Europe", "locktype": "null", "coordx": 148, "coordy": 98, "condition":[9], "cityid":3, "peopleid":[], "itemsid":[2], "image":"BUILDING7.png"}, 
{"id":6, "name":"House of Emil Wiesemann", "description":"Berlin  is the capital and the largest city of Germany as well as one of its 16 states With a population of approximately 3", "locktype": "null", "coordx": 105, "coordy": 74, "condition":[13], "cityid":4, "peopleid":[6], "itemsid":[], "image":"BUILDING6.png"}, 
{"id":8, "name":"Museum", "description":"6 million people, Berlin is the second most populous city proper and the seventh most populous urban area in the European Union Located in northeastern Germany on the banks of Rivers Spree and Havel, it is the centre of the Berlin-Brandenburg Metropolitan Region, which has about 6 million residents from more than 180 nations", "locktype": "null", "coordx": 65, "coordy": 182, "condition":[12], "cityid":4, "peopleid":[], "itemsid":[3], "image":"BUILDING8.png"}, 
{"id":12, "name":"House of Hans von Zedlitz", "description":" Due to its location in the European Plain, Berlin is influenced by a temperate seasonal climate Around one-third of the city's area is composed of forests, parks, gardens, rivers and lakes", "locktype": "null", "coordx": 321, "coordy": 298, "condition":[27], "cityid":4, "peopleid":[15], "itemsid":[], "image":"BUILDING12.png"}, 
{"id":13, "name":"Forest", "description":" First documented in the 13th century and situated at the crossing of two important historic trade routes, Berlin became the capital of the Margraviate of Brandenburg , the Kingdom of Prussia , the German Empire , the Weimar Republic  and the Third Reich  Berlin in the 1920s was the third largest municipality in the world", "locktype": "null", "coordx": 240, "coordy": 82, "condition":[25], "cityid":4, "peopleid":[], "itemsid":[5], "image":"BUILDING13.png"}, 
{"id":11, "name":"Hotel", "description":" This included four kingdoms, six grand duchies, five duchies , seven principalities, three free Hanseatic cities, and one imperial territory Although the Kingdom of Prussia contained most of the Empire's population and territory, it played a lesser role", "locktype": "null", "coordx": 70, "coordy": 155, "condition":[16,16,26,16,26], "cityid":5, "peopleid":[12,18], "itemsid":[], "image":"BUILDING11.png"}, 
{"id":15, "name":"House of Harry Giese", "description":" As Dwyer  points out, Prussia's \"political and cultural influence had diminished considerably\" by the 1890s After 1850, the states of Germany had rapidly become industrialized, with particular strengths in coal, iron , chemicals, and railways", "locktype": "null", "coordx": 121, "coordy": 278, "condition":[32,32], "cityid":5, "peopleid":[20,23], "itemsid":[], "image":"BUILDING15.png"}, 
{"id":17, "name":"Stadium", "description":" In 1871 it had a population of 41 million people, and by 1913 this had increased to 68 million A heavily rural collection of states in 1815, the united Germany became predominantly urban", "locktype": "null", "coordx": 172, "coordy": 121, "condition":[30], "cityid":5, "peopleid":[], "itemsid":[6], "image":"BUILDING17.png"}, 
{"id":9, "name":"House of Fahredin Nuri", "description":"France , officially the French Republic , is a transcontinental country comprising territory in western Europe and several overseas regions and territories The European, or metropolitan, area of France extends from the Mediterranean Sea to the English Channel and the North Sea, and from the Rhine to the Atlantic Ocean", "locktype": "null", "coordx": 170, "coordy": 294, "condition":[20,19], "cityid":6, "peopleid":[10,13], "itemsid":[], "image":"BUILDING9.png"}, 
{"id":14, "name":"Museum", "description":" Free state is another German term for republic that was coined in contrast to the Latin word, which was associated with the enemy France in the minds of many Germans of that time The democratic Free State of Prussia was rendered incapacitated when it was taken over by the Preußenschlag  of 1932–33 and Otto Braun was forced from office", "locktype": "null", "coordx": 134, "coordy": 72, "condition":[23,23,23], "cityid":8, "peopleid":[17], "itemsid":[], "image":"BUILDING14.png"}, 
{"id":16, "name":"House of Paul Stewart", "description":"Manhattan  is the most densely populated borough of New York City, its economic and administrative center, and the city's historical birthplace The borough is coterminous with New York County, founded on November 1, 1683, as one of the original counties of the U", "locktype": "null", "coordx": 277, "coordy": 126, "condition":[34,34], "cityid":12, "peopleid":[21,24], "itemsid":[], "image":"BUILDING16.png"}, 
{"id":18, "name":"Forest", "description":"S state of New York", "locktype": "null", "coordx": 187, "coordy": 213, "condition":[33], "cityid":12, "peopleid":[], "itemsid":[7], "image":"BUILDING18.png"}],
"cities":[{"id":0, "name":"Switzerland", "description":" and Swiss Confederation . Switzerland , officially the Swiss Confederation is a federal republic in Europe. While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\" . The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2 . While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zürich and Geneva. The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. The country has a history of armed neutrality going back to the Reformation, it has not been in a state of war internationally since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. In addition to being the birthplace of the Red Cross, Switzerland is home to numerous international organisations, including the second largest UN office. On the European level, it is a founding member of the European Free Trade Association, but notably it is not part of the European Union, nor the European Economic Area. However, the country does participate in the Schengen Area and the EU's single market through a number of bilateral treaties. Spanning the intersection of Germanic and Romance Europe, Switzerland comprises four main linguistic and cultural regions: German, French, Italian and Romansh. Although the majority of the population are German speaking, Swiss national identity is rooted in a common historical background, shared values such as federalism and direct democracy, and Alpine symbolism. Due to its linguistic diversity, Switzerland is known by a variety of native names: Schweiz [ˈʃvaɪts] ; Suisse [sɥis] ; Svizzera [ˈzvittsera] ; and Svizra [ˈʒviːtsrɐ] or [ˈʒviːtsʁːɐ] . On coins and stamps, Latin  is used instead of the four living languages. Switzerland is one of the most developed countries in the world, with the highest nominal wealth per adult and the eighth-highest per capita gross domestic product according to the IMF. Switzerland ranks at or near the top globally in several metrics of national performance, including government transparency, civil liberties, quality of life, economic competitiveness, and human development. Zürich and Geneva have each been ranked among the top cities in the world in terms of quality of life, with the former ranked second globally, according to Mercer.", "coordx": 210, "coordy": 124, "condition":[], "buildingid":[0,4], "image":"CITY0.png"}, 
{"id":1, "name":"Cheshire", "description":"Cheshire  is a county in North West England, bordering Merseyside and Greater Manchester to the north, Derbyshire to the east, Staffordshire and Shropshire to the south and Wales to the west . Cheshire's county town is Chester; the largest town is Warrington. Other major towns include Congleton, Crewe, Ellesmere Port, Macclesfield, Northwich, Runcorn, Widnes, Wilmslow, and Winsford. The county covers 2,343 square kilometres  and has a population of around 1 million. It is mostly rural, with a number of small towns and villages supporting the agricultural and other industries which produce Cheshire cheese, salt, chemicals and silk.", "coordx": 196, "coordy": 110, "condition":[4,2], "buildingid":[1,3], "image":"CITY1.png"}, 
{"id":2, "name":"Kingston, New Jersey", "description":"Kingston is an unincorporated community and census designated place  along the border of South Brunswick Township in Middlesex County and Franklin Township in Somerset County, in New Jersey, United States. At the 2010 United States Census, the CDP's population was 1,493, of which 1,222 were in South Brunswick Township and 271 in Franklin Township. The New Jersey State Planning Commission created the Kingston Village Advisory Committee to address issues related to this distinct area. Both South Brunswick and Franklin appoint members to the committee, which holds an annual meeting to discuss issues pertinent to the Kingston area. Kingston is located in five historic districts and is part of the Millstone River Valley Scenic Byway. The Delaware and Raritan Canal and Rockingham State Historic Site are a short distance away.", "coordx": 93, "coordy": 137, "condition":[6,18], "buildingid":[2,10], "image":"CITY2.png"}, 
{"id":3, "name":"Hilversum", "description":"Hilversum  is a municipality and a city in the Netherlands, in the province of North Holland. Located in the region called \"Het Gooi\", it is the largest town in that area. It is surrounded by heathland, woods, meadows, lakes, and smaller towns. Hilversum is part of the Randstad, one of the largest conurbations in Europe.", "coordx": 207, "coordy": 112, "condition":[11,11,9], "buildingid":[5,7], "image":"CITY3.png"}, 
{"id":4, "name":"Berlin", "description":"Berlin  is the capital and the largest city of Germany as well as one of its 16 states. With a population of approximately 3.6 million people, Berlin is the second most populous city proper and the seventh most populous urban area in the European Union. Located in northeastern Germany on the banks of Rivers Spree and Havel, it is the centre of the Berlin-Brandenburg Metropolitan Region, which has about 6 million residents from more than 180 nations. Due to its location in the European Plain, Berlin is influenced by a temperate seasonal climate. Around one-third of the city's area is composed of forests, parks, gardens, rivers and lakes. First documented in the 13th century and situated at the crossing of two important historic trade routes, Berlin became the capital of the Margraviate of Brandenburg , the Kingdom of Prussia , the German Empire , the Weimar Republic  and the Third Reich . Berlin in the 1920s was the third largest municipality in the world. After World War II, the city was divided; East Berlin became the capital of East Germany while West Berlin became a de facto West German exclave, surrounded by the Berlin Wall  and East Germany territory. Following German reunification in 1990, Berlin was once again designated as the capital of united Germany. Berlin is a world city of culture, politics, media and science. Its economy is based on high-tech firms and the service sector, encompassing a diverse range of creative industries, research facilities, media corporations and convention venues. Berlin serves as a continental hub for air and rail traffic and has a highly complex public transportation network. The metropolis is a popular tourist destination. Significant industries also include IT, pharmaceuticals, biomedical engineering, clean tech, biotechnology, construction and electronics. Modern Berlin is home to world renowned universities, orchestras, museums, entertainment venues and is host to many sporting events. Its urban setting has made it a sought-after location for international film productions. The city is well known for its festivals, diverse architecture, nightlife, contemporary arts and a high quality of living. Over the last decade Berlin has seen the emergence of a cosmopolitan entrepreneurial scene.", "coordx": 219, "coordy": 111, "condition":[13,12,27,25], "buildingid":[6,8,12,13], "image":"CITY4.png"}, 
{"id":5, "name":"German Empire", "description":"The German Empire  was the historical German nation state that existed from the unification of Germany in 1871 to the abdication of Kaiser Wilhelm II in November 1918, when Germany became a federal republic. The German Empire consisted of 26 constituent territories, with most being ruled by royal families. This included four kingdoms, six grand duchies, five duchies , seven principalities, three free Hanseatic cities, and one imperial territory. Although the Kingdom of Prussia contained most of the Empire's population and territory, it played a lesser role. As Dwyer  points out, Prussia's \"political and cultural influence had diminished considerably\" by the 1890s. After 1850, the states of Germany had rapidly become industrialized, with particular strengths in coal, iron , chemicals, and railways. In 1871 it had a population of 41 million people, and by 1913 this had increased to 68 million. A heavily rural collection of states in 1815, the united Germany became predominantly urban. During its 47 years of existence, the German Empire operated as an industrial, technological, and scientific giant, gaining more Nobel Prizes in science than any other country. Germany became a great power, boasting a rapidly growing rail network, the world's strongest army, and a fast-growing industrial base. In less than a decade, its navy became second only to Britain's Royal Navy. When the great crisis of 1914 arrived, the German Empire had only one ally – Austria-Hungary. They were later joined by the Ottoman Empire and Bulgaria to form the Central Powers or Quadruple Alliance. In the First World War, German plans to capture Paris quickly in autumn 1914 failed, and the war on the Western Front became a stalemate. The Allied naval blockade caused severe shortages of food. Germany was repeatedly forced to send troops to bolster Austria and Turkey on other fronts. However, Germany had great success on the Eastern Front; it occupied large Eastern territories following the Treaty of Brest-Litovsk. German declaration of unrestricted submarine warfare in early 1917 was designed to strangle the British; it failed, because of the use of a trans-Atlantic convoy system. But the declaration—along with the Zimmermann Telegram—did bring the United States into the war. Meanwhile, German civilians and soldiers had become war-weary and radicalised by the Russian Revolution. The high command under Paul von Hindenburg and Erich Ludendorff increasingly controlled the country, as they gambled on one last offensive in spring 1918 before the Americans could arrive in force, using large numbers of troops, aeroplanes and artillery withdrawn from the Eastern Front. This failed, and by October the armies were in retreat, the Austro-Hungarian Empire and the Ottoman Empire had collapsed, and the German people had lost faith in their political system. The Empire collapsed in the November 1918 Revolution as the Emperor and all the ruling monarchs abdicated, and a republic took over.", "coordx": 219, "coordy": 111, "condition":[16,16,26,16,26,16,16,26,16,26,32,32,30], "buildingid":[11,15,17], "image":"CITY5.png"}, 
{"id":6, "name":"France", "description":"France , officially the French Republic , is a transcontinental country comprising territory in western Europe and several overseas regions and territories. The European, or metropolitan, area of France extends from the Mediterranean Sea to the English Channel and the North Sea, and from the Rhine to the Atlantic Ocean. Overseas France include French Guiana on the South American continent and several island territories in the Atlantic, Pacific and Indian oceans. France spans 643,801 square kilometres  and has a total population of 66.7 million. It is a unitary semi-presidential republic with the capital in Paris, the country's largest city and main cultural and commercial centre. During the Iron Age, what is now metropolitan France was inhabited by the Gauls, a Celtic people. The area was annexed in 51 BC by Rome, which held Gaul until 486, when the Germanic Franks conquered the region and formed the Kingdom of France. France emerged as a major European power in the Late Middle Ages, with its victory in the Hundred Years' War  strengthening state-building and political centralisation. During the Renaissance, French culture flourished and a global colonial empire was established, which by the 20th century would be the second largest in the world. The 16th century was dominated by religious civil wars between Catholics and Protestants . France became Europe's dominant cultural, political, and military power under Louis XIV. In the late 18th century, the French Revolution overthrew the absolute monarchy, established one of modern history's earliest republics, and saw the drafting of the Declaration of the Rights of Man and of the Citizen, which expresses the nation's ideals to this day. In the 19th century Napoleon took power and established the First French Empire, whose subsequent Napoleonic Wars shaped the course of continental Europe. Following the collapse of the Empire, France endured a tumultuous succession of governments culminating with the establishment of the French Third Republic in 1870. France was a major participant in the First World War, from which it emerged victorious, and was one of the Allied Powers in the Second World War, but came under occupation by the Axis Powers in 1940. Following liberation in 1944, a Fourth Republic was established and later dissolved in the course of the Algerian War. The Fifth Republic, led by Charles de Gaulle, was formed in 1958 and remains to this day. Algeria and nearly all the other colonies became independent in the 1960s with minimal controversy and typically retained close economic and military connections with France. France has long been a global centre of art, science, and philosophy. It hosts Europe's fourth-largest number of cultural UNESCO World Heritage Sites and receives around 83 million foreign tourists annually, the most of any country in the world. France is a developed country with the world's sixth-largest economy by nominal GDP and ninth-largest by purchasing power parity. In terms of aggregate household wealth, it ranks fourth in the world. France performs well in international rankings of education, health care, life expectancy, and human development. France remains a great power in the world, being a founding member of the United Nations, where it serves as one of the five permanent members of the UN Security Council, and a founding and leading member state of the European Union . It is also a member of the Group of 7, North Atlantic Treaty Organization , Organisation for Economic Co-operation and Development , the World Trade Organization , and La Francophonie.", "coordx": 203, "coordy": 120, "condition":[20,19], "buildingid":[9], "image":"CITY6.png"}, 
{"id":8, "name":"Prussia", "description":"The Free State of Prussia  was a German state formed after the abolition of the Kingdom of Prussia in the aftermath of the First World War. It was the major state of the German Reich during the time of the Weimar Republic, comprising almost  5⁄8  of its territory and population. Free state is another German term for republic that was coined in contrast to the Latin word, which was associated with the enemy France in the minds of many Germans of that time. The democratic Free State of Prussia was rendered incapacitated when it was taken over by the Preußenschlag  of 1932–33 and Otto Braun was forced from office. His government went to court over this ouster, but in 1933 the Nazi regime seized control of the Prussian government. From 1933, the Free State was deprived of parliamentary democracy and ruled exclusively under the leadership of the National Socialist German Workers Party . Initially, Prussia was administered by high-ranking Nazi Hermann Göring who was appointed Minister-President of Prussia. In 1935, the Free State's territory was dismantled into regional Gaue, some of which incorporated both Prussian and non-Prussian territory, thus effectively ending Prussia as a single territorial unit of Germany. Although the Free State of Prussia continued to exist in name under the premiership of Hermann Göring throughout the Nazi era, by 1935 the Prussian government had been effectively absorbed by the government of the German Reich and Göring's position as Minister-President had been relegated to a titular role in comparison to his more prominent duties in the government of the Third Reich. After the end of World War II Otto Braun approached US officials to reinstate the legal Prussian government. They and the other Allied Occupation forces, who had occupied all of Germany, were opposed to the idea and declared Prussia abolished in 1947.", "coordx": 219, "coordy": 111, "condition":[23,23,23,23,23,23], "buildingid":[14], "image":"CITY8.png"}, 
{"id":12, "name":"Manhattan", "description":"Manhattan  is the most densely populated borough of New York City, its economic and administrative center, and the city's historical birthplace. The borough is coterminous with New York County, founded on November 1, 1683, as one of the original counties of the U.S. state of New York. The borough consists mostly of Manhattan Island, bounded by the East, Hudson, and Harlem Rivers, and also includes several small adjacent islands and Marble Hill, a small neighborhood on the U.S. mainland. Manhattan is often described as the cultural and financial capital of the world and hosts the United Nations Headquarters. Anchored by Wall Street in the Financial District of Lower Manhattan, New York City has been called both the most economically powerful city and the leading financial center of the world, and Manhattan is home to the world's two largest stock exchanges by total market capitalization: the New York Stock Exchange and NASDAQ. Many multinational media conglomerates are based in the borough. It is historically documented to have been purchased by Dutch colonists from Native Americans in 1626, for 60 guilders or about $24 in 1626 and US$1050 today. Manhattan real estate has since become among the most expensive in the world, with the value of Manhattan Island, including real estate, estimated to exceed US$3 trillion in 2013; residential property sale prices in Manhattan typically exceeded US$1,400 per square foot  as of 2016. New York County is the United States' second-smallest county by land area , and is also the most densely populated U.S. county. It is also one of the most densely populated areas in the world, with a census-estimated 2015 population of 1,644,518 living in a land area of 22.83 square miles , or 72,033 residents per square mile , higher than the density of any individual American city. On business days, the influx of commuters increases that number to over 3.9 million, or more than 170,000 people per square mile . Manhattan has the third-largest population of New York City's five boroughs, after Brooklyn and Queens, and is the smallest borough in terms of land area. Many districts and landmarks in Manhattan have become well known, as New York City received a record of nearly 60 million tourists in 2015, and Manhattan hosts three of the world's 10 most-visited tourist attractions in 2013: Times Square, Central Park, and Grand Central Terminal. The borough hosts many world-renowned bridges, such as the Brooklyn Bridge; skyscrapers such as the Empire State Building, one of the tallest skyscrapers in the world; and parks, such as Central Park. There are many historically significant places in Manhattan: Chinatown incorporates the highest concentration of Chinese people in the Western Hemisphere, and the Stonewall Inn in Greenwich Village is considered the birthplace of the modern gay rights movement. The City of New York was founded at the southern tip of Manhattan, and the borough houses New York City Hall, the seat of the City's Government. Numerous colleges and universities are located in Manhattan, including Columbia University, New York University, Weill Cornell Medical College, and Rockefeller University, which have been ranked among the top 35 in the world.", "coordx": 94, "coordy": 136, "condition":[34,34,33], "buildingid":[16,18], "image":"CITY12.png"}],
"dialoguenodes":[{"id":83, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 100, "children": [84], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":84, "dialogueline":"Don't know.", "eventid":"-1", "dialoguetype": 0, "children": [83], "condition":[], "option":"I'm looking for Paul Stewart?...", "isroot": false}, 
{"id":85, "dialogueline":"I don't have to speak to you", "eventid":"-1", "dialoguetype": 100, "children": [86,100,102,112,120], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":120, "dialogueline":"I died in 1779", "eventid":"68", "dialoguetype": 0, "children": [85], "condition":[67], "option":"Tell me about yourself.", "isroot": false}, 
{"id":112, "dialogueline":"I died in zhitomir", "eventid":"60", "dialoguetype": 0, "children": [85], "condition":[59], "option":"Tell me about yourself.", "isroot": false}, 
{"id":102, "dialogueline":"I am know for subject. 1908 births", "eventid":"50", "dialoguetype": 0, "children": [85], "condition":[49], "option":"Tell me about yourself.", "isroot": false}, 
{"id":100, "dialogueline":"I am know for birthplace. manhattan", "eventid":"48", "dialoguetype": 0, "children": [85], "condition":[47], "option":"Tell me about yourself.", "isroot": false}, 
{"id":86, "dialogueline":"You'll find nothing.", "eventid":"-1", "dialoguetype": 0, "children": [85], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":57, "dialogueline":"Greetings. Do you need something?", "eventid":"-1", "dialoguetype": 0, "children": [58], "condition":[], "option":"", "isroot": true}, 
{"id":58, "dialogueline":"Anything to help.", "eventid":"-1", "dialoguetype": 100, "children": [59], "condition":[], "option":"Greetings, I'm following the victim's case. If you don't mind, could I ask you some questions?", "isroot": false}, 
{"id":59, "dialogueline":"I'm not sure. Perhaps, the Forest could have a clue.", "eventid":"-1", "dialoguetype": 0, "children": [60], "condition":[], "option":"I am seeking Hans von Zedlitz. Have you heard of them?", "isroot": false}, 
{"id":60, "dialogueline":"Have you looked in Berlin? Try searching there.", "eventid":"25", "dialoguetype": 0, "children": [58], "condition":[], "option":"Where could I go to find the Forest?", "isroot": false}, 
{"id":44, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [45], "condition":[], "option":"", "isroot": true}, 
{"id":45, "dialogueline":"Are you sure you need me?", "eventid":"-1", "dialoguetype": 100, "children": [46], "condition":[], "option":"Hi, I'm a super sleuth investigating the victim's case. If it's not too much trouble, can I ask you some questions?", "isroot": false}, 
{"id":46, "dialogueline":"Last I had heard they were in France.", "eventid":"20", "dialoguetype": 0, "children": [45], "condition":[], "option":"I am seeking Fahredin Nuri. Any idea where they could be?", "isroot": false}, 
{"id":47, "dialogueline":"I'm innocent", "eventid":"-1", "dialoguetype": 100, "children": [48,94,98,104,106], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":106, "dialogueline":"I am know for birthplace. albania", "eventid":"54", "dialoguetype": 0, "children": [47], "condition":[53], "option":"Tell me about yourself.", "isroot": false}, 
{"id":104, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"52", "dialoguetype": 0, "children": [47], "condition":[51], "option":"Tell me about yourself.", "isroot": false}, 
{"id":98, "dialogueline":"What, deathyear? I don't know anything about that.", "eventid":"46", "dialoguetype": 0, "children": [47], "condition":[45], "option":"Tell me about yourself.", "isroot": false}, 
{"id":94, "dialogueline":"I am know for subject. 1984 deaths", "eventid":"42", "dialoguetype": 0, "children": [47], "condition":[41], "option":"Tell me about yourself.", "isroot": false}, 
{"id":48, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [47], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":76, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 100, "children": [77], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":77, "dialogueline":"I have no idea what you're talking about", "eventid":"-1", "dialoguetype": 0, "children": [76], "condition":[], "option":"I'm looking for Paul Stewart?...", "isroot": false}, 
{"id":78, "dialogueline":"Hello? May I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [79], "condition":[], "option":"", "isroot": true}, 
{"id":79, "dialogueline":"Whatever I can do to help.", "eventid":"-1", "dialoguetype": 100, "children": [80,121], "condition":[], "option":"Greetings, I'm a detective. Could you answer some questions for me?", "isroot": false}, 
{"id":121, "dialogueline":"Hans von Zedlitz is a subject of german male stage actor", "eventid":"69", "dialoguetype": 616, "children": [79], "condition":[-1], "option":"Do you have any information about one of the suspects?", "isroot": false}, 
{"id":80, "dialogueline":"The Forest might reveal something.", "eventid":"-1", "dialoguetype": 0, "children": [81], "condition":[], "option":"A friend advised me to look for Paul Stewart. Any idea where they could have gone?", "isroot": false}, 
{"id":81, "dialogueline":"Somebody told me it is was rumored to be in Manhattan. Try there.", "eventid":"33", "dialoguetype": 0, "children": [79], "condition":[], "option":"Where might I go to find the Forest?", "isroot": false}, 
{"id":62, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [63], "condition":[], "option":"", "isroot": true}, 
{"id":63, "dialogueline":"Certainly.", "eventid":"-1", "dialoguetype": 100, "children": [64], "condition":[], "option":"Hi, I'm a private-eye. If you don't mind, I would appreciate it if you answer some questions for me.", "isroot": false}, 
{"id":64, "dialogueline":"A friend told me they travelled to Berlin.", "eventid":"27", "dialoguetype": 0, "children": [63], "condition":[], "option":"Somebody hinted to me to seek out Hans von Zedlitz. Any idea where they could be?", "isroot": false}, 
{"id":39, "dialogueline":"Greetings. How can I help you?", "eventid":"-1", "dialoguetype": 0, "children": [40], "condition":[], "option":"", "isroot": true}, 
{"id":40, "dialogueline":"Are you sure you need me?", "eventid":"-1", "dialoguetype": 100, "children": [41], "condition":[], "option":"Hello, I'm assigned to the victim's case. Please would you help answer some questions?", "isroot": false}, 
{"id":41, "dialogueline":"I think the Police Station could reveal something.", "eventid":"-1", "dialoguetype": 0, "children": [42], "condition":[], "option":"Someone advised me to search for Fahredin Nuri. Have you heard of them?", "isroot": false}, 
{"id":42, "dialogueline":"It is was rumored to be in in Kingston, New Jersey. Try exploring there.", "eventid":"18", "dialoguetype": 0, "children": [40], "condition":[], "option":"Where could I go to find the Police Station?", "isroot": false}, 
{"id":65, "dialogueline":"I want my lawyer", "eventid":"-1", "dialoguetype": 100, "children": [66,110,116,122,126], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":126, "dialogueline":"I am know for birthplace. berlin", "eventid":"74", "dialoguetype": 0, "children": [65], "condition":[73], "option":"Tell me about yourself.", "isroot": false}, 
{"id":122, "dialogueline":"I am know for subject. german male stage actors", "eventid":"70", "dialoguetype": 0, "children": [65], "condition":[69], "option":"Tell me about yourself.", "isroot": false}, 
{"id":116, "dialogueline":"I am know for deathyear. 1948", "eventid":"64", "dialoguetype": 0, "children": [65], "condition":[63], "option":"Tell me about yourself.", "isroot": false}, 
{"id":110, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"58", "dialoguetype": 0, "children": [65], "condition":[57], "option":"Tell me about yourself.", "isroot": false}, 
{"id":66, "dialogueline":"You have no proof.", "eventid":"-1", "dialoguetype": 0, "children": [65], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":29, "dialogueline":"I'm innocent", "eventid":"-1", "dialoguetype": 100, "children": [30,92,96,114,118], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":118, "dialogueline":"I am know for birthplace. berlin", "eventid":"66", "dialoguetype": 0, "children": [29], "condition":[65], "option":"Tell me about yourself.", "isroot": false}, 
{"id":114, "dialogueline":"I am know for deathplace. zhitomir", "eventid":"62", "dialoguetype": 0, "children": [29], "condition":[61], "option":"Tell me about yourself.", "isroot": false}, 
{"id":96, "dialogueline":"What, deathyear? I don't know anything about that.", "eventid":"44", "dialoguetype": 0, "children": [29], "condition":[43], "option":"Tell me about yourself.", "isroot": false}, 
{"id":92, "dialogueline":"I am know for subject. 1914 births", "eventid":"40", "dialoguetype": 0, "children": [29], "condition":[39], "option":"Tell me about yourself.", "isroot": false}, 
{"id":30, "dialogueline":"You have no proof.", "eventid":"-1", "dialoguetype": 0, "children": [29], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":23, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 100, "children": [24], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":24, "dialogueline":"I have no idea what you're talking about", "eventid":"-1", "dialoguetype": 0, "children": [23], "condition":[], "option":"I'm looking for Emil Wiesemann?...", "isroot": false}, 
{"id":25, "dialogueline":"Greetings. May I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [26], "condition":[], "option":"", "isroot": true}, 
{"id":26, "dialogueline":"I can try.", "eventid":"-1", "dialoguetype": 100, "children": [27,105], "condition":[], "option":"Hi, I'm a private-eye investigating the victim's case. Thank you for your time, could you answer some questions for me?", "isroot": false}, 
{"id":105, "dialogueline":"Fahredin Nuri was born in albania", "eventid":"53", "dialoguetype": 616, "children": [26], "condition":[-1], "option":"Could you tell me any information about one of the suspects?", "isroot": false}, 
{"id":27, "dialogueline":"I'm not certain. But, the Museum could help.", "eventid":"-1", "dialoguetype": 0, "children": [28], "condition":[], "option":"I am looking for Emil Wiesemann. Have you know of them?", "isroot": false}, 
{"id":28, "dialogueline":"It is is in in Berlin. Try exploring there.", "eventid":"12", "dialoguetype": 0, "children": [26], "condition":[], "option":"Where is the Museum?", "isroot": false}, 
{"id":12, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 100, "children": [13,88,90,108,124], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":124, "dialogueline":"I am know for birthplace. kingston, new jersey", "eventid":"72", "dialoguetype": 0, "children": [12], "condition":[71], "option":"Tell me about yourself.", "isroot": false}, 
{"id":108, "dialogueline":"I am know for subject. 1730 births", "eventid":"56", "dialoguetype": 0, "children": [12], "condition":[55], "option":"Tell me about yourself.", "isroot": false}, 
{"id":90, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"38", "dialoguetype": 0, "children": [12], "condition":[37], "option":"Tell me about yourself.", "isroot": false}, 
{"id":88, "dialogueline":"I am know for deathyear. 1779", "eventid":"36", "dialoguetype": 0, "children": [12], "condition":[35], "option":"Tell me about yourself.", "isroot": false}, 
{"id":13, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [12], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":8, "dialogueline":"Hello?", "eventid":"-1", "dialoguetype": 0, "children": [9], "condition":[], "option":"", "isroot": true}, 
{"id":9, "dialogueline":"Yeah. Anything to help.", "eventid":"-1", "dialoguetype": 100, "children": [10,95,97,99,101], "condition":[], "option":"Greetings, I'm a detective following the victim's case. Thank you for your time, please would you help answer some questions?", "isroot": false}, 
{"id":101, "dialogueline":"Paul Stewart was born in 1908", "eventid":"49", "dialoguetype": 616, "children": [9], "condition":[-1], "option":"Do you have some information about one of the suspects?", "isroot": false}, 
{"id":99, "dialogueline":"Paul Stewart was born in manhattan", "eventid":"47", "dialoguetype": 616, "children": [9], "condition":[-1], "option":"I could use your help. Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":97, "dialogueline":"No one know what deathyear Fahredin Nuri has.", "eventid":"45", "dialoguetype": 616, "children": [9], "condition":[-1], "option":"I could use your help. Do you know some information about one of the suspects?", "isroot": false}, 
{"id":95, "dialogueline":"No one know what deathyear Emil Wiesemann has.", "eventid":"43", "dialoguetype": 616, "children": [9], "condition":[-1], "option":"I could use a lead. Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":10, "dialogueline":"The Temple might reveal something.", "eventid":"-1", "dialoguetype": 0, "children": [11], "condition":[], "option":"Someone directed me to search for Joseph Hewes. Any idea where they might be?", "isroot": false}, 
{"id":11, "dialogueline":"A friend told me it is located in Switzerland. Try there.", "eventid":"5", "dialoguetype": 0, "children": [9], "condition":[], "option":"Where is the Temple?", "isroot": false}, 
{"id":70, "dialogueline":"Hi. Do you want something?", "eventid":"-1", "dialoguetype": 0, "children": [71], "condition":[], "option":"", "isroot": true}, 
{"id":71, "dialogueline":"Yes. I can try.", "eventid":"28", "dialoguetype": 100, "children": [72,123,125], "condition":[], "option":"Hi, I'm working on the victim's case. Thank you for your time, I ask that you answer some questions.", "isroot": false}, 
{"id":125, "dialogueline":"Hans von Zedlitz was born in berlin", "eventid":"73", "dialoguetype": 616, "children": [71], "condition":[28], "option":"Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":123, "dialogueline":"Joseph Hewes was born in kingston, new jersey", "eventid":"71", "dialoguetype": 616, "children": [71], "condition":[28], "option":"Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":72, "dialogueline":"I am named Alternating current.", "eventid":"29", "dialoguetype": 0, "children": [73], "condition":[], "option":"Tell me your name.", "isroot": false}, 
{"id":73, "dialogueline":"The victim mentioned a thing known as German Empire.", "eventid":"30", "dialoguetype": 0, "children": [74], "condition":[], "option":"Is there anything about the victim that you remember?", "isroot": false}, 
{"id":74, "dialogueline":"I am suspicious of Paul Stewart (actor). However, I'm not entirely convinced.", "eventid":"31", "dialoguetype": 0, "children": [71], "condition":[], "option":"Do you have any more information?", "isroot": false}, 
{"id":51, "dialogueline":"Hello? How can I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [53], "condition":[], "option":"", "isroot": true}, 
{"id":53, "dialogueline":"Anything to help.", "eventid":"21", "dialoguetype": 100, "children": [54,117,119], "condition":[], "option":"Hi, I'm a private-eye following the victim's case. Could I ask you some questions?", "isroot": false}, 
{"id":119, "dialogueline":"Paul Stewart died in 1986", "eventid":"67", "dialoguetype": 616, "children": [53], "condition":[21], "option":"Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":117, "dialogueline":"Emil Wiesemann was born in berlin", "eventid":"65", "dialoguetype": 616, "children": [53], "condition":[21], "option":"I could use your cooperation. Do you have any information about one of the suspects?", "isroot": false}, 
{"id":54, "dialogueline":"I am called Elsa Einstein.", "eventid":"22", "dialoguetype": 0, "children": [55], "condition":[], "option":"Who are you?", "isroot": false}, 
{"id":55, "dialogueline":"the victim was seen in Prussia.", "eventid":"23", "dialoguetype": 0, "children": [56], "condition":[], "option":"Did the victim remark anything that you can remember?", "isroot": false}, 
{"id":56, "dialogueline":"I think Hans von Zedlitz could be guilty. However, It is tough to say.", "eventid":"24", "dialoguetype": 0, "children": [53], "condition":[], "option":"Can you think of anyone who could be involved?", "isroot": false}, 
{"id":33, "dialogueline":"Hi. May I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [35], "condition":[], "option":"", "isroot": true}, 
{"id":35, "dialogueline":"If you really need it...", "eventid":"14", "dialoguetype": 100, "children": [36,113,115], "condition":[], "option":"Hello, I'm a detective. Please can you help answer some questions?", "isroot": false}, 
{"id":115, "dialogueline":"Hans von Zedlitz died in 1948", "eventid":"63", "dialoguetype": 616, "children": [35], "condition":[14], "option":"I could use a lead. Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":113, "dialogueline":"Emil Wiesemann died in zhitomir", "eventid":"61", "dialoguetype": 616, "children": [35], "condition":[14], "option":"Do you have any information about one of the suspects?", "isroot": false}, 
{"id":36, "dialogueline":"Okay, you can call me Henri Poincaré.", "eventid":"15", "dialoguetype": 0, "children": [37], "condition":[], "option":"State your name.", "isroot": false}, 
{"id":37, "dialogueline":"Last I was led to believe, the victim was seen in German Empire. That's what I heard at least.", "eventid":"16", "dialoguetype": 0, "children": [38], "condition":[], "option":"Do you have anything specific that might be useful to the investigation?", "isroot": false}, 
{"id":38, "dialogueline":"I think Fahredin Nuri might be connected.", "eventid":"17", "dialoguetype": 0, "children": [35], "condition":[], "option":"I need a lead. Do you have any more information?", "isroot": false}, 
{"id":17, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [18], "condition":[], "option":"", "isroot": true}, 
{"id":18, "dialogueline":"Okay.", "eventid":"7", "dialoguetype": 100, "children": [19,107,109,111], "condition":[], "option":"Hello, I'm investigating the victim's case. If it's not too much trouble, I have some questions for you.", "isroot": false}, 
{"id":111, "dialogueline":"No one know what deathplace Paul Stewart has.", "eventid":"59", "dialoguetype": 616, "children": [18], "condition":[7], "option":"Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":109, "dialogueline":"No one know what deathplace Hans von Zedlitz has.", "eventid":"57", "dialoguetype": 616, "children": [18], "condition":[7], "option":"I need a lead. Do you know some information about one of the suspects?", "isroot": false}, 
{"id":107, "dialogueline":"Joseph Hewes was born in 1730", "eventid":"55", "dialoguetype": 616, "children": [18], "condition":[7], "option":"I need some assistance. Do you recall some information about one of the suspects?", "isroot": false}, 
{"id":19, "dialogueline":"Okay, I am called Joseph Goebbels.", "eventid":"8", "dialoguetype": 0, "children": [20], "condition":[], "option":"Could you tell me your name?", "isroot": false}, 
{"id":20, "dialogueline":"If I remember correctly, the victim talked about Hilversum.", "eventid":"9", "dialoguetype": 0, "children": [21], "condition":[], "option":"Did the victim indicate something that you can recall?", "isroot": false}, 
{"id":21, "dialogueline":"I believe Emil Wiesemann might have a motive. However, I'm not entirely convinced.", "eventid":"10", "dialoguetype": 0, "children": [18], "condition":[], "option":"I need a lead. Do you have any more information?", "isroot": false}, 
{"id":3, "dialogueline":"Greetings. How can I help you?", "eventid":"-1", "dialoguetype": 0, "children": [4], "condition":[], "option":"", "isroot": true}, 
{"id":4, "dialogueline":"I'll do my best.", "eventid":"0", "dialoguetype": 100, "children": [5,103], "condition":[], "option":"Hello, I'm a private investigator assigned to the victim's case. If it's not too much trouble, I would appreciate it if you answer some questions for me.", "isroot": false}, 
{"id":103, "dialogueline":"No one know what deathplace Fahredin Nuri has.", "eventid":"51", "dialoguetype": 616, "children": [4], "condition":[0], "option":"Do you remember any information about one of the suspects?", "isroot": false}, 
{"id":5, "dialogueline":"My name is Albert Finney.", "eventid":"1", "dialoguetype": 0, "children": [6], "condition":[], "option":"Tell me your name.", "isroot": false}, 
{"id":6, "dialogueline":"I believe the victim talked about Cheshire.", "eventid":"2", "dialoguetype": 0, "children": [7], "condition":[], "option":"Is there anything you think I should know about?", "isroot": false}, 
{"id":7, "dialogueline":"I am suspicious of Joseph Hewes.", "eventid":"3", "dialoguetype": 0, "children": [4], "condition":[], "option":"Do you have any more information?", "isroot": false}],
"crime":{"suspects":[2,6,10,15,21],"culprit":21,"facts":[{"pid":2,"factoid":"Joseph Hewes was born in kingston, new jersey","condition":71},{"pid":2,"factoid":"Joseph Hewes died in 1779","condition":35},{"pid":2,"factoid":"Joseph Hewes was born in 1730","condition":55},{"pid":2,"factoid":"No one know what deathplace Joseph Hewes has.","condition":37},{"pid":6,"factoid":"Emil Wiesemann was born in berlin","condition":65},{"pid":6,"factoid":"No one know what deathyear Emil Wiesemann has.","condition":43},{"pid":6,"factoid":"Emil Wiesemann was born in 1914","condition":39},{"pid":6,"factoid":"Emil Wiesemann died in zhitomir","condition":61},{"pid":10,"factoid":"Fahredin Nuri was born in albania","condition":53},{"pid":10,"factoid":"No one know what deathyear Fahredin Nuri has.","condition":45},{"pid":10,"factoid":"Fahredin Nuri is a subject of 1984 death","condition":41},{"pid":10,"factoid":"No one know what deathplace Fahredin Nuri has.","condition":51},{"pid":15,"factoid":"Hans von Zedlitz was born in berlin","condition":73},{"pid":15,"factoid":"Hans von Zedlitz died in 1948","condition":63},{"pid":15,"factoid":"Hans von Zedlitz is a subject of german male stage actor","condition":69},{"pid":15,"factoid":"No one know what deathplace Hans von Zedlitz has.","condition":57},{"pid":21,"factoid":"Paul Stewart was born in manhattan","condition":47},{"pid":21,"factoid":"Paul Stewart died in 1986","condition":67},{"pid":21,"factoid":"Paul Stewart was born in 1908","condition":49},{"pid":21,"factoid":"No one know what deathplace Paul Stewart has.","condition":59}]}}
