{
"people" : [
{"id":2, "name":"Hans Albert Einstein", "description":" Hans Albert Einstein  was a Swiss-American engineer and educator, and the second child and first son of Albert Einstein and Mileva Marić.  He is best known for his research on sediment transport.", "drootid": 2, "condition":[], "buildingid":0, "image":"PERSON2.png"}, 
{"id":7, "name":"Franklin D. Roosevelt", "description":"Franklin Delano Roosevelt , commonly known as FDR, was an American statesman and political leader who served as the 32nd President of the United States, from 1933 to 1945.  A Democrat, he won a record four presidential elections and dominated his party after 1932 as a central figure in world events during the mid-20th century, leading the United States during a time of worldwide economic depression and total war.", "drootid": 15, "condition":[], "buildingid":0, "image":"PERSON7.png"}, 
{"id":10, "name":"President of Israel", "description":"The President of the State of Israel  is the head of state of Israel.  The position is largely a ceremonial figurehead role, with executive power effectively being exercised by the prime minister.", "drootid": 30, "condition":[], "buildingid":0, "image":"PERSON10.png"}, 
{"id":15, "name":"Edward Teller", "description":"Edward Teller  was a Hungarian-American theoretical physicist who was born in Hungary, and is known colloquially as \"the father of the hydrogen bomb\", although he claimed he did not care for the title.  He made numerous contributions to nuclear and molecular physics, spectroscopy  and surface physics.", "drootid": 48, "condition":[], "buildingid":0, "image":"PERSON15.png"}, 
{"id":20, "name":"Nathan Rosen", "description":"Nathan Rosen  was an American-Israeli physicist noted for his study on the structure of the hydrogen atom and his work with Albert Einstein and Boris Podolsky on entangled wave functions and the EPR paradox.  The Einstein–Rosen bridge, later named the wormhole, was a theory of Nathan Rosen.", "drootid": 62, "condition":[], "buildingid":0, "image":"PERSON20.png"}, 
{"id":6, "name":"Klaus Clusius", "description":"Klaus Paul Alfred Clusius  was a German physical chemist from Breslau , Silesia.  During World War II, he worked on the German nuclear energy project, also known as the Uranium Club; he worked on isotope separation techniques and heavy water production.", "drootid": 26, "condition":[11], "buildingid":5, "image":"PERSON6.png"}, 
{"id":1, "name":"Robert William Boyle", "description":"Robert William Boyle  was a physicist and one of the most important early pioneers in the development of sonar.  Boyle was born in 1883 at Carbonear in the Dominion of Newfoundland.", "drootid": 10, "condition":[5], "buildingid":1, "image":"PERSON1.png"}, 
{"id":3, "name":"Leo Szilard", "description":" Leo Szilard  was a Jewish Hungarian-born physicist and inventor.  He conceived the nuclear chain reaction in 1933, patented the idea of a nuclear reactor with Enrico Fermi, and in late 1939 wrote the letter for Albert Einstein's signature that resulted in the Manhattan Project that built the atomic bomb.", "drootid": 8, "condition":[5], "buildingid":1, "image":"PERSON3.png"}, 
{"id":5, "name":"Neil deGrasse Tyson", "description":"Neil deGrasse Tyson  is an American astrophysicist, cosmologist, author, and science communicator.  Since 1996, he has been the Frederick P.", "drootid": 21, "condition":[8], "buildingid":4, "image":"PERSON5.png"}, 
{"id":11, "name":"Richard Talbert", "description":"Richard John Alexander Talbert  is a British-American contemporary ancient historian and classicist on the faculty of the University of North Carolina at Chapel Hill, where he is William Rand Kenan, Jr. , Professor of Ancient History and Classics.", "drootid": 37, "condition":[14], "buildingid":8, "image":"PERSON11.png"}, 
{"id":12, "name":"William Hale Thompson", "description":"William Hale Thompson  was an American politician, mayor of Chicago from 1915 to 1923 and again from 1927 to 1931.  Known as \"Big Bill\", Thompson was the last Republican to serve as Mayor of Chicago .", "drootid": 41, "condition":[16], "buildingid":9, "image":"PERSON12.png"}, 
{"id":16, "name":"Casimir Funk", "description":"Kazimierz Funk [kaˈʑimjɛʂ ˈfuŋk] , commonly anglicized as Casimir Funk, was a Polish biochemist, generally credited with being among the first to formulate  the concept of vitamins, which he called \"vital amines\" or \"vitamines\".", "drootid": 54, "condition":[22], "buildingid":9, "image":"PERSON16.png"}, 
{"id":9, "name":"Emory Leon Chaffee", "description":"Emory Leon Chaffee  was an American physicist and a former professor at Harvard University from 1911 to 1953.  Chaffee was born in Somerville, Massachusetts.", "drootid": 44, "condition":[17], "buildingid":7, "image":"PERSON9.png"}, 
{"id":14, "name":"Ralph Asher Alpher", "description":"Ralph Asher Alpher  was an American cosmologist, who carried out pioneering work in the early 1950s on the Big Bang model, including big bang nucleosynthesis and predictions of the cosmic microwave background radiation.", "drootid": 57, "condition":[23], "buildingid":10, "image":"PERSON14.png"}, 
{"id":21, "name":"Isaac Noah Mannheimer", "description":"Isaac Noah Mannheimer  was a Jewish preacher.", "drootid": 73, "condition":[28], "buildingid":14, "image":"PERSON21.png"}, 
{"id":18, "name":"Moritz Schlick", "description":"Friedrich Albert Moritz Schlick  was a German philosopher, physicist, and the founding father of logical positivism and the Vienna Circle.", "drootid": 69, "condition":[26], "buildingid":12, "image":"PERSON18.png"}, 
{"id":19, "name":"Max Perutz", "description":"Max Ferdinand Perutz OM CH CBE FRS  was an Austrian-born British molecular biologist, who shared the 1962 Nobel Prize for Chemistry with John Kendrew, for their studies of the structures of haemoglobin and myoglobin.  He went on to win the Royal Medal of the Royal Society in 1971 and the Copley Medal in 1979.", "drootid": 76, "condition":[29], "buildingid":13, "image":"PERSON19.png"}],
"items":[{"id":0, "name":"The Evolution of Physics: The Growth of Ideas From Early Concepts to Relativity and Quanta", "description":"It is a photograph about The Evolution of Physics: The Growth of Ideas From Early Concepts to Relativity and Quanta. In a corner, it says:The Evolution of Physics: The Growth of Ideas From Early Concepts to Relativity and Quanta is a science book for the lay reader, by Albert Einstein and Leopold Infeld, tracing the development of ideas in physics.  It was originally published in 1938 by Cambridge University Press.  There are things written behind: Physics The Feynman Lectures on Physics Institute for Advanced Study James Clerk Maxwell  And the following place: Switzerland", "condition": [2], "eventid": 4, "buildingid":2, "itemtype":"photograph", "image":"PHOTO0.png"}, 
{"id":1, "name":"Physics", "description":"It is a photograph about Physics. In a corner, it says:Physics  phusikḗ  \"knowledge of nature\", from φύσις phúsis \"nature\" is the natural science that involves the study of matter and its motion and behavior through space and time, along with related concepts such as energy and force.  One of the most fundamental scientific disciplines, the main goal of physics is to understand how the universe behaves.  There are things written behind: Sean M. Carroll Robert William Boyle Leo Szilard   And the following place: United Kingdom", "condition": [4], "eventid": 5, "buildingid":3, "itemtype":"photograph", "image":"PHOTO01.png"}, 
{"id":2, "name":"Ph.D.", "description":"It is a photograph about Ph.D.. In a corner, it says:A Doctor of Philosophy  is a type of doctorate degree awarded by universities in many countries.  Ph.  There are things written behind: Klaus Clusius Neil deGrasse Tyson   And the following place: Switzerland", "condition": [10], "eventid": 11, "buildingid":6, "itemtype":"photograph", "image":"null"}, 
{"id":3, "name":"American Association of University Professors", "description":"It is a book about American Association of University Professors. It says: The American Association of University Professors  is an organization of professors and other academics in the United States.  AAUP membership is about 47,000, with over 500 local campus chapters and 39 state organizations.  The following people are mentioned:  United_States United States American International College National Park Community College University of Bridgeport", "condition": [20], "eventid": 22, "buildingid":11, "itemtype":"book", "image":"null"}],
"buildings":[{"id":0, "name":"House of Albert Einstein", "description":" and Swiss Confederation  Switzerland , officially the Swiss Confederation is a federal republic in Europe", "locktype": "null", "coordx": 88, "coordy": 166, "condition":[], "cityid":0, "peopleid":[2,7,10,15,20], "itemsid":[], "image":"BUILDING0.png"}, 
{"id":2, "name":"Villa", "description":" While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\"  The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east", "locktype": "null", "coordx": 77, "coordy": 186, "condition":[2], "cityid":0, "peopleid":[], "itemsid":[0], "image":"BUILDING2.png"}, 
{"id":3, "name":"Castle", "description":" Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2  While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zürich and Geneva", "locktype": "null", "coordx": 59, "coordy": 157, "condition":[4], "cityid":0, "peopleid":[], "itemsid":[1], "image":"BUILDING3.png"}, 
{"id":5, "name":"House of Klaus Clusius", "description":" The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648", "locktype": "null", "coordx": 225, "coordy": 109, "condition":[11], "cityid":0, "peopleid":[6], "itemsid":[], "image":"BUILDING5.png"}, 
{"id":1, "name":"House of Robert William Boyle", "description":"The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom  or Britain, is a sovereign state in Europe Lying off the north-western coast of the European mainland, it includes the island of Great Britain , the north-eastern part of the island of Ireland, and many smaller islands", "locktype": "null", "coordx": 56, "coordy": 256, "condition":[5,5], "cityid":1, "peopleid":[1,3], "itemsid":[], "image":"BUILDING1.png"}, 
{"id":4, "name":"House of Neil deGrasse Tyson", "description":"Manhattan  is the most densely populated borough of New York City, its economic and administrative center, and the city's historical birthplace The borough is coterminous with New York County, founded on November 1, 1683, as one of the original counties of the U", "locktype": "null", "coordx": 276, "coordy": 243, "condition":[8], "cityid":2, "peopleid":[5], "itemsid":[], "image":"BUILDING4.png"}, 
{"id":6, "name":"Prison", "description":"S state of New York", "locktype": "null", "coordx": 75, "coordy": 188, "condition":[10], "cityid":2, "peopleid":[], "itemsid":[2], "image":"BUILDING6.png"}, 
{"id":8, "name":"Prison", "description":" Princeton was founded before the American Revolution and is best known as the location of Princeton University, located in the community since 1756 Although its association with the university is primarily what makes Princeton a college town, other important institutions in the area include the Institute for Advanced Study, Westminster Choir College, Princeton Plasma Physics Laboratory, Princeton Theological Seminary, Opinion Research Corporation, Bristol-Myers Squibb, Siemens Corporate Research, SRI International, FMC Corporation, The Robert Wood Johnson Foundation, Amrep, Church and Dwight, Berlitz International, and Dow Jones & Company", "locktype": "null", "coordx": 124, "coordy": 133, "condition":[14,14,14], "cityid":4, "peopleid":[11], "itemsid":[], "image":"BUILDING8.png"}, 
{"id":11, "name":"Police Station", "description":" Princeton is roughly equidistant from New York City and Philadelphia Princeton is close to many major highways that serve both cities, and receives major television and radio broadcasts from each", "locktype": "null", "coordx": 102, "coordy": 202, "condition":[20], "cityid":4, "peopleid":[], "itemsid":[3], "image":"BUILDING11.png"}, 
{"id":9, "name":"Planetarium", "description":", US , USA , and United States  The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions", "locktype": "null", "coordx": 176, "coordy": 171, "condition":[16,22], "cityid":5, "peopleid":[12,16], "itemsid":[], "image":"BUILDING9.png"}, 
{"id":7, "name":"House of Emory Leon Chaffee", "description":"Somerville /ˈsʌmərvɪl/ is a city in Middlesex County, Massachusetts, United States, located two miles northwest of Boston As of 2010, the United States Census has the city with a total population of 75,754 people, and is the most densely populated municipality in New England", "locktype": "null", "coordx": 325, "coordy": 96, "condition":[17], "cityid":6, "peopleid":[9], "itemsid":[], "image":"BUILDING7.png"}, 
{"id":10, "name":"House of Ralph Asher Alpher", "description":"Washington, DC", "locktype": "null", "coordx": 75, "coordy": 92, "condition":[23], "cityid":8, "peopleid":[14], "itemsid":[], "image":"BUILDING10.png"}, 
{"id":14, "name":"Villa", "description":"Vienna   is the capital and largest city of Austria and one of the nine states of Austria Vienna is Austria's primary city, with a population of about 1", "locktype": "null", "coordx": 233, "coordy": 74, "condition":[28], "cityid":9, "peopleid":[21], "itemsid":[], "image":"BUILDING14.png"}, 
{"id":12, "name":"House of Moritz Schlick", "description":"Berlin  is the capital and the largest city of Germany as well as one of its 16 states With a population of approximately 3", "locktype": "null", "coordx": 172, "coordy": 145, "condition":[26], "cityid":10, "peopleid":[18], "itemsid":[], "image":"BUILDING12.png"}, 
{"id":13, "name":"House of Max Perutz", "description":"Austria-Hungary , also known by  and often referred to as the Austro-Hungarian Empire in English-language sources, was a constitutional union of the Austrian Empire  and the Kingdom of Hungary  that existed from 1867 to 1918, when it collapsed as a result of defeat in World War I The union was a result of the Austro-Hungarian Compromise of 1867 and came into existence on 30 March 1867, when the compromise was ratified by the Hungarian parliament", "locktype": "null", "coordx": 219, "coordy": 190, "condition":[29], "cityid":11, "peopleid":[19], "itemsid":[], "image":"BUILDING13.png"}],
"cities":[{"id":0, "name":"Switzerland", "description":" and Swiss Confederation . Switzerland , officially the Swiss Confederation is a federal republic in Europe. While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\" . The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2 . While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zürich and Geneva. The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. The country has a history of armed neutrality going back to the Reformation, it has not been in a state of war internationally since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. In addition to being the birthplace of the Red Cross, Switzerland is home to numerous international organisations, including the second largest UN office. On the European level, it is a founding member of the European Free Trade Association, but notably it is not part of the European Union, nor the European Economic Area. However, the country does participate in the Schengen Area and the EU's single market through a number of bilateral treaties. Spanning the intersection of Germanic and Romance Europe, Switzerland comprises four main linguistic and cultural regions: German, French, Italian and Romansh. Although the majority of the population are German speaking, Swiss national identity is rooted in a common historical background, shared values such as federalism and direct democracy, and Alpine symbolism. Due to its linguistic diversity, Switzerland is known by a variety of native names: Schweiz [ˈʃvaɪts] ; Suisse [sɥis] ; Svizzera [ˈzvittsera] ; and Svizra [ˈʒviːtsrɐ] or [ˈʒviːtsʁːɐ] . On coins and stamps, Latin  is used instead of the four living languages. Switzerland is one of the most developed countries in the world, with the highest nominal wealth per adult and the eighth-highest per capita gross domestic product according to the IMF. Switzerland ranks at or near the top globally in several metrics of national performance, including government transparency, civil liberties, quality of life, economic competitiveness, and human development. Zürich and Geneva have each been ranked among the top cities in the world in terms of quality of life, with the former ranked second globally, according to Mercer.", "coordx": 210, "coordy": 124, "condition":[], "buildingid":[0,2,3,5], "image":"CITY0.png"}, 
{"id":1, "name":"United Kingdom", "description":"The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom  or Britain, is a sovereign state in Europe. Lying off the north-western coast of the European mainland, it includes the island of Great Britain , the north-eastern part of the island of Ireland, and many smaller islands. Northern Ireland is the only part of the UK that shares a land border with another sovereign state—the Republic of Ireland. Apart from this land border, the UK is surrounded by the Atlantic Ocean, with the North Sea to its east, the English Channel to its south and the Celtic Sea to its south-southwest, giving it the 12th longest coastline in the world. The Irish Sea lies between Great Britain and Ireland. With an area of 242,500 square kilometres , the UK is the 78th-largest sovereign state in the world and the 11th-largest in Europe. It is also the 21st-most populous country, with an estimated 65.1 million inhabitants. Together, this makes it the fourth most densely populated country in the European Union. The United Kingdom is a constitutional monarchy with a parliamentary system of governance. The monarch—since 6 February 1952—is Queen Elizabeth II. The capital of UK and its largest city is London, a global city and financial centre with an urban area population of 10.3 million, the fourth-largest in Europe and second-largest in the European Union. Other major urban areas in the UK include the regions of Manchester, Birmingham, Leeds, Glasgow and Liverpool. The UK consists of four countries, England, Scotland, Wales and Northern Ireland. The latter three have devolved administrations, each with varying powers, based in their capitals, Edinburgh, Cardiff, and Belfast, respectively. The nearby Isle of Man, Bailiwick of Guernsey and Bailiwick of Jersey are not part of the United Kingdom, being Crown dependencies with the British Government responsible for defence and international representation. The relationships among the countries of the United Kingdom have changed over time. Wales was annexed by the Kingdom of England under the Acts of Union of 1536 and 1542. A treaty between England and Scotland resulted in 1707 in a unified Kingdom of Great Britain, which merged in 1801 with the Kingdom of Ireland to form the United Kingdom of Great Britain and Ireland. In 1922, five-sixths of Ireland seceded from the country, leaving the present formulation of the United Kingdom of Great Britain and Northern Ireland. There are fourteen British Overseas Territories. These are the remnants of the British Empire which, at its height in the 1920s, encompassed almost a quarter of the world's land mass and was the largest empire in history. British influence can be observed in the language, culture, and legal systems of many of its former colonies. The United Kingdom is a developed country and has the world's fifth-largest economy by nominal GDP and ninth-largest economy by purchasing power parity. The UK is considered to have a high-income economy and is categorised as very high in the Human Development Index, ranking 14th in the world. It was the world's first industrialised country and the world's foremost power during the 19th and early 20th centuries. The UK remains a great power with considerable economic, cultural, military, scientific, and political influence internationally. It is a recognised nuclear weapons state and its military expenditure ranks fourth or fifth in the world. The UK has been a permanent member of the United Nations Security Council since its first session in 1946. It has been a leading member state of the European Union  and its predecessor, the European Economic Community , since 1973. However, on 23 June 2016, a national referendum on the UK's membership of the EU resulted in a 51.9% vote to exit. The UK is also a member of the Commonwealth of Nations, the Council of Europe, the G7 finance ministers, the G7 forum, the G20, NATO, the Organisation for Economic Co-operation and Development , and the World Trade Organization .", "coordx": 199, "coordy": 114, "condition":[5,5], "buildingid":[1], "image":"CITY1.png"}, 
{"id":2, "name":"Manhattan", "description":"Manhattan  is the most densely populated borough of New York City, its economic and administrative center, and the city's historical birthplace. The borough is coterminous with New York County, founded on November 1, 1683, as one of the original counties of the U.S. state of New York. The borough consists mostly of Manhattan Island, bounded by the East, Hudson, and Harlem Rivers, and also includes several small adjacent islands and Marble Hill, a small neighborhood on the U.S. mainland. Manhattan is often described as the cultural and financial capital of the world and hosts the United Nations Headquarters. Anchored by Wall Street in the Financial District of Lower Manhattan, New York City has been called both the most economically powerful city and the leading financial center of the world, and Manhattan is home to the world's two largest stock exchanges by total market capitalization: the New York Stock Exchange and NASDAQ. Many multinational media conglomerates are based in the borough. It is historically documented to have been purchased by Dutch colonists from Native Americans in 1626, for 60 guilders or about $24 in 1626 and US$1050 today. Manhattan real estate has since become among the most expensive in the world, with the value of Manhattan Island, including real estate, estimated to exceed US$3 trillion in 2013; residential property sale prices in Manhattan typically exceeded US$1,400 per square foot  as of 2016. New York County is the United States' second-smallest county by land area , and is also the most densely populated U.S. county. It is also one of the most densely populated areas in the world, with a census-estimated 2015 population of 1,644,518 living in a land area of 22.83 square miles , or 72,033 residents per square mile , higher than the density of any individual American city. On business days, the influx of commuters increases that number to over 3.9 million, or more than 170,000 people per square mile . Manhattan has the third-largest population of New York City's five boroughs, after Brooklyn and Queens, and is the smallest borough in terms of land area. Many districts and landmarks in Manhattan have become well known, as New York City received a record of nearly 60 million tourists in 2015, and Manhattan hosts three of the world's 10 most-visited tourist attractions in 2013: Times Square, Central Park, and Grand Central Terminal. The borough hosts many world-renowned bridges, such as the Brooklyn Bridge; skyscrapers such as the Empire State Building, one of the tallest skyscrapers in the world; and parks, such as Central Park. There are many historically significant places in Manhattan: Chinatown incorporates the highest concentration of Chinese people in the Western Hemisphere, and the Stonewall Inn in Greenwich Village is considered the birthplace of the modern gay rights movement. The City of New York was founded at the southern tip of Manhattan, and the borough houses New York City Hall, the seat of the City's Government. Numerous colleges and universities are located in Manhattan, including Columbia University, New York University, Weill Cornell Medical College, and Rockefeller University, which have been ranked among the top 35 in the world.", "coordx": 94, "coordy": 136, "condition":[8,10], "buildingid":[4,6], "image":"CITY2.png"}, 
{"id":4, "name":"Princeton, New Jersey", "description":"Princeton is a municipality with a borough form of government in Mercer County, New Jersey, United States, that was established in its current form on January 1, 2013, through the consolidation of the Borough of Princeton and Princeton Township. As of the 2010 United States Census, the municipality's population was 28,572, reflecting the former township's population of 16,265, along with the 12,307 in the former borough. Princeton was founded before the American Revolution and is best known as the location of Princeton University, located in the community since 1756. Although its association with the university is primarily what makes Princeton a college town, other important institutions in the area include the Institute for Advanced Study, Westminster Choir College, Princeton Plasma Physics Laboratory, Princeton Theological Seminary, Opinion Research Corporation, Bristol-Myers Squibb, Siemens Corporate Research, SRI International, FMC Corporation, The Robert Wood Johnson Foundation, Amrep, Church and Dwight, Berlitz International, and Dow Jones & Company. Princeton is roughly equidistant from New York City and Philadelphia. Princeton is close to many major highways that serve both cities, and receives major television and radio broadcasts from each. New Jersey's capital is the city of Trenton, but the governor's official residence has been in Princeton since 1945, when Morven in the borough became the first Governor's mansion. It was later replaced by the larger Drumthwacket, a colonial mansion located in the former Township. Morven became a museum property of the New Jersey Historical Society. Princeton was ranked 15th of the top 100 towns in the United States to Live and Work In by Money Magazine in 2005. Although residents of Princeton  traditionally have a strong community-wide identity, the community had been composed of two separate municipalities: a township and a borough. The central borough was completely surrounded by the township. The Borough seceded from the Township in 1894 in a dispute over school taxes; the two municipalities later formed the Princeton Public Schools, and some other public services were conducted together before they were reunited into a single Princeton in January 2013. The Borough contained Nassau Street, the main commercial street, most of the University campus, and incorporated most of the urban area until the postwar suburbanization. The Borough and Township had roughly equal populations.", "coordx": 93, "coordy": 137, "condition":[14,14,14,14,14,14,20], "buildingid":[8,11], "image":"CITY4.png"}, 
{"id":5, "name":"the United States", "description":", US , USA , and United States . The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.The 48 contiguous states and federal district are in central North America between Canada and Mexico, with the state of Alaska in the northwestern part of North America and the state of Hawaii comprising an archipelago in the mid-Pacific. The territories are scattered about the Pacific Ocean and the Caribbean Sea. At 3.8 million square miles  and with over 324 million people, the United States is the world's third-largest country by total area  and the third-most populous. It is one of the world's most ethnically diverse and multicultural nations, the product of large-scale immigration from many other countries. The country's capital is Washington, D.C. and its largest city is New York City; other major metropolitan areas include Los Angeles, Chicago, Dallas, San Francisco, Boston, Philadelphia, Houston, Atlanta, and Miami. The geography, climate and wildlife of the country are extremely diverse. Paleo-Indians migrated from Asia to the North American mainland at least 15,000 years ago, with European colonization beginning in the 16th century. The United States emerged from 13 British colonies along the East Coast. Numerous disputes between Great Britain and the colonies in the aftermath of the Seven Years War led to the American Revolution, which began in 1775. On July 4, 1776, as the colonies were fighting Great Britain in the American Revolutionary War, delegates from the 13 colonies unanimously adopted the Declaration of Independence. The war ended in 1783 with recognition of the independence of the United States by Great Britain, and was the first successful war of independence against a European colonial empire. The current constitution was adopted in 1788, after the Articles of Confederation, adopted in 1781, were felt to have provided inadequate federal powers. The first ten amendments, collectively named the Bill of Rights, were ratified in 1791 and designed to guarantee many fundamental civil liberties. The United States embarked on a vigorous expansion across North America throughout the 19th century, displacing American Indian tribes, acquiring new territories, and gradually admitting new states until it spanned the continent by 1848. During the second half of the 19th century, the American Civil War led to the end of legal slavery in the country. By the end of that century, the United States extended into the Pacific Ocean, and its economy, driven in large part by the Industrial Revolution, began to soar. The Spanish–American War and World War I confirmed the country's status as a global military power. The United States emerged from World War II as a global superpower, the first country to develop nuclear weapons, the only country to use them in warfare, and a permanent member of the United Nations Security Council. The end of the Cold War and the dissolution of the Soviet Union in 1991 left the United States as the world's sole superpower. The United States is a highly developed country, with the world's largest economy by nominal GDP. It ranks highly in several measures of socioeconomic performance, including average wage, human development, per capita GDP, and productivity per person. While the U.S. economy is considered post-industrial, characterized by the dominance of services, the manufacturing sector remains the second-largest in the world. Though its population is only 4.4% of the world total, the United States accounts for nearly a quarter of world GDP and almost a third of global military spending, making it the world's foremost military and economic power. The United States is a prominent political and cultural force internationally, and a leader in scientific research and technological innovations.", "coordx": 90, "coordy": 139, "condition":[16,22], "buildingid":[9], "image":"CITY5.png"}, 
{"id":6, "name":"Somerville, Massachusetts", "description":"Somerville /ˈsʌmərvɪl/ is a city in Middlesex County, Massachusetts, United States, located two miles northwest of Boston. As of 2010, the United States Census has the city with a total population of 75,754 people, and is the most densely populated municipality in New England. As of 2010, it was the 16th most densely populated incorporated municipality in the country. Somerville was established as a town in 1842, when it was separated from Charlestown. In 2006, the town was named the best-run city in Massachusetts by the Boston Globe. In 1972, in 2009, and again in 2015, the city received the All-America City Award.", "coordx": 98, "coordy": 133, "condition":[17], "buildingid":[7], "image":"CITY6.png"}, 
{"id":8, "name":"District of Columbia", "description":"Washington, D.C., formally the District of Columbia and commonly referred to as \"Washington\", \"the District\", or simply \"D.C.\", is the capital of the United States. The signing of the Residence Act on July 16, 1790, approved the creation of a capital district located along the Potomac River on the country's East Coast. The U.S. Constitution provided for a federal district under the exclusive jurisdiction of the Congress and the District is therefore not a part of any state. The states of Maryland and Virginia each donated land to form the federal district, which included the pre-existing settlements of Georgetown and Alexandria. Named in honor of President George Washington, the City of Washington was founded in 1791 to serve as the new national capital. In 1846, Congress returned the land originally ceded by Virginia; in 1871, it created a single municipal government for the remaining portion of the District. Washington had an estimated population of 672,228 as of July 2015. Commuters from the surrounding Maryland and Virginia suburbs raise the city's population to more than one million during the workweek. The Washington metropolitan area, of which the District is a part, has a population of over 6 million, the sixth-largest metropolitan statistical area in the country. The centers of all three branches of the federal government of the United States are in the District, including the Congress, President, and Supreme Court. Washington is home to many national monuments and museums, which are primarily situated on or around the National Mall. The city hosts 176 foreign embassies as well as the headquarters of many international organizations, trade unions, non-profit organizations, lobbying groups, and professional associations. A locally elected mayor and a 13‑member council have governed the District since 1973. However, the Congress maintains supreme authority over the city and may overturn local laws. D.C. residents elect a non-voting, at-large congressional delegate to the House of Representatives, but the District has no representation in the Senate. The District receives three electoral votes in presidential elections as permitted by the Twenty-third Amendment to the United States Constitution, ratified in 1961.", "coordx": 90, "coordy": 139, "condition":[23], "buildingid":[10], "image":"CITY8.png"}, 
{"id":9, "name":"Vienna", "description":"Vienna   is the capital and largest city of Austria and one of the nine states of Austria. Vienna is Austria's primary city, with a population of about 1.8 million , and its cultural, economic, and political centre. It is the 7th-largest city by population within city limits in the European Union. Until the beginning of the 20th century, it was the largest German-speaking city in the world, and before the splitting of the Austro-Hungarian Empire in World War I, the city had 2 million inhabitants. Today, it has the second largest number of German speakers after Berlin. Vienna is host to many major international organizations, including the United Nations and OPEC. The city is located in the eastern part of Austria and is close to the borders of the Czech Republic, Slovakia, and Hungary. These regions work together in a European Centrope border region. Along with nearby Bratislava, Vienna forms a metropolitan region with 3 million inhabitants. In 2001, the city centre was designated a UNESCO World Heritage Site. Apart from being regarded as the City of Music because of its musical legacy, Vienna is also said to be \"The City of Dreams\" because it was home to the world's first psycho-analyst – Sigmund Freud. The city's roots lie in early Celtic and Roman settlements that transformed into a Medieval and Baroque city, and then the capital of the Austro-Hungarian Empire. It is well known for having played an essential role as a leading European music centre, from the great age of Viennese Classicism through the early part of the 20th century. The historic centre of Vienna is rich in architectural ensembles, including Baroque castles and gardens, and the late-19th-century Ringstraße lined with grand buildings, monuments and parks. Vienna is known for its high quality of life. In a 2005 study of 127 world cities, the Economist Intelligence Unit ranked the city first  for the world's most livable cities. Between 2011 and 2015, Vienna was ranked second, behind Melbourne, Australia.For seven consecutive years , the human-resource-consulting firm Mercer ranked Vienna first in its annual \"Quality of Living\" survey of hundreds of cities around the world, a title the city still holds in 2015. Monocle's 2015 \"Quality of Life Survey\" ranked Vienna second on a list of the top 25 cities in the world \"to make a base within.\" The UN-Habitat has classified Vienna as being the most prosperous city in the world in 2012/2013.The city was ranked 1st globally for its culture of innovation in 2007 and 2008, and sixth globally  in the 2014 Innovation Cities Index, which analyzed 162 indicators in covering three areas: culture, infrastructure, and markets. Vienna regularly hosts urban planning conferences and is often used as a case study by urban planners. Between 2005 and 2010, Vienna was the world's number-one destination for international congresses and conventions. It attracts over 3.7 million tourists a year.", "coordx": 223, "coordy": 121, "condition":[28], "buildingid":[14], "image":"CITY9.png"}, 
{"id":10, "name":"Berlin", "description":"Berlin  is the capital and the largest city of Germany as well as one of its 16 states. With a population of approximately 3.6 million people, Berlin is the second most populous city proper and the seventh most populous urban area in the European Union. Located in northeastern Germany on the banks of Rivers Spree and Havel, it is the centre of the Berlin-Brandenburg Metropolitan Region, which has about 6 million residents from more than 180 nations. Due to its location in the European Plain, Berlin is influenced by a temperate seasonal climate. Around one-third of the city's area is composed of forests, parks, gardens, rivers and lakes. First documented in the 13th century and situated at the crossing of two important historic trade routes, Berlin became the capital of the Margraviate of Brandenburg , the Kingdom of Prussia , the German Empire , the Weimar Republic  and the Third Reich . Berlin in the 1920s was the third largest municipality in the world. After World War II, the city was divided; East Berlin became the capital of East Germany while West Berlin became a de facto West German exclave, surrounded by the Berlin Wall  and East Germany territory. Following German reunification in 1990, Berlin was once again designated as the capital of united Germany. Berlin is a world city of culture, politics, media and science. Its economy is based on high-tech firms and the service sector, encompassing a diverse range of creative industries, research facilities, media corporations and convention venues. Berlin serves as a continental hub for air and rail traffic and has a highly complex public transportation network. The metropolis is a popular tourist destination. Significant industries also include IT, pharmaceuticals, biomedical engineering, clean tech, biotechnology, construction and electronics. Modern Berlin is home to world renowned universities, orchestras, museums, entertainment venues and is host to many sporting events. Its urban setting has made it a sought-after location for international film productions. The city is well known for its festivals, diverse architecture, nightlife, contemporary arts and a high quality of living. Over the last decade Berlin has seen the emergence of a cosmopolitan entrepreneurial scene.", "coordx": 219, "coordy": 111, "condition":[26], "buildingid":[12], "image":"CITY10.png"}, 
{"id":11, "name":"Austria-Hungary", "description":"Austria-Hungary , also known by  and often referred to as the Austro-Hungarian Empire in English-language sources, was a constitutional union of the Austrian Empire  and the Kingdom of Hungary  that existed from 1867 to 1918, when it collapsed as a result of defeat in World War I. The union was a result of the Austro-Hungarian Compromise of 1867 and came into existence on 30 March 1867, when the compromise was ratified by the Hungarian parliament. Austria-Hungary consisted of two monarchies , and one autonomous region: the Kingdom of Croatia-Slavonia under the Hungarian crown, which negotiated the Croatian–Hungarian Settlement  in 1868. It was ruled by the House of Habsburg, and constituted the last phase in the constitutional evolution of the Habsburg Monarchy. Following the 1867 reforms, the Austrian and the Hungarian states were co-equal. The Compromise required regular renewal, as did the customs union between the two components of the union. Foreign affairs and the military came under joint oversight, but all other governmental faculties were divided between respective states. Austria-Hungary was a multinational state and one of the world's great powers at the time. Austria-Hungary was geographically the second-largest country in Europe after the Russian Empire, at 621,538 km2 , and the third-most populous . The Empire built up the fourth-largest machine building industry of the world, after the United States, Germany, and the United Kingdom of Great Britain and Ireland. Austria-Hungary also became the world's third largest manufacturer and exporter of electric home appliances, electric industrial appliances and power generation apparatuses for power plants, after the United States and the German Empire. After 1878, Bosnia and Herzegovina was under Austro-Hungarian military and civilian rule until it was fully annexed in 1908, provoking the Bosnian crisis among the other powers. Sandžak/Raška, de jure northern part of the Ottoman Sanjak of Novi Pazar, was also under de facto joint occupation during that period but the Austro-Hungarian army withdrew as part of their annexation of Bosnia. The annexation of Bosnia also led to Islam being recognized as an official state religion due to Bosnia's Muslim population. Austria-Hungary was one of the Central Powers in World War I. It was already effectively dissolved by the time the military authorities signed the armistice of Villa Giusti on November 3, 1918. The Kingdom of Hungary and the First Austrian Republic were treated as its successors de jure, whereas the independence of the West Slavs and South Slavs of the Empire as the First Czechoslovak Republic, the Second Polish Republic and the Kingdom of Yugoslavia, respectively, and most of the territorial demands of the Kingdom of Romania were also recognized by the victorious powers in 1920.", "coordx": 223, "coordy": 121, "condition":[29], "buildingid":[13], "image":"CITY11.png"}],
"dialoguenodes":[{"id":76, "dialogueline":"I don't have to speak to you", "eventid":"-1", "dialoguetype": 100, "children": [77,83,99,107,115], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":115, "dialogueline":"My field was physics", "eventid":"67", "dialoguetype": 626, "children": [76], "keywords": [], "condition":[66], "option":"Tell me about yourself.", "isroot": false}, 
{"id":107, "dialogueline":"I died in england", "eventid":"59", "dialoguetype": 626, "children": [76], "keywords": [], "condition":[58], "option":"Tell me about yourself.", "isroot": false}, 
{"id":99, "dialogueline":"I am know for birthplace. austria-hungary", "eventid":"51", "dialoguetype": 626, "children": [76], "keywords": [], "condition":[50], "option":"Tell me about yourself.", "isroot": false}, 
{"id":83, "dialogueline":"My nationality am canadians", "eventid":"35", "dialoguetype": 626, "children": [76], "keywords": [], "condition":[34], "option":"Tell me about yourself.", "isroot": false}, 
{"id":77, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [76], "keywords": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":69, "dialogueline":"Greetings. Do you want something?", "eventid":"-1", "dialoguetype": 0, "children": [70], "keywords": ["Max Perutz","Isaac Noah Mannheimer","Villa","Vienna"], "condition":[], "option":"", "isroot": true}, 
{"id":70, "dialogueline":"Certainly.", "eventid":"-1", "dialoguetype": 0, "children": [71,102,104,106,108,110], "keywords": ["Max Perutz","Isaac Noah Mannheimer","Villa","Vienna"], "condition":[], "option":"Hello, I'm assigned to the victim's case. I'm sorry to disturb, I ask that you answer some questions.", "isroot": false}, 
{"id":110, "dialogueline":"Ralph Asher Alpher's field was Cosmology", "eventid":"62", "dialoguetype": 616, "children": [70], "keywords": ["field","Cosmology","Ralph Asher Alpher"], "condition":[-1], "option":"I could use some help. Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":108, "dialogueline":"Ralph Asher Alpher was born in washington, d.c.", "eventid":"60", "dialoguetype": 616, "children": [70], "keywords": ["born","birth","washington, d.c.","Ralph Asher Alpher"], "condition":[-1], "option":"Do you know some information about one of the suspects?", "isroot": false}, 
{"id":106, "dialogueline":"Max Perutz died in cambridge", "eventid":"58", "dialoguetype": 616, "children": [70], "keywords": ["died","dead","cambridge","Max Perutz"], "condition":[-1], "option":"Do you have some information about one of the suspects?", "isroot": false}, 
{"id":104, "dialogueline":"Robert William Boyle's nationality is Canadians", "eventid":"56", "dialoguetype": 616, "children": [70], "keywords": ["nationality","Canadians","Robert William Boyle"], "condition":[-1], "option":"Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":102, "dialogueline":"Robert William Boyle was born in dominion of newfoundland", "eventid":"54", "dialoguetype": 616, "children": [70], "keywords": ["born","birth","dominion of newfoundland","Robert William Boyle"], "condition":[-1], "option":"Do you have any information about one of the suspects?", "isroot": false}, 
{"id":71, "dialogueline":"I think the Villa might have a clue.", "eventid":"-1", "dialoguetype": 0, "children": [72], "keywords": ["Max Perutz","Isaac Noah Mannheimer","Villa","Vienna"], "condition":[], "option":"Someone encouraged me to talk to Max Perutz. Have you know of them?", "isroot": false}, 
{"id":72, "dialogueline":"Last I had heard it is was rumored to be in Vienna. Try there.", "eventid":"28", "dialoguetype": 0, "children": [70], "keywords": ["Max Perutz","Isaac Noah Mannheimer","Villa","Vienna"], "condition":[], "option":"Where would I go to find the Villa?", "isroot": false}, 
{"id":73, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [74], "keywords": ["Max Perutz","Max Perutz","Austria-Hungary"], "condition":[], "option":"", "isroot": true}, 
{"id":74, "dialogueline":"Sure. Anything to help.", "eventid":"-1", "dialoguetype": 100, "children": [75], "keywords": ["Max Perutz","Max Perutz","Austria-Hungary"], "condition":[], "option":"Hello, I'm investigating the victim's case. Could I ask you some questions?", "isroot": false}, 
{"id":75, "dialogueline":"They travelled to Austria-Hungary. They probably will be there.", "eventid":"29", "dialoguetype": 0, "children": [74], "keywords": ["Max Perutz","Max Perutz","Austria-Hungary"], "condition":[], "option":"A friend told me to seek out Max Perutz. Have you know of them?", "isroot": false}, 
{"id":57, "dialogueline":"I'm innocent", "eventid":"-1", "dialoguetype": 100, "children": [58,91,109,111,117], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":117, "dialogueline":"I am know for nationality. united states", "eventid":"69", "dialoguetype": 626, "children": [57], "keywords": [], "condition":[68], "option":"Tell me about yourself.", "isroot": false}, 
{"id":111, "dialogueline":"I am know for field. cosmology", "eventid":"63", "dialoguetype": 626, "children": [57], "keywords": [], "condition":[62], "option":"Tell me about yourself.", "isroot": false}, 
{"id":109, "dialogueline":"I am know for birthplace. washington, d.c.", "eventid":"61", "dialoguetype": 626, "children": [57], "keywords": [], "condition":[60], "option":"Tell me about yourself.", "isroot": false}, 
{"id":91, "dialogueline":"I am know for deathplace. texas", "eventid":"43", "dialoguetype": 626, "children": [57], "keywords": [], "condition":[42], "option":"Tell me about yourself.", "isroot": false}, 
{"id":58, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [57], "keywords": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":44, "dialogueline":"You can't prove anything!", "eventid":"-1", "dialoguetype": 100, "children": [45,85,89,95,101], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":101, "dialogueline":"I am know for field. physics", "eventid":"53", "dialoguetype": 626, "children": [44], "keywords": [], "condition":[52], "option":"Tell me about yourself.", "isroot": false}, 
{"id":95, "dialogueline":"I am know for deathplace. waltham, massachusetts", "eventid":"47", "dialoguetype": 626, "children": [44], "keywords": [], "condition":[46], "option":"Tell me about yourself.", "isroot": false}, 
{"id":89, "dialogueline":"I am know for birthplace. somerville, massachusetts", "eventid":"41", "dialoguetype": 626, "children": [44], "keywords": [], "condition":[40], "option":"Tell me about yourself.", "isroot": false}, 
{"id":85, "dialogueline":"I am know for nationality. united states", "eventid":"37", "dialoguetype": 626, "children": [44], "keywords": [], "condition":[36], "option":"Tell me about yourself.", "isroot": false}, 
{"id":45, "dialogueline":"You have no proof.", "eventid":"-1", "dialoguetype": 0, "children": [44], "keywords": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":54, "dialogueline":"Hello?", "eventid":"-1", "dialoguetype": 0, "children": [55], "keywords": ["Ralph Asher Alpher","Ralph Asher Alpher","District of Columbia"], "condition":[], "option":"", "isroot": true}, 
{"id":55, "dialogueline":"Yes. Ask away.", "eventid":"-1", "dialoguetype": 100, "children": [56], "keywords": ["Ralph Asher Alpher","Ralph Asher Alpher","District of Columbia"], "condition":[], "option":"Greetings, I'm assigned to the victim's case. Can I ask you some questions?", "isroot": false}, 
{"id":56, "dialogueline":"I recommend you travel to District of Columbia.", "eventid":"23", "dialoguetype": 0, "children": [55], "keywords": ["Ralph Asher Alpher","Ralph Asher Alpher","District of Columbia"], "condition":[], "option":"Somebody told me to find Ralph Asher Alpher. Any idea where they might have gone?", "isroot": false}, 
{"id":41, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [42], "keywords": ["Emory Leon Chaffee","Emory Leon Chaffee","Somerville, Massachusetts"], "condition":[], "option":"", "isroot": true}, 
{"id":42, "dialogueline":"If you really need it...", "eventid":"-1", "dialoguetype": 100, "children": [43], "keywords": ["Emory Leon Chaffee","Emory Leon Chaffee","Somerville, Massachusetts"], "condition":[], "option":"Hi, I'm a detective. Thank you for your time, I ask that you answer some questions.", "isroot": false}, 
{"id":43, "dialogueline":"Somebody told me they were in Somerville, Massachusetts.", "eventid":"17", "dialoguetype": 0, "children": [42], "keywords": ["Emory Leon Chaffee","Emory Leon Chaffee","Somerville, Massachusetts"], "condition":[], "option":"I am searching for Emory Leon Chaffee. Do you know of them?", "isroot": false}, 
{"id":37, "dialogueline":"Hello? How may I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [38], "keywords": ["Emory Leon Chaffee","William Hale Thompson","Planetarium","the United States"], "condition":[], "option":"", "isroot": true}, 
{"id":38, "dialogueline":"I'm not sure I'll be very helpful...", "eventid":"-1", "dialoguetype": 0, "children": [39], "keywords": ["Emory Leon Chaffee","William Hale Thompson","Planetarium","the United States"], "condition":[], "option":"Hello, I'm investigating the victim's case. Thank you for your time, I would appreciate it if you answer some questions.", "isroot": false}, 
{"id":39, "dialogueline":"I'm not certain. Maybe, the Planetarium could reveal something.", "eventid":"-1", "dialoguetype": 0, "children": [40], "keywords": ["Emory Leon Chaffee","William Hale Thompson","Planetarium","the United States"], "condition":[], "option":"A friend advised me to find Emory Leon Chaffee. Have you heard of them?", "isroot": false}, 
{"id":40, "dialogueline":"I recommend you travel to the United States.", "eventid":"16", "dialoguetype": 0, "children": [38], "keywords": ["Emory Leon Chaffee","William Hale Thompson","Planetarium","the United States"], "condition":[], "option":"Where would I go to find the Planetarium?", "isroot": false}, 
{"id":21, "dialogueline":"Hello? May I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [22], "keywords": ["Klaus Clusius","Prison","Manhattan"], "condition":[], "option":"", "isroot": true}, 
{"id":22, "dialogueline":"Okay.", "eventid":"-1", "dialoguetype": 100, "children": [23,25,86,88,90], "keywords": ["Klaus Clusius","Prison","Manhattan"], "condition":[], "option":"Hello, I'm working on the victim's case. Would I ask you some questions?", "isroot": false}, 
{"id":90, "dialogueline":"Ralph Asher Alpher died in texas", "eventid":"42", "dialoguetype": 616, "children": [22], "keywords": ["died","dead","texas","Ralph Asher Alpher"], "condition":[-1], "option":"Would you give me some information about one of the suspects?", "isroot": false}, 
{"id":88, "dialogueline":"Emory Leon Chaffee was born in somerville, massachusetts", "eventid":"40", "dialoguetype": 616, "children": [22], "keywords": ["born","birth","somerville, massachusetts","Emory Leon Chaffee"], "condition":[-1], "option":"I could use a lead. Do you know any information about one of the suspects?", "isroot": false}, 
{"id":86, "dialogueline":"Klaus Clusius' field was Chemical Physics", "eventid":"38", "dialoguetype": 616, "children": [22], "keywords": ["field","Chemical Physics","Klaus Clusius"], "condition":[-1], "option":"I need a lead. Do you know any information about one of the suspects?", "isroot": false}, 
{"id":25, "dialogueline":"Stop asking me this!", "eventid":"-1", "dialoguetype": 3, "children": [22], "keywords": [], "condition":[], "option":"What can you tell me about yourself?", "isroot": false}, 
{"id":23, "dialogueline":"I'm not sure. Maybe, the Prison could help.", "eventid":"-1", "dialoguetype": 0, "children": [24], "keywords": ["Klaus Clusius","Prison","Manhattan"], "condition":[], "option":"A friend advised me to look for Klaus Clusius. Do you know where they are?", "isroot": false}, 
{"id":24, "dialogueline":"It is located in in Manhattan. Try searching there.", "eventid":"10", "dialoguetype": 0, "children": [22], "keywords": ["Klaus Clusius","Prison","Manhattan"], "condition":[], "option":"Where might I meet the Prison?", "isroot": false}, 
{"id":8, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 100, "children": [9], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":9, "dialogueline":"Don't know. Leave me alone.", "eventid":"-1", "dialoguetype": 0, "children": [8], "keywords": [], "condition":[], "option":"I'm looking for Robert William Boyle?...", "isroot": false}, 
{"id":10, "dialogueline":"I don't have to speak to you", "eventid":"-1", "dialoguetype": 100, "children": [11,81,97,103,105], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":105, "dialogueline":"I am know for nationality. canadians", "eventid":"57", "dialoguetype": 626, "children": [10], "keywords": [], "condition":[56], "option":"Tell me about yourself.", "isroot": false}, 
{"id":103, "dialogueline":"I am know for birthplace. dominion of newfoundland", "eventid":"55", "dialoguetype": 626, "children": [10], "keywords": [], "condition":[54], "option":"Tell me about yourself.", "isroot": false}, 
{"id":97, "dialogueline":"I am know for deathplace. england", "eventid":"49", "dialoguetype": 626, "children": [10], "keywords": [], "condition":[48], "option":"Tell me about yourself.", "isroot": false}, 
{"id":81, "dialogueline":"I am know for field. physics", "eventid":"33", "dialoguetype": 626, "children": [10], "keywords": [], "condition":[32], "option":"Tell me about yourself.", "isroot": false}, 
{"id":11, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [10], "keywords": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":26, "dialogueline":"I'm innocent", "eventid":"-1", "dialoguetype": 100, "children": [27,79,87,93,113], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":113, "dialogueline":"I am know for birthplace. wrocław", "eventid":"65", "dialoguetype": 626, "children": [26], "keywords": [], "condition":[64], "option":"Tell me about yourself.", "isroot": false}, 
{"id":93, "dialogueline":"I am know for nationality. germany", "eventid":"45", "dialoguetype": 626, "children": [26], "keywords": [], "condition":[44], "option":"Tell me about yourself.", "isroot": false}, 
{"id":87, "dialogueline":"I am know for field. chemical physics", "eventid":"39", "dialoguetype": 626, "children": [26], "keywords": [], "condition":[38], "option":"Tell me about yourself.", "isroot": false}, 
{"id":79, "dialogueline":"I am know for deathplace. switzerland", "eventid":"31", "dialoguetype": 626, "children": [26], "keywords": [], "condition":[30], "option":"Tell me about yourself.", "isroot": false}, 
{"id":27, "dialogueline":"You have no proof.", "eventid":"-1", "dialoguetype": 0, "children": [26], "keywords": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":62, "dialogueline":"Hi. Can I help you?", "eventid":"-1", "dialoguetype": 0, "children": [63], "keywords": [], "condition":[], "option":"", "isroot": true}, 
{"id":63, "dialogueline":"Okay. Whatever I can do to help.", "eventid":"24", "dialoguetype": 100, "children": [64,112,114,116], "keywords": ["Max Perutz","Moritz Schlick","Max Perutz","Berlin","Nathan Rosen","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Hello, I'm a private-eye working on the victim's case. Can you answer some questions for me?", "isroot": false}, 
{"id":116, "dialogueline":"Ralph Asher Alpher's nationality is United States", "eventid":"68", "dialoguetype": 616, "children": [63], "keywords": ["nationality","United States","Ralph Asher Alpher"], "condition":[24], "option":"I need a lead. Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":114, "dialogueline":"Max Perutz's field was Crystallography", "eventid":"66", "dialoguetype": 616, "children": [63], "keywords": ["field","Crystallography","Max Perutz"], "condition":[24], "option":"Do you recall some information about one of the suspects?", "isroot": false}, 
{"id":112, "dialogueline":"Klaus Clusius was born in wrocław", "eventid":"64", "dialoguetype": 616, "children": [63], "keywords": ["born","birth","wrocław","Klaus Clusius"], "condition":[24], "option":"I need some cooperation. Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":64, "dialogueline":"I am Nathan Rosen. I was one influence.", "eventid":"25", "dialoguetype": 0, "children": [66], "keywords": ["Max Perutz","Moritz Schlick","Max Perutz","Berlin","Nathan Rosen","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Can you tell me who you are?", "isroot": false}, 
{"id":66, "dialogueline":"I heard Moritz Schlick travelled to Berlin. That's all I know.", "eventid":"26", "dialoguetype": 0, "children": [67], "keywords": ["Max Perutz","Moritz Schlick","Max Perutz","Berlin","Nathan Rosen","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Do you have something that might be useful to the investigation?", "isroot": false}, 
{"id":67, "dialogueline":"It is tough to say. However, I believe Max Perutz might be guilty.", "eventid":"27", "dialoguetype": 0, "children": [63], "keywords": ["Max Perutz","Moritz Schlick","Max Perutz","Berlin","Nathan Rosen","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"I need your help. Can you think of anyone who has a motive?", "isroot": false}, 
{"id":48, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [49], "keywords": [], "condition":[], "option":"", "isroot": true}, 
{"id":49, "dialogueline":"Okay. Ask away.", "eventid":"18", "dialoguetype": 100, "children": [50,96,98,100], "keywords": ["Ralph Asher Alpher","Ralph Asher Alpher","Princeton, New Jersey","Edward Teller","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Greetings, I'm a private-eye working on the victim's case. Thank you for your time, can I ask you some questions?", "isroot": false}, 
{"id":100, "dialogueline":"Emory Leon Chaffee's field was Physics", "eventid":"52", "dialoguetype": 616, "children": [49], "keywords": ["field","Physics","Emory Leon Chaffee"], "condition":[18], "option":"Would you give me some information about one of the suspects?", "isroot": false}, 
{"id":98, "dialogueline":"Max Perutz was born in austria-hungary", "eventid":"50", "dialoguetype": 616, "children": [49], "keywords": ["born","birth","austria-hungary","Max Perutz"], "condition":[18], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":96, "dialogueline":"Robert William Boyle died in england", "eventid":"48", "dialoguetype": 616, "children": [49], "keywords": ["died","dead","england","Robert William Boyle"], "condition":[18], "option":"Do you remember any information about one of the suspects?", "isroot": false}, 
{"id":50, "dialogueline":"I am called Edward Teller.", "eventid":"19", "dialoguetype": 0, "children": [51], "keywords": ["Ralph Asher Alpher","Ralph Asher Alpher","Princeton, New Jersey","Edward Teller","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Please, what is your name?", "isroot": false}, 
{"id":51, "dialogueline":"I believe the victim talked about a thing known as Princeton, New Jersey.", "eventid":"20", "dialoguetype": 0, "children": [52], "keywords": ["Ralph Asher Alpher","Ralph Asher Alpher","Princeton, New Jersey","Edward Teller","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Do you have something specific that might be of use to the investigation?", "isroot": false}, 
{"id":52, "dialogueline":"Personally, I think Ralph Asher Alpher could be connected.", "eventid":"21", "dialoguetype": 0, "children": [49], "keywords": ["Ralph Asher Alpher","Ralph Asher Alpher","Princeton, New Jersey","Edward Teller","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Do you have any more information?", "isroot": false}, 
{"id":30, "dialogueline":"Greetings. How can I help you?", "eventid":"-1", "dialoguetype": 0, "children": [32], "keywords": [], "condition":[], "option":"", "isroot": true}, 
{"id":32, "dialogueline":"Anything to help.", "eventid":"12", "dialoguetype": 100, "children": [33,94], "keywords": ["Emory Leon Chaffee","Richard Talbert","Emory Leon Chaffee","Prison","Princeton, New Jersey","President of Israel","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Greetings, I'm following the victim's case. Would I ask you some questions?", "isroot": false}, 
{"id":94, "dialogueline":"Emory Leon Chaffee died in waltham, massachusetts", "eventid":"46", "dialoguetype": 616, "children": [32], "keywords": ["died","dead","waltham, massachusetts","Emory Leon Chaffee"], "condition":[12], "option":"Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":33, "dialogueline":"Yes, I'm President of Israel.", "eventid":"13", "dialoguetype": 0, "children": [34], "keywords": ["Emory Leon Chaffee","Richard Talbert","Emory Leon Chaffee","Prison","Princeton, New Jersey","President of Israel","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Please, would you tell me your name?", "isroot": false}, 
{"id":34, "dialogueline":"Last I thought, I thought the victim was in Princeton, New Jersey.", "eventid":"14", "dialoguetype": 0, "children": [35], "keywords": ["Emory Leon Chaffee","Richard Talbert","Emory Leon Chaffee","Prison","Princeton, New Jersey","President of Israel","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Is there anything specific about the victim that you recall?", "isroot": false}, 
{"id":35, "dialogueline":"I am suspicious of Emory Leon Chaffee. But, It is difficult to say.", "eventid":"15", "dialoguetype": 0, "children": [32], "keywords": ["Emory Leon Chaffee","Richard Talbert","Emory Leon Chaffee","Prison","Princeton, New Jersey","President of Israel","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Can you think of someone who has a motive?", "isroot": false}, 
{"id":15, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [16], "keywords": [], "condition":[], "option":"", "isroot": true}, 
{"id":16, "dialogueline":"Sure.", "eventid":"6", "dialoguetype": 100, "children": [17,92], "keywords": ["Klaus Clusius","Neil deGrasse Tyson","Klaus Clusius","Manhattan","Franklin D. Roosevelt","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Greetings, I'm investigating the victim's case. Could I ask you some questions?", "isroot": false}, 
{"id":92, "dialogueline":"Klaus Clusius' nationality is Germany", "eventid":"44", "dialoguetype": 616, "children": [16], "keywords": ["nationality","Germany","Klaus Clusius"], "condition":[6], "option":"I could use some assistance. Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":17, "dialogueline":"I'm Franklin D. Roosevelt.", "eventid":"7", "dialoguetype": 0, "children": [19], "keywords": ["Klaus Clusius","Neil deGrasse Tyson","Klaus Clusius","Manhattan","Franklin D. Roosevelt","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Tell me your name.", "isroot": false}, 
{"id":19, "dialogueline":"Neil deGrasse Tyson was travelling to Manhattan. Maybe that helps you.", "eventid":"8", "dialoguetype": 0, "children": [20], "keywords": ["Klaus Clusius","Neil deGrasse Tyson","Klaus Clusius","Manhattan","Franklin D. Roosevelt","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Is there something specific you think I should know about?", "isroot": false}, 
{"id":20, "dialogueline":"I'm not completely convinced. However, I think Klaus Clusius might be guilty.", "eventid":"9", "dialoguetype": 0, "children": [16], "keywords": ["Klaus Clusius","Neil deGrasse Tyson","Klaus Clusius","Manhattan","Franklin D. Roosevelt","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Do you have any more information?", "isroot": false}, 
{"id":2, "dialogueline":"Hello? Do you want something?", "eventid":"-1", "dialoguetype": 0, "children": [3], "keywords": [], "condition":[], "option":"", "isroot": true}, 
{"id":3, "dialogueline":"Yes. I'll do my best.", "eventid":"0", "dialoguetype": 100, "children": [4,80,82,84], "keywords": ["Robert William Boyle","Robert William Boyle","Switzerland","Hans Albert Einstein","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Hi, I'm a detective following the victim's case. Thank you for your time, I have some questions for you.", "isroot": false}, 
{"id":84, "dialogueline":"Emory Leon Chaffee's nationality is United States", "eventid":"36", "dialoguetype": 616, "children": [3], "keywords": ["nationality","United States","Emory Leon Chaffee"], "condition":[0], "option":"I need a lead. Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":82, "dialogueline":"No one knows what nationality Max Perutz has.", "eventid":"34", "dialoguetype": 616, "children": [3], "keywords": ["nationality","Max Perutz"], "condition":[0], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":80, "dialogueline":"Robert William Boyle's field was Physics", "eventid":"32", "dialoguetype": 616, "children": [3], "keywords": ["field","Physics","Robert William Boyle"], "condition":[0], "option":"I could use some cooperation. Do you have any information about one of the suspects?", "isroot": false}, 
{"id":4, "dialogueline":"I'm Hans Albert Einstein. We are family", "eventid":"1", "dialoguetype": 0, "children": [5], "keywords": ["Robert William Boyle","Robert William Boyle","Switzerland","Hans Albert Einstein","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"State your name.", "isroot": false}, 
{"id":5, "dialogueline":"The victim talked about a thing named Switzerland.", "eventid":"2", "dialoguetype": 0, "children": [6], "keywords": ["Robert William Boyle","Robert William Boyle","Switzerland","Hans Albert Einstein","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Is there something you remember that might be valuable to the investigation?", "isroot": false}, 
{"id":6, "dialogueline":"I am suspicious of Robert William Boyle. But, I'm uncertain.", "eventid":"3", "dialoguetype": 0, "children": [3], "keywords": ["Robert William Boyle","Robert William Boyle","Switzerland","Hans Albert Einstein","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Do you have any more information?", "isroot": false}],
"crime":{"suspects":[1,6,19,9,14],"culprit":19,"facts":[{"pid":1,"factoid":"Robert William Boyle was born in dominion of newfoundland","condition":54},{"pid":1,"factoid":"Robert William Boyle died in england","condition":48},{"pid":1,"factoid":"Robert William Boyle's field was Physics","condition":32},{"pid":1,"factoid":"Robert William Boyle's nationality is Canadians","condition":56},{"pid":6,"factoid":"Klaus Clusius was born in wrocław","condition":64},{"pid":6,"factoid":"Klaus Clusius died in switzerland","condition":30},{"pid":6,"factoid":"Klaus Clusius' field was Chemical Physics","condition":38},{"pid":6,"factoid":"Klaus Clusius' nationality is Germany","condition":44},{"pid":19,"factoid":"Max Perutz was born in austria-hungary","condition":50},{"pid":19,"factoid":"Max Perutz died in cambridge","condition":58},{"pid":19,"factoid":"Max Perutz's field was Crystallography","condition":66},{"pid":19,"factoid":"No one knows what nationality Max Perutz has.","condition":34},{"pid":9,"factoid":"Emory Leon Chaffee was born in somerville, massachusetts","condition":40},{"pid":9,"factoid":"Emory Leon Chaffee died in waltham, massachusetts","condition":46},{"pid":9,"factoid":"Emory Leon Chaffee's field was Physics","condition":52},{"pid":9,"factoid":"Emory Leon Chaffee's nationality is United States","condition":36},{"pid":14,"factoid":"Ralph Asher Alpher was born in washington, d.c.","condition":60},{"pid":14,"factoid":"Ralph Asher Alpher died in texas","condition":42},{"pid":14,"factoid":"Ralph Asher Alpher's field was Cosmology","condition":62},{"pid":14,"factoid":"Ralph Asher Alpher's nationality is United States","condition":68}]}}
