{
"people" : [
{"id":4, "name":"Minister of Munitions", "description":"The Minister of Munitions was a British government position created during the First World War to oversee and co-ordinate the production and distribution of munitions for the war effort.  The position was created in response to the Shell Crisis of 1915 when there was much public criticism of the shortage of shells available.", "drootid": 4, "condition":[], "buildingid":0, "image":"PERSON4.png"}, 
{"id":9, "name":"David Hume", "description":"David Hume  – 25 August 1776  was a Scottish philosopher, historian, economist, and essayist, who is best known today for his highly influential system of radical philosophical empiricism, skepticism, and naturalism.  Hume's empiricist approach to philosophy places him with John Locke, George Berkeley, Francis Bacon, and Thomas Hobbes as a British Empiricist.", "drootid": 24, "condition":[], "buildingid":0, "image":"PERSON9.png"}, 
{"id":13, "name":"Nathan Rosen", "description":"Nathan Rosen  was an American-Israeli physicist noted for his study on the structure of the hydrogen atom and his work with Albert Einstein and Boris Podolsky on entangled wave functions and the EPR paradox.  The Einstein–Rosen bridge, later named the wormhole, was a theory of Nathan Rosen.", "drootid": 40, "condition":[], "buildingid":0, "image":"PERSON13.png"}, 
{"id":18, "name":"Hermann Georg Fiedler", "description":"Hermann Georg Fiedler , was a German scholar, who became Taylor Professor of the German Language and Literature at the University of Oxford .  He was previously lecturer in German at Mason College .", "drootid": 54, "condition":[], "buildingid":0, "image":"PERSON18.png"}, 
{"id":23, "name":"Josiah Willard Gibbs", "description":"Josiah Willard Gibbs  was an American scientist who made important theoretical contributions to physics, chemistry, and mathematics.  His work on the applications of thermodynamics was instrumental in transforming physical chemistry into a rigorous deductive science.", "drootid": 71, "condition":[], "buildingid":0, "image":"PERSON23.png"}, 
{"id":1, "name":"John D. Barrow", "description":"John David Barrow FRS  is an English cosmologist, theoretical physicist, and mathematician.  He is currently Research Professor of Mathematical Sciences at the University of Cambridge.", "drootid": 12, "condition":[4], "buildingid":1, "image":"PERSON1.png"}, 
{"id":5, "name":"John D. Barrow", "description":"John David Barrow FRS  is an English cosmologist, theoretical physicist, and mathematician.  He is currently Research Professor of Mathematical Sciences at the University of Cambridge.", "drootid": 10, "condition":[4], "buildingid":1, "image":"PERSON5.png"}, 
{"id":2, "name":"Physicist", "description":"A physicist is a scientist who has specialized knowledge in the field of physics, the exploration of the interactions of matter and energy across the physical universe.  Physicists study a wide range of phenomena in many branches of their field, spanning all length scales: from sub-atomic particles of which all ordinary matter is made , to physical systems, to molecular length scales of chemical and biological interest, to cosmological length scales encompassing the Universe as a whole.", "drootid": 16, "condition":[5], "buildingid":2, "image":"PERSON2.png"}, 
{"id":3, "name":"Wilhelm Hallwachs", "description":"Wilhelm Ludwig Franz Hallwachs  was a German physicist.", "drootid": 19, "condition":[6], "buildingid":3, "image":"PERSON3.png"}, 
{"id":24, "name":"Wolfgang Reinhold", "description":"Wolfgang Reinhold  was a German Colonel General.  He was a Deputy Minister of Defence and, between 1972 and 1989, head of the Kommando LSK/LV  of the National People's Army in the German Democratic Republic .", "drootid": 82, "condition":[33], "buildingid":3, "image":"PERSON24.png"}, 
{"id":7, "name":"James Allen", "description":"James Allen  was a British philosophical writer known for his inspirational books and poetry and as a pioneer of the self-help movement.  His best known work, As a Man Thinketh, has been mass-produced since its publication in 1903.", "drootid": 29, "condition":[11], "buildingid":5, "image":"PERSON7.png"}, 
{"id":8, "name":"Edward Albert Sharpey-Schafer", "description":"Sir Edward Albert Sharpey-Schafer FRS FRSE  was an English physiologist.  He is regarded as a founder of endocrinology: in 1894 he discovered and demonstrated the existence of adrenaline together with George Oliver, and he also coined the term \"endocrine\" for the secretions of the ductless glands.", "drootid": 36, "condition":[13], "buildingid":6, "image":"PERSON8.png"}, 
{"id":10, "name":"Peter Cathcart Wason", "description":"Peter Cathcart Wason  was a cognitive psychologist at University College, London who pioneered the Psychology of Reasoning.  He progressed explanations as to why people make certain consistent mistakes in logical reasoning.", "drootid": 34, "condition":[13], "buildingid":6, "image":"PERSON10.png"}, 
{"id":14, "name":"William Hale Thompson", "description":"William Hale Thompson  was an American politician, mayor of Chicago from 1915 to 1923 and again from 1927 to 1931.  Known as \"Big Bill\", Thompson was the last Republican to serve as Mayor of Chicago .", "drootid": 46, "condition":[19], "buildingid":11, "image":"PERSON14.png"}, 
{"id":12, "name":"Theodore Postol", "description":"Theodore A.  Postol  is a professor of Science, Technology, and International Security at the Massachusetts Institute of Technology and is a prominent critic of U.", "drootid": 49, "condition":[20], "buildingid":9, "image":"PERSON12.png"}, 
{"id":16, "name":"Paul Wild", "description":"Paul Wild  was a Swiss astronomer and director of the Astronomical Institute of the University of Bern, who discovered numerous comets, asteroids and supernovae.", "drootid": 59, "condition":[25], "buildingid":12, "image":"PERSON16.png"}, 
{"id":17, "name":"John Linsley", "description":"John David Linsley  was an American physicist who performed pioneering research on cosmic rays, particularly ultra-high-energy cosmic rays.  He did his most significant work from 1959 to 1978 using a ground-based array of detectors at Volcano Ranch in New Mexico.", "drootid": 66, "condition":[27], "buildingid":13, "image":"PERSON17.png"}, 
{"id":19, "name":"Ernest Gellner", "description":"Ernest André Gellner  was a British-Czech philosopher and social anthropologist described by The Daily Telegraph, when he died, as one of the world's most vigorous intellectuals, and by The Independent as a \"one-man crusader for critical rationalism\".  His first book, Words and Things , prompted a leader in The Times and a month-long correspondence on its letters page over his attack on linguistic philosophy.", "drootid": 64, "condition":[27], "buildingid":13, "image":"PERSON19.png"}, 
{"id":21, "name":"Mileva Mari?", "description":"Mileva Mari?  was a Serbian physicist.  She was the only woman among Albert Einstein's fellow students at the Zurich Polytechnic and was the second woman to finish a full program of study at the Department: Mathematics and Physics.", "drootid": 77, "condition":[30], "buildingid":16, "image":"PERSON21.png"}, 
{"id":22, "name":"Eduard Heine", "description":"Heinrich Eduard Heine  was a German mathematician.  Heine became known for results on special functions and in real analysis.", "drootid": 85, "condition":[34], "buildingid":17, "image":"PERSON22.png"}],
"items":[{"id":8, "name":"Key", "description":"Keys for a locked door", "condition": [], "eventid": -1, "buildingid":0, "itemtype":"key", "image":"null"}, 
{"id":0, "name":"Gold Medal of the Royal Astronomical Society", "description":"It is a photograph about Gold Medal of the Royal Astronomical Society. In a corner, it says:The Gold Medal of the Royal Astronomical Society  is the highest award given by the RAS.  The RAS Council have \"complete freedom as to the grounds on which it is awarded\" and as such it can be awarded for any reason.  There are things written behind: Philip England John D. Barrow   And the following places: London and ???? ????? ???", "condition": [2], "eventid": 4, "buildingid":4, "itemtype":"photograph", "image":"PHOTO00.png"}, 
{"id":1, "name":"Philosophy", "description":"It is a book about Philosophy. It says: Philosophy  is the study of general and fundamental problems concerning matters such as existence, knowledge, values, reason, mind, and language.  The term was probably coined by Pythagoras .  The following people are mentioned:  James Allen (author)   And the following place: Leicester", "condition": [9], "eventid": 11, "buildingid":7, "itemtype":"book", "image":"null"}, 
{"id":2, "name":"England", "description":"It is a photograph about England. In a corner, it says:England is a country that is part of the United Kingdom.  It shares land borders with Scotland to the north and Wales to the west.  There are things written behind: Edward Albert Sharpey-Schafer Peter Cathcart Wason Nehemiah Grew   And the following places: Switzerland and Hornsey", "condition": [12], "eventid": 13, "buildingid":8, "itemtype":"photograph", "image":"PHOTO02.png"}, 
{"id":3, "name":"Kappa Delta Pi", "description":"It is a photograph about Kappa Delta Pi. In a corner, it says:Kappa Delta Pi, International Honor Society in Education, was founded in 1911 and was one of the first discipline-specific honor societies.  Its membership is limited to the top 20 percent of those entering the field of education.  There are things written behind: Experience and Education (book)  And the following place: the United States", "condition": [16], "eventid": 18, "buildingid":10, "itemtype":"photograph", "image":"PHOTO03.png"}, 
{"id":6, "name":"1925 births", "description":"It is a book about 1925 births. It says: 1925 births.  The following people are mentioned:  John Linsley Ernest Gellner   And the following place: Minneapolis, Minnesota", "condition": [26], "eventid": 27, "buildingid":15, "itemtype":"book", "image":"null"}, 
{"id":5, "name":"2001 Einstein", "description":"It is a photograph about 2001 Einstein. In a corner, it says:2001 Einstein, provisional designation 1973 EB, is a bright Hungaria asteroid from the innermost region of the asteroid belt, approximately 5 kilometers in diameter.  It was discovered by Swiss astronomer Paul Wild at Zimmerwald Observatory near Bern, Switzerland, on 5 March 1973.  There are things written behind: Paul Wild (Swiss astronomer)   And the following place: Wädenswil", "condition": [23], "eventid": 25, "buildingid":14, "itemtype":"photograph", "image":"PHOTO05.png"}, 
{"id":4, "name":"Experience and Education", "description":"It is a photograph about Experience and Education. In a corner, it says:Experience and Education is a short book written in 1938 by John Dewey, a pre-eminent educational theorist of the 20th century.  It provides a concise and powerful analysis of education.  There are names written behind: United States United_States Center for Dewey Studies Traditional education", "condition": [18], "eventid": 19, "buildingid":11, "itemtype":"photograph", "image":"null"}, 
{"id":7, "name":"Serbs", "description":"It is a book about Serbs. It says:  The Serbs  are a South Slavic ethnic group that formed in the Balkans.  The majority of Serbs inhabit the nation state of Serbia , as well as Bosnia and Herzegovina and Montenegro.  The following people are mentioned:  Germany Macedonia", "condition": [32], "eventid": 33, "buildingid":18, "itemtype":"book", "image":"null"}],
"buildings":[{"id":0, "name":"House of Albert Einstein", "description":" and Swiss Confederation  Switzerland , officially the Swiss Confederation is a federal republic in Europe", "locktype": "null", "coordx": 170, "coordy": 226, "condition":[], "cityid":0, "peopleid":[4,9,13,18,23], "itemsid":[8], "image":"BUILDING0.png"}, 
{"id":4, "name":"Bar", "description":" While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\"  The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east", "locktype": "null", "coordx": 160, "coordy": 63, "condition":[2], "cityid":0, "peopleid":[], "itemsid":[0], "image":"BUILDING4.png"}, 
{"id":1, "name":"House of John D. Barrow", "description":"London /?l?nd?n/ is the capital and most populous city of England and the United Kingdom Standing on the River Thames in the south east of the island of Great Britain, London has been a major settlement for two millennia", "locktype": "null", "coordx": 90, "coordy": 91, "condition":[4,4], "cityid":1, "peopleid":[1,5], "itemsid":[], "image":"BUILDING1.png"}, 
{"id":7, "name":"Police Station", "description":" It was founded by the Romans, who named it Londinium London's ancient core, the City of London, largely retains its 1", "locktype": "null", "coordx": 183, "coordy": 139, "condition":[9], "cityid":1, "peopleid":[], "itemsid":[1], "image":"BUILDING7.png"}, 
{"id":8, "name":"Planetarium", "description":"12-square-mile  medieval boundaries Since at least the 19th century, \"London\" has also referred to the metropolis around this core, historically split between Middlesex, Essex, Surrey, Kent, and Hertfordshire, which today largely makes up Greater London, governed by the Mayor of London and the London Assembly", "locktype": "null", "coordx": 316, "coordy": 191, "condition":[12], "cityid":1, "peopleid":[], "itemsid":[2], "image":"BUILDING8.png"}, 
{"id":10, "name":"Temple", "description":" As a Nylonkong metropolis, London is a leading global city, in the arts, commerce, education, entertainment, fashion, finance, healthcare, media, professional services, research and development, tourism, and transport It is one of the world's leading financial centres and has the fifth- or sixth-largest metropolitan area GDP in the world", "locktype": "null", "coordx": 109, "coordy": 276, "condition":[16], "cityid":1, "peopleid":[], "itemsid":[3], "image":"BUILDING10.png"}, 
{"id":15, "name":"Cottage", "description":" London is a world cultural capital It is the world's most-visited city as measured by international arrivals and has the world's largest city airport system measured by passenger traffic", "locktype": "null", "coordx": 219, "coordy": 181, "condition":[26], "cityid":1, "peopleid":[], "itemsid":[6], "image":"BUILDING15.png"}, 
{"id":2, "name":"House of Physicist", "description":"The Ulugh Beg Observatory is an observatory in Samarkand, Uzbekistan Built in the 1420s by the Timurid astronomer Ulugh Beg, it is considered by scholars to have been one of the finest observatories in the Islamic world", "locktype": "null", "coordx": 143, "coordy": 275, "condition":[5], "cityid":2, "peopleid":[2], "itemsid":[], "image":"BUILDING2.png"}, 
{"id":3, "name":"House of Wilhelm Hallwachs", "description":"Germany , officially the Federal Republic of Germany , is a federal parliamentary republic in central-western Europe It includes 16 constituent states, covers an area of 357,021 square kilometres , and has a largely temperate seasonal climate", "locktype": "null", "coordx": 279, "coordy": 183, "condition":[6,33], "cityid":3, "peopleid":[3,24], "itemsid":[], "image":"BUILDING3.png"}, 
{"id":5, "name":"House of James Allen", "description":"Leicester  is a city and unitary authority area in the East Midlands of England, and the county town of Leicestershire The city lies on the River Soar and at the edge of the National Forest", "locktype": "null", "coordx": 304, "coordy": 71, "condition":[11], "cityid":4, "peopleid":[7], "itemsid":[], "image":"BUILDING5.png"}, 
{"id":6, "name":"House of Edward Albert Sharpey-Schafer", "description":"Hornsey /h??rnzi?/ is a district of north London, England in the London Borough of Haringey Hornsey has been a much larger ancient parish than the electoral ward of the same name, in turn a smaller entity than the Municipal Borough of Hornsey which co-governed its area with Middlesex County Council from 1889 to 1965, since which time, the name usually refers only to the London neighbourhood at the heart of these former areas to the west of Hornsey railway station", "locktype": "null", "coordx": 106, "coordy": 117, "condition":[13,13], "cityid":5, "peopleid":[8,10], "itemsid":[], "image":"BUILDING6.png"}, 
{"id":14, "name":"Planetarium", "description":" It is an inner-suburban, for the most part residential, area centred 62 miles  north of Charing Cross", "locktype": "null", "coordx": 65, "coordy": 294, "condition":[23], "cityid":5, "peopleid":[], "itemsid":[5], "image":"BUILDING14.png"}, 
{"id":11, "name":"Villa", "description":", US , USA , and United States  The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions", "locktype": "null", "coordx": 118, "coordy": 175, "condition":[19,18], "cityid":6, "peopleid":[14], "itemsid":[4], "image":"BUILDING11.png"}, 
{"id":9, "name":"House of Theodore Postol", "description":"Brooklyn  is the most populous of New York City's five boroughs, with a Census-estimated 2,636,735 residents in 2015 It is geographically adjacent to the borough of Queens at the southwestern end of Long Island", "locktype": "null", "coordx": 297, "coordy": 56, "condition":[20], "cityid":7, "peopleid":[12], "itemsid":[], "image":"BUILDING9.png"}, 
{"id":18, "name":"Stadium", "description":" Since 1896, Brooklyn has had the same boundaries as Kings County, the most populous county in the US", "locktype": "null", "coordx": 224, "coordy": 295, "condition":[32], "cityid":7, "peopleid":[], "itemsid":[7], "image":"BUILDING18.png"}, 
{"id":12, "name":"House of Paul Wild", "description":"Wädenswil, locally often called Wädi or Wädischwil, is a municipality in the district of Horgen in the canton of Zürich in Switzerland The population  was about 21,000", "locktype": "null", "coordx": 94, "coordy": 282, "condition":[25], "cityid":8, "peopleid":[16], "itemsid":[], "image":"BUILDING12.png"}, 
{"id":13, "name":"House of John Linsley", "description":"Minneapolis  is the county seat of Hennepin County, and larger of the Twin Cities, the 16th-largest metropolitan area in the United States, containing about 35 million residents", "locktype": "null", "coordx": 270, "coordy": 164, "condition":[27,27], "cityid":9, "peopleid":[17,19], "itemsid":[], "image":"BUILDING13.png"}, 
{"id":16, "name":"House of Mileva Mari?", "description":"Titel  is a town and municipality in the South Ba?ka District of the Vojvodina, Serbia The town of Titel has a population of 5,247, while the population of the municipality of Titel is 15,738", "locktype": "null", "coordx": 84, "coordy": 181, "condition":[30], "cityid":10, "peopleid":[21], "itemsid":[], "image":"BUILDING16.png"}, 
{"id":17, "name":"House of Eduard Heine", "description":"Berlin  is the capital and the largest city of Germany as well as one of its 16 states With a population of approximately 3", "locktype": "null", "coordx": 156, "coordy": 118, "condition":[34], "cityid":11, "peopleid":[22], "itemsid":[], "image":"BUILDING17.png"}],
"cities":[{"id":0, "name":"Switzerland", "description":" and Swiss Confederation . Switzerland , officially the Swiss Confederation is a federal republic in Europe. While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\" . The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2 . While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zürich and Geneva. The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. The country has a history of armed neutrality going back to the Reformation, it has not been in a state of war internationally since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. In addition to being the birthplace of the Red Cross, Switzerland is home to numerous international organisations, including the second largest UN office. On the European level, it is a founding member of the European Free Trade Association, but notably it is not part of the European Union, nor the European Economic Area. However, the country does participate in the Schengen Area and the EU's single market through a number of bilateral treaties. Spanning the intersection of Germanic and Romance Europe, Switzerland comprises four main linguistic and cultural regions: German, French, Italian and Romansh. Although the majority of the population are German speaking, Swiss national identity is rooted in a common historical background, shared values such as federalism and direct democracy, and Alpine symbolism. Due to its linguistic diversity, Switzerland is known by a variety of native names: Schweiz [??va?ts] ; Suisse [s?is] ; Svizzera [?zvittsera] ; and Svizra [??vi?tsr?] or [??vi?ts???] . On coins and stamps, Latin  is used instead of the four living languages. Switzerland is one of the most developed countries in the world, with the highest nominal wealth per adult and the eighth-highest per capita gross domestic product according to the IMF. Switzerland ranks at or near the top globally in several metrics of national performance, including government transparency, civil liberties, quality of life, economic competitiveness, and human development. Zürich and Geneva have each been ranked among the top cities in the world in terms of quality of life, with the former ranked second globally, according to Mercer.", "coordx": 210, "coordy": 124, "condition":[], "buildingid":[0,4], "image":"CITY0.png"}, 
{"id":1, "name":"London", "description":"London /?l?nd?n/ is the capital and most populous city of England and the United Kingdom. Standing on the River Thames in the south east of the island of Great Britain, London has been a major settlement for two millennia. It was founded by the Romans, who named it Londinium. London's ancient core, the City of London, largely retains its 1.12-square-mile  medieval boundaries. Since at least the 19th century, \"London\" has also referred to the metropolis around this core, historically split between Middlesex, Essex, Surrey, Kent, and Hertfordshire, which today largely makes up Greater London, governed by the Mayor of London and the London Assembly. As a Nylonkong metropolis, London is a leading global city, in the arts, commerce, education, entertainment, fashion, finance, healthcare, media, professional services, research and development, tourism, and transport. It is one of the world's leading financial centres and has the fifth- or sixth-largest metropolitan area GDP in the world. London is a world cultural capital. It is the world's most-visited city as measured by international arrivals and has the world's largest city airport system measured by passenger traffic. London is the world's leading investment destination, hosting more international retailers and ultra high-net-worth individuals than any other city. London's universities form the largest concentration of higher education institutes in Europe, and a 2014 report placed it first in the world university rankings. According to the report London also ranks first in the world in software, multimedia development and design, and shares first position in technology readiness. In 2012, London became the only city to host the modern Summer Olympic Games three times. London has a diverse range of people and cultures, and more than 300 languages are spoken in the region. Its estimated mid-2015 municipal population  was 8,673,713, the largest of any city in the European Union, and accounting for 12.5 per cent of the UK population. London's urban area is the second most populous in the EU, after Paris, with 9,787,426 inhabitants at the 2011 census. The city's metropolitan area is one of the most populous in Europe with 13,879,757 inhabitants, while the Greater London Authority states the population of the city-region  as 22.7 million.London was the world's most populous city from around 1831 to 1925. London contains four World Heritage Sites: the Tower of London; Kew Gardens; the site comprising the Palace of Westminster, Westminster Abbey, and St Margaret's Church; and the historic settlement of Greenwich . Other famous landmarks include Buckingham Palace, the London Eye, Piccadilly Circus, St Paul's Cathedral, Tower Bridge, Trafalgar Square, and The Shard. London is home to numerous museums, galleries, libraries, sporting events and other cultural institutions, including the British Museum, National Gallery, Natural History Museum, Tate Modern, British Library and West End theatres. The London Underground is the oldest underground railway network in the world.", "coordx": 199, "coordy": 114, "condition":[4,4,9,12,16,26], "buildingid":[1,7,8,10,15], "image":"CITY1.png"}, 
{"id":2, "name":"???? ????? ???", "description":"The Ulugh Beg Observatory is an observatory in Samarkand, Uzbekistan. Built in the 1420s by the Timurid astronomer Ulugh Beg, it is considered by scholars to have been one of the finest observatories in the Islamic world. Some of the famous Islamic astronomers who worked at the observatory include Al-Kashi, Ali Qushji, and Ulugh Beg himself. The observatory was destroyed in 1449 and rediscovered in 1908.", "coordx": 295, "coordy": 138, "condition":[5], "buildingid":[2], "image":"CITY2.png"}, 
{"id":3, "name":"Germany", "description":"Germany , officially the Federal Republic of Germany , is a federal parliamentary republic in central-western Europe. It includes 16 constituent states, covers an area of 357,021 square kilometres , and has a largely temperate seasonal climate. With about 82 million inhabitants, Germany is the most populous member state of the European Union. After the United States, it is the second most popular immigration destination in the world. Germany's capital and largest metropolis is Berlin. Major urban areas include Ruhr, Hamburg, Munich, Cologne, Frankfurt and Stuttgart. Various Germanic tribes have occupied the northern parts of modern Germany since classical antiquity. A region named Germania was documented before 100 AD. During the Migration Period the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. In 1871, Germany became a nation state when most of the German states unified into the Prussian-dominated German Empire. After World War I and the German Revolution of 1918–1919, the Empire was replaced by the parliamentary Weimar Republic. The establishment of the national socialist dictatorship in 1933 led to World War II and a genocide. After a period of Allied occupation, two German states were founded: the Federal Republic of Germany and the German Democratic Republic. In 1990, the country was reunified. In the 21st century, Germany is a great power and has the world's fourth-largest economy by nominal GDP, as well as the fifth-largest by PPP. As a global leader in several industrial and technological sectors, it is both the world's third-largest exporter and importer of goods. Germany is a developed country with a very high standard of living sustained by a skilled and productive society. It upholds a social security and universal health care system, environmental protection and a tuition-free university education. Germany was a founding member of the European Union in 1993. It is part of the Schengen Area, and became a co-founder of the Eurozone in 1999. Germany is a member of the United Nations, NATO, the G8, the G20, and the OECD. The national military expenditure is the 9th highest in the world. Known for its rich cultural history, Germany has been continuously the home of influential artists, philosophers, musicians, sportspeople and entrepreneurs. It is a global leader in science and technology.", "coordx": 219, "coordy": 111, "condition":[6,33], "buildingid":[3], "image":"CITY3.png"}, 
{"id":4, "name":"Leicester", "description":"Leicester  is a city and unitary authority area in the East Midlands of England, and the county town of Leicestershire. The city lies on the River Soar and at the edge of the National Forest. In the 2011 census the population of the City of Leicester unitary authority was approximately 330,000 making it the most populous municipality in the East Midlands region. The associated urban area is also the 11th most populous in England and the 13th most populous the United Kingdom. Leicester is at the intersection of the north/south Midland Main Line and east/west Birmingham/Leicester/Cambridge CrossCountry railway lines and the confluence of the M1/M69 motorways and the A6/A46 trunk routes.", "coordx": 198, "coordy": 111, "condition":[11], "buildingid":[5], "image":"CITY4.png"}, 
{"id":5, "name":"Hornsey", "description":"Hornsey /h??rnzi?/ is a district of north London, England in the London Borough of Haringey. Hornsey has been a much larger ancient parish than the electoral ward of the same name, in turn a smaller entity than the Municipal Borough of Hornsey which co-governed its area with Middlesex County Council from 1889 to 1965, since which time, the name usually refers only to the London neighbourhood at the heart of these former areas to the west of Hornsey railway station. It is an inner-suburban, for the most part residential, area centred 6.2 miles  north of Charing Cross.", "coordx": 199, "coordy": 114, "condition":[13,13,23], "buildingid":[6,14], "image":"CITY5.png"}, 
{"id":6, "name":"the United States", "description":", US , USA , and United States . The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.The 48 contiguous states and federal district are in central North America between Canada and Mexico, with the state of Alaska in the northwestern part of North America and the state of Hawaii comprising an archipelago in the mid-Pacific. The territories are scattered about the Pacific Ocean and the Caribbean Sea. At 3.8 million square miles  and with over 324 million people, the United States is the world's third-largest country by total area  and the third-most populous. It is one of the world's most ethnically diverse and multicultural nations, the product of large-scale immigration from many other countries. The country's capital is Washington, D.C. and its largest city is New York City; other major metropolitan areas include Los Angeles, Chicago, Dallas, San Francisco, Boston, Philadelphia, Houston, Atlanta, and Miami. The geography, climate and wildlife of the country are extremely diverse. Paleo-Indians migrated from Asia to the North American mainland at least 15,000 years ago, with European colonization beginning in the 16th century. The United States emerged from 13 British colonies along the East Coast. Numerous disputes between Great Britain and the colonies in the aftermath of the Seven Years War led to the American Revolution, which began in 1775. On July 4, 1776, as the colonies were fighting Great Britain in the American Revolutionary War, delegates from the 13 colonies unanimously adopted the Declaration of Independence. The war ended in 1783 with recognition of the independence of the United States by Great Britain, and was the first successful war of independence against a European colonial empire. The current constitution was adopted in 1788, after the Articles of Confederation, adopted in 1781, were felt to have provided inadequate federal powers. The first ten amendments, collectively named the Bill of Rights, were ratified in 1791 and designed to guarantee many fundamental civil liberties. The United States embarked on a vigorous expansion across North America throughout the 19th century, displacing American Indian tribes, acquiring new territories, and gradually admitting new states until it spanned the continent by 1848. During the second half of the 19th century, the American Civil War led to the end of legal slavery in the country. By the end of that century, the United States extended into the Pacific Ocean, and its economy, driven in large part by the Industrial Revolution, began to soar. The Spanish–American War and World War I confirmed the country's status as a global military power. The United States emerged from World War II as a global superpower, the first country to develop nuclear weapons, the only country to use them in warfare, and a permanent member of the United Nations Security Council. The end of the Cold War and the dissolution of the Soviet Union in 1991 left the United States as the world's sole superpower. The United States is a highly developed country, with the world's largest economy by nominal GDP. It ranks highly in several measures of socioeconomic performance, including average wage, human development, per capita GDP, and productivity per person. While the U.S. economy is considered post-industrial, characterized by the dominance of services, the manufacturing sector remains the second-largest in the world. Though its population is only 4.4% of the world total, the United States accounts for nearly a quarter of world GDP and almost a third of global military spending, making it the world's foremost military and economic power. The United States is a prominent political and cultural force internationally, and a leader in scientific research and technological innovations.", "coordx": 90, "coordy": 139, "condition":[19,18], "buildingid":[11], "image":"CITY6.png"}, 
{"id":7, "name":"Brooklyn", "description":"Brooklyn  is the most populous of New York City's five boroughs, with a Census-estimated 2,636,735 residents in 2015. It is geographically adjacent to the borough of Queens at the southwestern end of Long Island. Since 1896, Brooklyn has had the same boundaries as Kings County, the most populous county in the U.S. state of New York, and the second-most densely populated county in the United States, after the county of New York . With a land area of 71 square miles  and water area of 26 square miles , Kings County is New York's fourth-smallest county by land area and third-smallest by total area, though it is the second-largest among the city's five boroughs. Today, if each of the five boroughs were a separate city, Brooklyn would rank as the third-most populous city in the U.S., behind Los Angeles and Chicago. Brooklyn was an independent incorporated city  until January 1, 1898 when, after a long political campaign and public relations battle during the 1890s, according to the new Municipal Charter of \"Greater New York\", Brooklyn was consolidated with the other cities, boroughs, and counties to form the modern \"City of New York\" surrounding the Upper New York Bay with five constituent boroughs. The borough continues, however, to maintain a distinct culture. Many Brooklyn neighborhoods are ethnic enclaves. Brooklyn's official motto, displayed on the Borough seal and flag, is Eendraght Maeckt Maght which translates from early modern Dutch as \"Unity makes strength\". In the first decades of the 21st century Brooklyn has experienced a renaissance as an avant garde destination for hipsters, with concomitant gentrification, dramatic house price increases, and a decrease in housing affordability. Since 2010 it has evolved into a thriving hub of entrepreneurship and high technology startup firms, and of postmodern art and design.", "coordx": 94, "coordy": 136, "condition":[20,32], "buildingid":[9,18], "image":"CITY7.png"}, 
{"id":8, "name":"Wädenswil", "description":"Wädenswil, locally often called Wädi or Wädischwil, is a municipality in the district of Horgen in the canton of Zürich in Switzerland. The population  was about 21,000.", "coordx": 212, "coordy": 123, "condition":[25], "buildingid":[12], "image":"CITY8.png"}, 
{"id":9, "name":"Minneapolis, Minnesota", "description":"Minneapolis  is the county seat of Hennepin County, and larger of the Twin Cities, the 16th-largest metropolitan area in the United States, containing about 3.5 million residents. As of 2015, Minneapolis is the largest city in the state of Minnesota and 46th-largest in the United States with a population of 410,939. Minneapolis and Saint Paul anchor the second-largest economic center in the Midwest, after Chicago. Minneapolis lies on both banks of the Mississippi River, just north of the river's confluence with the Minnesota River, and adjoins Saint Paul, the state's capital. The city is abundantly rich in water, with thirteen lakes, wetlands, the Mississippi River, creeks and waterfalls, many connected by parkways in the Chain of Lakes and the Grand Rounds National Scenic Byway. It was once the world's flour milling capital and a hub for timber. The city and surrounding region is the primary business center between Chicago and Seattle, with Minneapolis proper containing America's fifth-highest concentration of Fortune 500 companies. As an integral link to the global economy, Minneapolis is categorized as a global city. Noted for its strong music and performing arts scenes, Minneapolis is home to both the award-winning Guthrie Theater and the historic First Avenue nightclub. Reflecting the region's status as an epicenter of folk, funk, and alternative rock music, the city served as the launching pad for several of the 20th century's most influential musicians, including Bob Dylan and Prince. The name Minneapolis is attributed to Charles Hoag, the city's first schoolteacher, who combined mni, a Dakota Sioux word for water, and polis, the Greek word for city.", "coordx": 67, "coordy": 128, "condition":[27,27], "buildingid":[13], "image":"CITY9.png"}, 
{"id":10, "name":"Titel", "description":"Titel  is a town and municipality in the South Ba?ka District of the Vojvodina, Serbia. The town of Titel has a population of 5,247, while the population of the municipality of Titel is 15,738. It is located in southeastern part of Ba?ka, known as Šajkaška.", "coordx": 228, "coordy": 127, "condition":[30], "buildingid":[16], "image":"CITY10.png"}, 
{"id":11, "name":"Berlin", "description":"Berlin  is the capital and the largest city of Germany as well as one of its 16 states. With a population of approximately 3.6 million people, Berlin is the second most populous city proper and the seventh most populous urban area in the European Union. Located in northeastern Germany on the banks of Rivers Spree and Havel, it is the centre of the Berlin-Brandenburg Metropolitan Region, which has about 6 million residents from more than 180 nations. Due to its location in the European Plain, Berlin is influenced by a temperate seasonal climate. Around one-third of the city's area is composed of forests, parks, gardens, rivers and lakes. First documented in the 13th century and situated at the crossing of two important historic trade routes, Berlin became the capital of the Margraviate of Brandenburg , the Kingdom of Prussia , the German Empire , the Weimar Republic  and the Third Reich . Berlin in the 1920s was the third largest municipality in the world. After World War II, the city was divided; East Berlin became the capital of East Germany while West Berlin became a de facto West German exclave, surrounded by the Berlin Wall  and East Germany territory. Following German reunification in 1990, Berlin was once again designated as the capital of united Germany. Berlin is a world city of culture, politics, media and science. Its economy is based on high-tech firms and the service sector, encompassing a diverse range of creative industries, research facilities, media corporations and convention venues. Berlin serves as a continental hub for air and rail traffic and has a highly complex public transportation network. The metropolis is a popular tourist destination. Significant industries also include IT, pharmaceuticals, biomedical engineering, clean tech, biotechnology, construction and electronics. Modern Berlin is home to world renowned universities, orchestras, museums, entertainment venues and is host to many sporting events. Its urban setting has made it a sought-after location for international film productions. The city is well known for its festivals, diverse architecture, nightlife, contemporary arts and a high quality of living. Over the last decade Berlin has seen the emergence of a cosmopolitan entrepreneurial scene.", "coordx": 219, "coordy": 111, "condition":[34], "buildingid":[17], "image":"CITY11.png"}],
"dialoguenodes":[{"id":85, "dialogueline":"I'm innocent", "eventid":"-1", "dialoguetype": 100, "children": [86,90,96,110,118], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":118, "dialogueline":"What, field? I don't know anything about that.", "eventid":"66", "dialoguetype": 0, "children": [85], "condition":[65], "option":"Tell me about yourself.", "isroot": false}, 
{"id":110, "dialogueline":"What, knownfor? I don't know anything about that.", "eventid":"58", "dialoguetype": 0, "children": [85], "condition":[57], "option":"Tell me about yourself.", "isroot": false}, 
{"id":96, "dialogueline":"I am know for almamater. university of berlin", "eventid":"44", "dialoguetype": 0, "children": [85], "condition":[43], "option":"Tell me about yourself.", "isroot": false}, 
{"id":90, "dialogueline":"I am know for nationality. germany", "eventid":"38", "dialoguetype": 0, "children": [85], "condition":[37], "option":"Tell me about yourself.", "isroot": false}, 
{"id":86, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [85], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":77, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [78], "condition":[], "option":"", "isroot": true}, 
{"id":78, "dialogueline":"I can try.", "eventid":"-1", "dialoguetype": 100, "children": [79,123,125], "condition":[], "option":"Hi, I'm following the victim's case. If you don't mind, I have some questions for you.", "isroot": false}, 
{"id":125, "dialogueline":"Edward Albert Sharpey-Schafer's nationality is England", "eventid":"73", "dialoguetype": 616, "children": [78], "condition":[-1], "option":"Could you tell me any information about one of the suspects?", "isroot": false}, 
{"id":123, "dialogueline":"Wilhelm Hallwachs went to University of Strasbourg", "eventid":"71", "dialoguetype": 616, "children": [78], "condition":[-1], "option":"Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":79, "dialogueline":"I'm not quite sure. Perhaps, I would look inside the Stadium if I were you. You might find something.", "eventid":"-1", "dialoguetype": 0, "children": [80], "condition":[], "option":"I am searching for Eduard Heine. Do you know where they are?", "isroot": false}, 
{"id":80, "dialogueline":"Last I had heard it is is in Brooklyn. Try there.", "eventid":"32", "dialoguetype": 0, "children": [78], "condition":[], "option":"Where is the Stadium?", "isroot": false}, 
{"id":64, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 100, "children": [65], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":65, "dialogueline":"Go away", "eventid":"-1", "dialoguetype": 0, "children": [64], "condition":[], "option":"I'm looking for John Linsley?...", "isroot": false}, 
{"id":66, "dialogueline":"I want my lawyer", "eventid":"-1", "dialoguetype": 100, "children": [67,94,102,108,116], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":116, "dialogueline":"I am know for nationality. united states", "eventid":"64", "dialoguetype": 0, "children": [66], "condition":[63], "option":"Tell me about yourself.", "isroot": false}, 
{"id":108, "dialogueline":"What, field? I don't know anything about that.", "eventid":"56", "dialoguetype": 0, "children": [66], "condition":[55], "option":"Tell me about yourself.", "isroot": false}, 
{"id":102, "dialogueline":"I am know for knownfor. cosmic ray", "eventid":"50", "dialoguetype": 0, "children": [66], "condition":[49], "option":"Tell me about yourself.", "isroot": false}, 
{"id":94, "dialogueline":"I am know for almamater. university of minnesota", "eventid":"42", "dialoguetype": 0, "children": [66], "condition":[41], "option":"Tell me about yourself.", "isroot": false}, 
{"id":67, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [66], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":59, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [60], "condition":[], "option":"", "isroot": true}, 
{"id":60, "dialogueline":"If you really need it...", "eventid":"-1", "dialoguetype": 100, "children": [61,109,111,113,115], "condition":[], "option":"Greetings, I'm a detective. I'm sorry to disturb, would you answer some questions for me?", "isroot": false}, 
{"id":115, "dialogueline":"John Linsley's nationality is United States", "eventid":"63", "dialoguetype": 616, "children": [60], "condition":[-1], "option":"I need your assistance. Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":113, "dialogueline":"Edward Albert Sharpey-Schafer went to University College London", "eventid":"61", "dialoguetype": 616, "children": [60], "condition":[-1], "option":"Would you tell me some information about one of the suspects?", "isroot": false}, 
{"id":111, "dialogueline":"Wilhelm Hallwachs is a knownfor of photoelectric effect", "eventid":"59", "dialoguetype": 616, "children": [60], "condition":[-1], "option":"Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":109, "dialogueline":"Eduard Heine is a knownfor of uniform continuity", "eventid":"57", "dialoguetype": 616, "children": [60], "condition":[-1], "option":"I could use some assistance. Do you have any information about one of the suspects?", "isroot": false}, 
{"id":61, "dialogueline":"I'm not quite sure. But, the Cottage might reveal something.", "eventid":"-1", "dialoguetype": 0, "children": [62], "condition":[], "option":"I am seeking John Linsley. Have you know of them?", "isroot": false}, 
{"id":62, "dialogueline":"I would go to London. Try there.", "eventid":"26", "dialoguetype": 0, "children": [60], "condition":[], "option":"Where would I go to find the Cottage?", "isroot": false}, 
{"id":49, "dialogueline":"You can't prove anything!", "eventid":"-1", "dialoguetype": 100, "children": [50,104,106,120,122], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":122, "dialogueline":"What, field? I don't know anything about that.", "eventid":"70", "dialoguetype": 0, "children": [49], "condition":[69], "option":"Tell me about yourself.", "isroot": false}, 
{"id":120, "dialogueline":"I am know for nationality. united states", "eventid":"68", "dialoguetype": 0, "children": [49], "condition":[67], "option":"Tell me about yourself.", "isroot": false}, 
{"id":106, "dialogueline":"I am know for knownfor. missile defense", "eventid":"54", "dialoguetype": 0, "children": [49], "condition":[53], "option":"Tell me about yourself.", "isroot": false}, 
{"id":104, "dialogueline":"I am know for almamater. mit", "eventid":"52", "dialoguetype": 0, "children": [49], "condition":[51], "option":"Tell me about yourself.", "isroot": false}, 
{"id":50, "dialogueline":"You'll find nothing.", "eventid":"-1", "dialoguetype": 0, "children": [49], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":46, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [47], "condition":[], "option":"", "isroot": true}, 
{"id":47, "dialogueline":"Yeah. I can try.", "eventid":"-1", "dialoguetype": 100, "children": [48], "condition":[], "option":"Greetings, I'm investigating the victim's case. Thank you for your time, I request that you answer some questions.", "isroot": false}, 
{"id":48, "dialogueline":"I suggest you check out Brooklyn.", "eventid":"20", "dialoguetype": 0, "children": [47], "condition":[], "option":"Someone directed me to look for Theodore Postol. Any idea where they could have gone?", "isroot": false}, 
{"id":34, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 100, "children": [35], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":35, "dialogueline":"Don't know. Leave me alone.", "eventid":"-1", "dialoguetype": 0, "children": [34], "condition":[], "option":"I'm looking for Edward Albert Sharpey-Schafer?...", "isroot": false}, 
{"id":36, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 100, "children": [37,92,100,114,126], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":126, "dialogueline":"I am know for nationality. england", "eventid":"74", "dialoguetype": 0, "children": [36], "condition":[73], "option":"Tell me about yourself.", "isroot": false}, 
{"id":114, "dialogueline":"I am know for almamater. university college london", "eventid":"62", "dialoguetype": 0, "children": [36], "condition":[61], "option":"Tell me about yourself.", "isroot": false}, 
{"id":100, "dialogueline":"I am know for knownfor. endocrine", "eventid":"48", "dialoguetype": 0, "children": [36], "condition":[47], "option":"Tell me about yourself.", "isroot": false}, 
{"id":92, "dialogueline":"What, field? I don't know anything about that.", "eventid":"40", "dialoguetype": 0, "children": [36], "condition":[39], "option":"Tell me about yourself.", "isroot": false}, 
{"id":37, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [36], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":29, "dialogueline":"Hi. How may I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [30], "condition":[], "option":"", "isroot": true}, 
{"id":30, "dialogueline":"Of course. I can try.", "eventid":"-1", "dialoguetype": 100, "children": [31], "condition":[], "option":"Hello, I'm working on the victim's case. I'm sorry to disturb, can you answer some questions for me?", "isroot": false}, 
{"id":31, "dialogueline":"I'm not sure. But, I think the Planetarium could help.", "eventid":"-1", "dialoguetype": 0, "children": [32], "condition":[], "option":"A friend encouraged me to seek out Edward Albert Sharpey-Schafer. Do you know?", "isroot": false}, 
{"id":32, "dialogueline":"I suggest you go to London. Try searching there.", "eventid":"12", "dialoguetype": 0, "children": [30], "condition":[], "option":"Where is the Planetarium?", "isroot": false}, 
{"id":82, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [83], "condition":[], "option":"", "isroot": true}, 
{"id":83, "dialogueline":"Yes.", "eventid":"-1", "dialoguetype": 100, "children": [84], "condition":[], "option":"Hi, I'm a private-eye following the victim's case. If you don't mind, I request that you answer some questions.", "isroot": false}, 
{"id":84, "dialogueline":"I would go to Berlin.", "eventid":"34", "dialoguetype": 0, "children": [83], "condition":[], "option":"I am tracking down Eduard Heine. Do you know where they are?", "isroot": false}, 
{"id":19, "dialogueline":"You can't prove anything!", "eventid":"-1", "dialoguetype": 100, "children": [20,88,98,112,124], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":124, "dialogueline":"I am know for almamater. university of strasbourg", "eventid":"72", "dialoguetype": 0, "children": [19], "condition":[71], "option":"Tell me about yourself.", "isroot": false}, 
{"id":112, "dialogueline":"I am know for knownfor. photoelectric effect", "eventid":"60", "dialoguetype": 0, "children": [19], "condition":[59], "option":"Tell me about yourself.", "isroot": false}, 
{"id":98, "dialogueline":"What, field? I don't know anything about that.", "eventid":"46", "dialoguetype": 0, "children": [19], "condition":[45], "option":"Tell me about yourself.", "isroot": false}, 
{"id":88, "dialogueline":"I am know for nationality. germany", "eventid":"36", "dialoguetype": 0, "children": [19], "condition":[35], "option":"Tell me about yourself.", "isroot": false}, 
{"id":20, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [19], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":16, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [17], "condition":[], "option":"", "isroot": true}, 
{"id":17, "dialogueline":"Certainly. Anything to help.", "eventid":"-1", "dialoguetype": 100, "children": [18], "condition":[], "option":"Hello, I'm working on the victim's case. Would I ask you some questions?", "isroot": false}, 
{"id":18, "dialogueline":"I recommend you go to Germany.", "eventid":"6", "dialoguetype": 0, "children": [17], "condition":[], "option":"A friend told me to seek out Wilhelm Hallwachs. Have you heard of them?", "isroot": false}, 
{"id":10, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 100, "children": [11], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":11, "dialogueline":"Get out", "eventid":"-1", "dialoguetype": 0, "children": [10], "condition":[], "option":"I'm looking for Wilhelm Hallwachs?...", "isroot": false}, 
{"id":12, "dialogueline":"Hello?", "eventid":"-1", "dialoguetype": 0, "children": [13], "condition":[], "option":"", "isroot": true}, 
{"id":13, "dialogueline":"Are you sure you need me?", "eventid":"-1", "dialoguetype": 100, "children": [14], "condition":[], "option":"Hi, I'm investigating the victim's case. If it's not too much trouble, I request that you answer some questions for me.", "isroot": false}, 
{"id":14, "dialogueline":"I'm not quite sure. Perhaps, Physicist could know.", "eventid":"-1", "dialoguetype": 0, "children": [15], "condition":[], "option":"A friend told me to seek out Wilhelm Hallwachs. Have you heard of them?", "isroot": false}, 
{"id":15, "dialogueline":"Somebody told me they located in ???? ????? ???.", "eventid":"5", "dialoguetype": 0, "children": [13], "condition":[], "option":"Where is Physicist?", "isroot": false}, 
{"id":71, "dialogueline":"Hello? How may I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [72], "condition":[], "option":"", "isroot": true}, 
{"id":72, "dialogueline":"If you really need it...", "eventid":"28", "dialoguetype": 100, "children": [73], "condition":[], "option":"Greetings, I'm following the victim's case. Thank you for your time, would you answer some questions for me?", "isroot": false}, 
{"id":73, "dialogueline":"I am called Josiah Willard Gibbs.", "eventid":"29", "dialoguetype": 0, "children": [75], "condition":[], "option":"Tell me your name.", "isroot": false}, 
{"id":75, "dialogueline":"Last I heard about them, Mileva Mari? visited Titel. That's all I know.", "eventid":"30", "dialoguetype": 0, "children": [76], "condition":[], "option":"Do you have anything specific that might be valuable to the investigation?", "isroot": false}, 
{"id":76, "dialogueline":"I think Eduard Heine could be connected. However, It is difficult to say.", "eventid":"31", "dialoguetype": 0, "children": [72], "condition":[], "option":"I need a lead. Can you think of somebody who has a reason to do this?", "isroot": false}, 
{"id":54, "dialogueline":"Greetings. Can I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [55], "condition":[], "option":"", "isroot": true}, 
{"id":55, "dialogueline":"Certainly.", "eventid":"21", "dialoguetype": 100, "children": [56,117,119,121], "condition":[], "option":"Hello, I'm working on the victim's case. Thank you for your time, I have some questions for you.", "isroot": false}, 
{"id":121, "dialogueline":"No one know what field Theodore Postol has.", "eventid":"69", "dialoguetype": 616, "children": [55], "condition":[21], "option":"Do you recall some information about one of the suspects?", "isroot": false}, 
{"id":119, "dialogueline":"Theodore Postol's nationality is United States", "eventid":"67", "dialoguetype": 616, "children": [55], "condition":[21], "option":"Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":117, "dialogueline":"No one know what field Eduard Heine has.", "eventid":"65", "dialoguetype": 616, "children": [55], "condition":[21], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":56, "dialogueline":"I'm Hermann Georg Fiedler.", "eventid":"22", "dialoguetype": 0, "children": [57], "condition":[], "option":"State your name.", "isroot": false}, 
{"id":57, "dialogueline":"The victim talked about a thing known as Hornsey.", "eventid":"23", "dialoguetype": 0, "children": [58], "condition":[], "option":"Is there anything you remember that might be useful to the investigation?", "isroot": false}, 
{"id":58, "dialogueline":"I believe John Linsley could be connected. But, It is hard to say.", "eventid":"24", "dialoguetype": 0, "children": [55], "condition":[], "option":"I need your help. Do you have any more information?", "isroot": false}, 
{"id":40, "dialogueline":"Hi. How can I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [41], "condition":[], "option":"", "isroot": true}, 
{"id":41, "dialogueline":"Okay. Anything to help.", "eventid":"14", "dialoguetype": 100, "children": [42,103,105,107], "condition":[], "option":"Hello, I'm a detective. Please could you help answer some questions?", "isroot": false}, 
{"id":107, "dialogueline":"No one know what field John Linsley has.", "eventid":"55", "dialoguetype": 616, "children": [41], "condition":[14], "option":"Do you have any information about one of the suspects?", "isroot": false}, 
{"id":105, "dialogueline":"Theodore Postol is a knownfor of missile defense", "eventid":"53", "dialoguetype": 616, "children": [41], "condition":[14], "option":"Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":103, "dialogueline":"Theodore Postol went to MIT", "eventid":"51", "dialoguetype": 616, "children": [41], "condition":[14], "option":"Do you know some information about one of the suspects?", "isroot": false}, 
{"id":42, "dialogueline":"I am named Nathan Rosen. I was one influence.", "eventid":"15", "dialoguetype": 0, "children": [43], "condition":[], "option":"Please, can you tell me your name?", "isroot": false}, 
{"id":43, "dialogueline":"I think the victim talked about London.", "eventid":"16", "dialoguetype": 0, "children": [44], "condition":[], "option":"Is there anything you remember that might be of use to the investigation?", "isroot": false}, 
{"id":44, "dialogueline":"I am suspicious of Theodore Postol.", "eventid":"17", "dialoguetype": 0, "children": [41], "condition":[], "option":"I could use your assistance. Do you have any more information?", "isroot": false}, 
{"id":24, "dialogueline":"Hi. Do you need something?", "eventid":"-1", "dialoguetype": 0, "children": [25], "condition":[], "option":"", "isroot": true}, 
{"id":25, "dialogueline":"Are you sure you need me?", "eventid":"7", "dialoguetype": 100, "children": [26,95,97,99,101], "condition":[], "option":"Greetings, I'm following the victim's case. Thank you for your time, I ask that you answer some questions for me.", "isroot": false}, 
{"id":101, "dialogueline":"John Linsley is a knownfor of cosmic ray", "eventid":"49", "dialoguetype": 616, "children": [25], "condition":[7], "option":"I need a lead. Would you give me some information about one of the suspects?", "isroot": false}, 
{"id":99, "dialogueline":"Edward Albert Sharpey-Schafer is a knownfor of endocrine", "eventid":"47", "dialoguetype": 616, "children": [25], "condition":[7], "option":"I need your cooperation. Do you remember any information about one of the suspects?", "isroot": false}, 
{"id":97, "dialogueline":"No one know what field Wilhelm Hallwachs has.", "eventid":"45", "dialoguetype": 616, "children": [25], "condition":[7], "option":"I could use your cooperation. Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":95, "dialogueline":"Eduard Heine went to University of Berlin", "eventid":"43", "dialoguetype": 616, "children": [25], "condition":[7], "option":"I could use some help. Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":26, "dialogueline":"My name is David Hume.", "eventid":"8", "dialoguetype": 0, "children": [27], "condition":[], "option":"Please, could you tell me your name?", "isroot": false}, 
{"id":27, "dialogueline":"If I remember correctly, the victim mentioned a thing called London.", "eventid":"9", "dialoguetype": 0, "children": [28], "condition":[], "option":"Is there something you recall that might be valuable to the investigation?", "isroot": false}, 
{"id":28, "dialogueline":"I believe Edward Albert Sharpey-Schafer might be connected. However, It is tough to say.", "eventid":"10", "dialoguetype": 0, "children": [25], "condition":[], "option":"I would like a lead. Do you have any more information?", "isroot": false}, 
{"id":4, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [5], "condition":[], "option":"", "isroot": true}, 
{"id":5, "dialogueline":"Certainly.", "eventid":"0", "dialoguetype": 100, "children": [6,89,91,93], "condition":[], "option":"Greetings, I'm a super sleuth following the victim's case. Thank you for your time, please would you help answer some questions?", "isroot": false}, 
{"id":93, "dialogueline":"John Linsley went to University of Minnesota", "eventid":"41", "dialoguetype": 616, "children": [5], "condition":[0], "option":"Do you have some information about one of the suspects?", "isroot": false}, 
{"id":91, "dialogueline":"No one know what field Edward Albert Sharpey-Schafer has.", "eventid":"39", "dialoguetype": 616, "children": [5], "condition":[0], "option":"Would you give me some information about one of the suspects?", "isroot": false}, 
{"id":89, "dialogueline":"Eduard Heine's nationality is Germany", "eventid":"37", "dialoguetype": 616, "children": [5], "condition":[0], "option":"I could use your cooperation. Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":6, "dialogueline":"Okay, I am called Minister of Munitions.", "eventid":"1", "dialoguetype": 0, "children": [7], "condition":[], "option":"Please, can you tell me who you are?", "isroot": false}, 
{"id":7, "dialogueline":"The victim mentioned a thing named Switzerland.", "eventid":"2", "dialoguetype": 0, "children": [8], "condition":[], "option":"Did the victim remark anything specific that you can remember?", "isroot": false}, 
{"id":8, "dialogueline":"I am suspicious of Wilhelm Hallwachs.", "eventid":"3", "dialoguetype": 0, "children": [5], "condition":[], "option":"I would like a lead. Can you think of someone who could be involved?", "isroot": false}],
"crime":{"suspects":[22,3,8,12,17],"culprit":22,"facts":[{"pid":22,"factoid":"Eduard Heine went to University of Berlin","condition":43},{"pid":22,"factoid":"Eduard Heine's nationality is Germany","condition":37},{"pid":22,"factoid":"No one know what field Eduard Heine has.","condition":65},{"pid":22,"factoid":"Eduard Heine is a knownfor of uniform continuity","condition":57},{"pid":3,"factoid":"Wilhelm Hallwachs went to University of Strasbourg","condition":71},{"pid":3,"factoid":"Wilhelm Hallwachs' nationality is Germany","condition":35},{"pid":3,"factoid":"No one know what field Wilhelm Hallwachs has.","condition":45},{"pid":3,"factoid":"Wilhelm Hallwachs is a knownfor of photoelectric effect","condition":59},{"pid":8,"factoid":"Edward Albert Sharpey-Schafer went to University College London","condition":61},{"pid":8,"factoid":"Edward Albert Sharpey-Schafer's nationality is England","condition":73},{"pid":8,"factoid":"No one know what field Edward Albert Sharpey-Schafer has.","condition":39},{"pid":8,"factoid":"Edward Albert Sharpey-Schafer is a knownfor of endocrine","condition":47},{"pid":12,"factoid":"Theodore Postol went to MIT","condition":51},{"pid":12,"factoid":"Theodore Postol's nationality is United States","condition":67},{"pid":12,"factoid":"No one know what field Theodore Postol has.","condition":69},{"pid":12,"factoid":"Theodore Postol is a knownfor of missile defense","condition":53},{"pid":17,"factoid":"John Linsley went to University of Minnesota","condition":41},{"pid":17,"factoid":"John Linsley's nationality is United States","condition":63},{"pid":17,"factoid":"No one know what field John Linsley has.","condition":55},{"pid":17,"factoid":"John Linsley is a knownfor of cosmic ray","condition":49}]}}
