{
    "people" : [
    {"id":4, "name":"Rudolph Nissen", "description":"Rudolph Nissen   was a surgeon who chaired surgery departments in Turkey, the United States and Switzerland.  The Nissen fundoplication, a surgical procedure for the treatment of gastroesophageal reflux disease, is named after him.", "drootid": 4, "condition":[], "buildingid":0, "image":"PERSON4.png"}, 
    {"id":9, "name":"Jo Davidson", "description":"Jo Davidson  was an American sculptor.  Although he specialized in realistic, intense portrait busts, Davidson did not require his subjects to formally pose for him; rather, he observed and spoke with them.", "drootid": 27, "condition":[], "buildingid":0, "image":"PERSON9.png"}, 
    {"id":12, "name":"Emil Otto Hoppé", "description":"Emil Otto Hoppé  was a German-born British portrait, travel, and topographic photographer active between 1907 and 1945.  Born to a wealthy family in Munich, he moved to London in 1900 to train as a financier, but took up photography and rapidly achieved great success.", "drootid": 42, "condition":[], "buildingid":0, "image":"PERSON12.png"}, 
    {"id":19, "name":"Victor Henry Anderson", "description":"Victor Henry Anderson  was an American Wiccan priest and poet.  He was a founding member of the Feri Tradition, a form of the modern Pagan new religious movement of Wicca which was established in California during the 1960s.", "drootid": 64, "condition":[], "buildingid":0, "image":"PERSON19.png"}, 
    {"id":25, "name":"Boris", "description":"There is no information available for this character.", "drootid": 88, "condition":[], "buildingid":0, "image":"PERSON25.png"}, 
    {"id":1, "name":"Leo Szilard", "description":" Leo Szilard  was a Jewish Hungarian-born physicist and inventor.  He conceived the nuclear chain reaction in 1933, patented the idea of a nuclear reactor with Enrico Fermi, and in late 1939 wrote the letter for Albert Einstein's signature that resulted in the Manhattan Project that built the atomic bomb.", "drootid": 1, "condition":[4], "buildingid":1, "image":"PERSON1.png"}, 
    {"id":2, "name":"????? ???????? ???????", "description":"The following is an academic genealogy of theoretical physicists and is constructed by following the pedigree of thesis advisors.  If an advisor did not exist, or if the field of physics is unrelated, an academic genealogical link can be constructed by using the university from which the theoretical physicist graduated.", "drootid": 2, "condition":[5], "buildingid":2, "image":"PERSON2.png"}, 
    {"id":5, "name":"Victor", "description":"There is no information available for this character.", "drootid": 15, "condition":[5], "buildingid":2, "image":"PERSON5.png"}, 
    {"id":3, "name":"Christian Ludwig Gerling", "description":"Christian Ludwig Gerling  studied under Carl Friedrich Gauss, obtaining his doctorate in 1812 for a thesis entitled: Methodi proiectionis orthographicae usum ad calculos parallacticos facilitandos explicavit simulque eclipsin solarem die, at the University of Göttingen.  He is notable for his work on geodetics and in 1927 some 60 letters of correspondence between Gerling and Gauss on the topic were published.", "drootid": 22, "condition":[6], "buildingid":3, "image":"PERSON3.png"}, 
    {"id":7, "name":"David Hume", "description":"David Hume  – 25 August 1776  was a Scottish philosopher, historian, economist, and essayist, who is best known today for his highly influential system of radical philosophical empiricism, skepticism, and naturalism.  Hume's empiricist approach to philosophy places him with John Locke, George Berkeley, Francis Bacon, and Thomas Hobbes as a British Empiricist.", "drootid": 25, "condition":[9], "buildingid":5, "image":"PERSON7.png"}, 
    {"id":8, "name":"Hubertus Strughold", "description":"Dr.  Hubertus Strughold MD, Ph.D  was a German-born physiologist and prominent medical researcher. ", "drootid": 38, "condition":[13], "buildingid":6, "image":"PERSON8.png"}, 
    {"id":13, "name":"Alex", "description":"There is no information available for this character.", "drootid": 43, "condition":[16], "buildingid":10, "image":"PERSON13.png"}, 
    {"id":14, "name":"Vlad", "description":"There is no information available for this character.", "drootid": 48, "condition":[18], "buildingid":11, "image":"PERSON14.png"}, 
    {"id":15, "name":"Boris", "description":"There is no information available for this character.", "drootid": 52, "condition":[19], "buildingid":12, "image":"PERSON15.png"}, 
    {"id":11, "name":"Martin Lewis Perl", "description":"Martin Lewis Perl  was an American physicist who won the Nobel Prize in Physics in 1995 for his discovery of the tau lepton.", "drootid": 59, "condition":[20], "buildingid":9, "image":"PERSON11.png"}, 
    {"id":27, "name":"Raphael", "description":"There is no information available for this character.", "drootid": 94, "condition":[33], "buildingid":17, "image":"PERSON27.png"}, 
    {"id":20, "name":"Raphael", "description":"There is no information available for this character.", "drootid": 65, "condition":[23], "buildingid":15, "image":"PERSON20.png"}, 
    {"id":22, "name":"Nathan", "description":"There is no information available for this character.", "drootid": 76, "condition":[26], "buildingid":16, "image":"PERSON22.png"}, 
    {"id":17, "name":"James Hoban", "description":"James Hoban   was an Irish architect, best known for designing the White House in Washington, D. C.", "drootid": 62, "condition":[25], "buildingid":13, "image":"PERSON17.png"}, 
    {"id":21, "name":"Victor", "description":"There is no information available for this character.", "drootid": 74, "condition":[25], "buildingid":13, "image":"PERSON21.png"}, 
    {"id":18, "name":"Prabhakar Misra", "description":"Prabhakar Misra is an American physicist, who researches and teaches at Howard University in Washington, D. C.", "drootid": 84, "condition":[27], "buildingid":14, "image":"PERSON18.png"}, 
    {"id":26, "name":"Alex", "description":"There is no information available for this character.", "drootid": 93, "condition":[32], "buildingid":20, "image":"PERSON26.png"}, 
    {"id":24, "name":"Henry Brunner", "description":"Henry Brunner  was an English chemist.  Henry Brunner was born in Everton, Liverpool, the elder son of John Brunner, a Swiss Unitarian and schoolmaster, and Margaret Curphey, who originated from the Isle of Man.", "drootid": 100, "condition":[34], "buildingid":18, "image":"PERSON24.png"}],
    "items":[{"id":4, "name":"Key", "description":"", "condition": [], "eventid": -1, "buildingid":0, "image":"null"}, 
    {"id":2, "name":"????", "description":"It is a book about ????. It says: An anesthetic  is a drug that causes anesthesia, which is a reversible loss of sensation.  Anesthetics contrast with analgesics , which relieve pain without eliminating sensation.  The following people are mentioned:  Hubertus Strughold   And the following place: German Empire", "condition": [12], "eventid": 13, "buildingid":8, "image":"null"}, 
    {"id":0, "name":"Atomic Power", "description":"It is a letter about Atomic Power. It says: Atomic Power is an American short documentary film produced by The March of Time and released to theaters August 9, 1946, one year after the end of World War II.  It was nominated for an Academy Award for Best Documentary Short.  The following people are mentioned:  Leo Szilard Albert Einstein   And the following place: Budapest", "condition": [2], "eventid": 4, "buildingid":4, "image":"null"}, 
    {"id":1, "name":"Aesthetics", "description":"It is a list about Aesthetics. It says: Aesthetics  is a branch of philosophy dealing with the nature of art, beauty, and taste, with the creation and appreciation of beauty.  It is more scientifically defined as the study of sensory or sensori-emotional values, sometimes called judgments of sentiment and taste.  The following people are mentioned:  Anesthetic  And the following place: Switzerland", "condition": [11], "eventid": 12, "buildingid":7, "image":"null"}, 
    {"id":3, "name":"World war", "description":"It is a book about World war. It says: A world war is a war involving many of the world's countries or most of the most powerful and populous ones.  World wars span multiple countries on multiple continents, with battles fought in multiple theaters.  The following people are mentioned:  Albert Einstein Morecambe", "condition": [30], "eventid": 32, "buildingid":19, "image":"null"}],
    "buildings":[{"id":0, "name":"House of Albert Einstein", "description":" and Swiss Confederation  Switzerland , officially the Swiss Confederation is a federal republic in Europe", "locktype": "dark", "coordx": 340, "coordy": 267, "condition":[], "cityid":0, "peopleid":[4,9,12,19,25], "itemsid":[4], "image":"BUILDING0.png"}, 
    {"id":8, "name":"Castle", "description":" While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\"  The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east", "locktype": "dark", "coordx": 228, "coordy": 72, "condition":[12], "cityid":0, "peopleid":[], "itemsid":[2], "image":"BUILDING8.png"}, 
    {"id":1, "name":"House of Leo Szilard", "description":"Budapest  is the capital and the largest city of Hungary, and one of the largest cities in the European Union It is the country's principal political, cultural, commercial, industrial, and transportation centre, sometimes described as the primate city of Hungary", "locktype": "dark", "coordx": 61, "coordy": 188, "condition":[4], "cityid":1, "peopleid":[1], "itemsid":[], "image":"BUILDING1.png"}, 
    {"id":2, "name":"House of ????? ???????? ???????", "description":"Göttingen  is a university city in Lower Saxony, Germany It is the capital of the district of Göttingen", "locktype": "dark", "coordx": 348, "coordy": 127, "condition":[5,5], "cityid":2, "peopleid":[2,5], "itemsid":[], "image":"BUILDING2.png"}, 
    {"id":4, "name":"Police Station", "description":" The River Leine runs through the town In 2011 the population was 116,052", "locktype": "key", "coordx": 309, "coordy": 158, "condition":[2], "cityid":2, "peopleid":[], "itemsid":[0], "image":"BUILDING4.png"}, 
    {"id":3, "name":"House of Christian Ludwig Gerling", "description":"Hamburg , officially Freie und Hansestadt Hamburg , is the second largest city in Germany and the eighth largest city in the European Union It is the second smallest German state by area", "locktype": "dark", "coordx": 340, "coordy": 286, "condition":[6], "cityid":3, "peopleid":[3], "itemsid":[], "image":"BUILDING3.png"}, 
    {"id":7, "name":"Police Station", "description":" Its population is over 17 million people, and the Hamburg Metropolitan Region  has more than 5 million inhabitants", "locktype": "dark", "coordx": 234, "coordy": 112, "condition":[11], "cityid":3, "peopleid":[], "itemsid":[1], "image":"BUILDING7.png"}, 
    {"id":5, "name":"House of David Hume", "description":"Edinburgh  is the capital city of Scotland and one of its 32 local government council areas Located in Lothian on the Firth of Forth's southern shore, it is Scotland's second most populous city and the seventh most populous in the United Kingdom", "locktype": "dark", "coordx": 208, "coordy": 201, "condition":[9], "cityid":4, "peopleid":[7], "itemsid":[], "image":"BUILDING5.png"}, 
    {"id":6, "name":"House of Hubertus Strughold", "description":"The German Empire  was the historical German nation state that existed from the unification of Germany in 1871 to the abdication of Kaiser Wilhelm II in November 1918, when Germany became a federal republic The German Empire consisted of 26 constituent territories, with most being ruled by royal families", "locktype": "dark", "coordx": 81, "coordy": 113, "condition":[13], "cityid":5, "peopleid":[8], "itemsid":[], "image":"BUILDING6.png"}, 
    {"id":10, "name":"Library", "description":" The municipality has approximately 400,028 inhabitants, the urban agglomeration 1315 million, and the Zurich metropolitan area 1", "locktype": "dark", "coordx": 175, "coordy": 225, "condition":[16,16,16], "cityid":6, "peopleid":[13], "itemsid":[], "image":"BUILDING10.png"}, 
    {"id":11, "name":"Police Station", "description":"San Francisco , officially the City and County of San Francisco, is the cultural, commercial, and financial center of Northern California and the only consolidated city-county in California San Francisco encompasses a land area of about 46", "locktype": "dark", "coordx": 139, "coordy": 232, "condition":[18], "cityid":7, "peopleid":[14], "itemsid":[], "image":"BUILDING11.png"}, 
    {"id":12, "name":"School", "description":"California  is the most populous state in the United States It is also the third most extensive by area", "locktype": "dark", "coordx": 249, "coordy": 133, "condition":[19], "cityid":8, "peopleid":[15], "itemsid":[], "image":"BUILDING12.png"}, 
    {"id":9, "name":"House of Martin Lewis Perl", "description":"The City of New York, often called New York City, New York, or simply The City, is the most populous city in the United States Located at the southern tip of the state of New York, the city is the center of the New York metropolitan area, one of the most populous urban agglomerations in the world", "locktype": "dark", "coordx": 60, "coordy": 157, "condition":[20], "cityid":9, "peopleid":[11], "itemsid":[], "image":"BUILDING9.png"}, 
    {"id":17, "name":"North West England", "description":" With a US", "locktype": "dark", "coordx": 84, "coordy": 192, "condition":[33,33], "cityid":9, "peopleid":[27], "itemsid":[], "image":"BUILDING17.png"}, 
    {"id":15, "name":"Police Station", "description":" It has been the residence of every US", "locktype": "dark", "coordx": 71, "coordy": 165, "condition":[23,23,23], "cityid":10, "peopleid":[20], "itemsid":[], "image":"BUILDING15.png"}, 
    {"id":16, "name":"Forest", "description":"Washington, DC", "locktype": "dark", "coordx": 146, "coordy": 255, "condition":[26], "cityid":11, "peopleid":[22], "itemsid":[], "image":"BUILDING16.png"}, 
    {"id":13, "name":"House of James Hoban", "description":"County Kilkenny  is a county in Ireland It is in the province of Leinster and is part of the South-East Region", "locktype": "dark", "coordx": 82, "coordy": 229, "condition":[25,25], "cityid":12, "peopleid":[17,21], "itemsid":[], "image":"BUILDING13.png"}, 
    {"id":14, "name":"House of Prabhakar Misra", "description":"The Ohio State Buckeyes football team is a college football team that competes as part of the National Collegiate Athletic Association  Division I Football Bowl Subdivision, representing Ohio State University in the East Division of the Big Ten Conference Ohio State has played their home games at Ohio Stadium in Columbus, Ohio since 1922", "locktype": "dark", "coordx": 167, "coordy": 94, "condition":[27], "cityid":13, "peopleid":[18], "itemsid":[], "image":"BUILDING14.png"}, 
    {"id":19, "name":"School", "description":" The Buckeyes are recognized by the university and NCAA as having won eight national championships along with 37 conference championships , four division championships, 10 undefeated seasons, and six perfect seasons of having no losses or ties Football was introduced to the university by George Cole and Alexander S", "locktype": "dark", "coordx": 53, "coordy": 175, "condition":[30], "cityid":13, "peopleid":[], "itemsid":[3], "image":"BUILDING19.png"}, 
    {"id":20, "name":"Library", "description":"Morecambe /?m??k?m/ is a town on Morecambe Bay in Lancashire, England, which had a population of 34,768 at the 2011 Census", "locktype": "dark", "coordx": 220, "coordy": 275, "condition":[32], "cityid":14, "peopleid":[26], "itemsid":[], "image":"BUILDING20.png"}, 
    {"id":18, "name":"House of Henry Brunner", "description":"Everton is a district in Liverpool, in Merseyside, England, and a Liverpool City Council ward Historically in Lancashire, at the 2001 Census the population was recorded as 7,398, increasing to 14,782 at the 2011 Census", "locktype": "dark", "coordx": 326, "coordy": 228, "condition":[34], "cityid":15, "peopleid":[24], "itemsid":[], "image":"BUILDING18.png"}],
    "cities":[{"id":0, "name":"Switzerland", "description":" and Swiss Confederation . Switzerland , officially the Swiss Confederation is a federal republic in Europe. While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\" . The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2 . While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zürich and Geneva. The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. The country has a history of armed neutrality going back to the Reformation, it has not been in a state of war internationally since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. In addition to being the birthplace of the Red Cross, Switzerland is home to numerous international organisations, including the second largest UN office. On the European level, it is a founding member of the European Free Trade Association, but notably it is not part of the European Union, nor the European Economic Area. However, the country does participate in the Schengen Area and the EU's single market through a number of bilateral treaties. Spanning the intersection of Germanic and Romance Europe, Switzerland comprises four main linguistic and cultural regions: German, French, Italian and Romansh. Although the majority of the population are German speaking, Swiss national identity is rooted in a common historical background, shared values such as federalism and direct democracy, and Alpine symbolism. Due to its linguistic diversity, Switzerland is known by a variety of native names: Schweiz [??va?ts] ; Suisse [s?is] ; Svizzera [?zvittsera] ; and Svizra [??vi?tsr?] or [??vi?ts???] . On coins and stamps, Latin  is used instead of the four living languages. Switzerland is one of the most developed countries in the world, with the highest nominal wealth per adult and the eighth-highest per capita gross domestic product according to the IMF. Switzerland ranks at or near the top globally in several metrics of national performance, including government transparency, civil liberties, quality of life, economic competitiveness, and human development. Zürich and Geneva have each been ranked among the top cities in the world in terms of quality of life, with the former ranked second globally, according to Mercer.", "coordx": 210, "coordy": 124, "condition":[], "buildingid":[0,8], "image":"CITY0.png"}, 
    {"id":1, "name":"Budapest", "description":"Budapest  is the capital and the largest city of Hungary, and one of the largest cities in the European Union. It is the country's principal political, cultural, commercial, industrial, and transportation centre, sometimes described as the primate city of Hungary. According to the census, in 2011 Budapest had 1.74 million inhabitants, down from its 1989 peak of 2.1 million due to suburbanisation. The Budapest Metropolitan Area is home to 3.3 million people. The city covers an area of 525 square kilometres . Budapest became a single city occupying both banks of the river Danube with the unification of Buda and Óbuda on the west bank, with Pest on the east bank on 17 November 1873. The history of Budapest began with Aquincum, originally a Celtic settlement that became the Roman capital of Lower Pannonia. After the peace treaty of 829 added Pannonia to Bulgaria following the Bulgarian victory under Omurtag over the Holy Roman Empire under Louis the Pious, Budapest, as it's named today, arose in the 9th century out of two new Bulgarian military frontier fortresses and settlements Buda and Pest, situated on the two banks of the Danube. Hungarians arrived in the territory in the 9th century. Their first settlement was pillaged by the Mongols in 1241–42. The re-established town became one of the centres of Renaissance humanist culture by the 15th century. Following the Battle of Mohács and nearly 150 years of Ottoman rule, the region entered a new age of prosperity in the 18th and 19th centuries, and Budapest became a global city after its unification in 1873. It also became the second capital of the Austro-Hungarian Empire, a great power that dissolved in 1918, following World War I. Budapest was the focal point of the Hungarian Revolution of 1848, the Hungarian Republic of Councils in 1919, the Battle of Budapest in 1945, and the Revolution of 1956. Cited as one of the most beautiful cities in Europe, Budapest's extensive World Heritage Site includes the banks of the Danube, the Buda Castle Quarter, Andrássy Avenue, Heroes' Square and the Millennium Underground Railway, the second-oldest metro line in the world. It has around 80 geothermal springs, the world's largest thermal water cave system, second largest synagogue, and third largest Parliament building. The city attracts about 4.4 million tourists a year, making it the 25th most popular city in the world, and the 6th in Europe, according to Euromonitor. Considered a financial hub in Central Europe, the city ranked third on Mastercard's Emerging Markets Index, and ranked as the most liveable Central or Eastern European city on EIU's quality of life index. It has also been ranked as \"the world's second best city\" by Condé Nast Traveler, and \"Europe's 7th most idyllic place to live\" by Forbes. It is the highest ranked Central/Eastern European city on Innovation Cities' Top 100 index. Budapest is home to the headquarters of the European Institute of Innovation and Technology , the European Police College  and the first foreign office of the China Investment Promotion Agency . Eighteen universities are situated in Budapest, including the Central European University, Eötvös Loránd University and the Budapest University of Technology and Economics.", "coordx": 227, "coordy": 123, "condition":[4], "buildingid":[1], "image":"CITY1.png"}, 
    {"id":2, "name":"Göttingen", "description":"Göttingen  is a university city in Lower Saxony, Germany. It is the capital of the district of Göttingen. The River Leine runs through the town. In 2011 the population was 116,052.", "coordx": 214, "coordy": 114, "condition":[5,5,2], "buildingid":[2,4], "image":"CITY2.png"}, 
    {"id":3, "name":"Freie und Hansestadt Hamburg", "description":"Hamburg , officially Freie und Hansestadt Hamburg , is the second largest city in Germany and the eighth largest city in the European Union. It is the second smallest German state by area. Its population is over 1.7 million people, and the Hamburg Metropolitan Region  has more than 5 million inhabitants. The city is situated on the river Elbe. The official name reflects its history as a member of the medieval Hanseatic League, as a free imperial city of the Holy Roman Empire, a city-state, and one of the 16 states of Germany. Before the 1871 Unification of Germany, it was a fully sovereign state. Prior to the constitutional changes in 1919, the civic republic was ruled by a class of hereditary grand burghers or Hanseaten. Hamburg is a transport hub, being the 2nd largest port in Europe, and is an affluent city in Europe. It has become a media and industrial centre, with plants and facilities belonging to Airbus, Blohm + Voss and Aurubis. The radio and television broadcaster Norddeutscher Rundfunk and publishers such as Gruner + Jahr and Spiegel-Verlag are pillars of the important media industry in Hamburg. Hamburg has been an important financial centre for centuries, and is the seat of the world's second oldest bank, Berenberg Bank. The city is a notable tourist destination for both domestic and overseas visitors; it ranked 16th in the world for livability in 2015. The ensemble Speicherstadt and Kontorhausviertel was declared a World Heritage Site by the UNESCO in July 2015.", "coordx": 214, "coordy": 109, "condition":[6,11], "buildingid":[3,7], "image":"CITY3.png"}, 
    {"id":4, "name":"City of Edinburgh", "description":"Edinburgh  is the capital city of Scotland and one of its 32 local government council areas. Located in Lothian on the Firth of Forth's southern shore, it is Scotland's second most populous city and the seventh most populous in the United Kingdom. The 2014 official population estimates are 464,990 for the city of Edinburgh, 492,680 for the local authority area, and 1,339,380 for the city region as of 2014 . Recognised as the capital of Scotland since at least the 15th century, Edinburgh is home to the Scottish Parliament and the seat of the monarchy in Scotland. The city is also the annual venue of the General Assembly of the Church of Scotland and home to national institutions such as the National Museum of Scotland, the National Library of Scotland and the Scottish National Gallery. It is the largest financial centre in the UK after London. Historically part of Midlothian, the city has long been a centre of education, particularly in the fields of medicine, Scots law, literature, the sciences and engineering. The University of Edinburgh, founded in 1582 and now one of four in the city, was placed 17th in the QS World University Rankings in 2013 and 2014. The city is also famous for the Edinburgh International Festival and the Fringe, the latter being the world's largest annual international arts festival. The city's historical and cultural attractions have made it the United Kingdom's second most popular tourist destination after London, attracting over one million overseas visitors each year. Historic sites in Edinburgh include Edinburgh Castle, Holyrood Palace, the churches of St. Giles, Greyfriars and the Canongate, and the extensive Georgian New Town, built in the 18th century. Edinburgh's Old Town and New Town together are listed as a UNESCO World Heritage Site, which has been managed by Edinburgh World Heritage since 1999.", "coordx": 195, "coordy": 103, "condition":[9], "buildingid":[5], "image":"CITY4.png"}, 
    {"id":5, "name":"German Empire", "description":"The German Empire  was the historical German nation state that existed from the unification of Germany in 1871 to the abdication of Kaiser Wilhelm II in November 1918, when Germany became a federal republic. The German Empire consisted of 26 constituent territories, with most being ruled by royal families. This included four kingdoms, six grand duchies, five duchies , seven principalities, three free Hanseatic cities, and one imperial territory. Although the Kingdom of Prussia contained most of the Empire's population and territory, it played a lesser role. As Dwyer  points out, Prussia's \"political and cultural influence had diminished considerably\" by the 1890s. After 1850, the states of Germany had rapidly become industrialized, with particular strengths in coal, iron , chemicals, and railways. In 1871 it had a population of 41 million people, and by 1913 this had increased to 68 million. A heavily rural collection of states in 1815, the united Germany became predominantly urban. During its 47 years of existence, the German Empire operated as an industrial, technological, and scientific giant, gaining more Nobel Prizes in science than any other country. Germany became a great power, boasting a rapidly growing rail network, the world's strongest army, and a fast-growing industrial base. In less than a decade, its navy became second only to Britain's Royal Navy. When the great crisis of 1914 arrived, the German Empire had only one ally – Austria-Hungary. They were later joined by the Ottoman Empire and Bulgaria to form the Central Powers or Quadruple Alliance. In the First World War, German plans to capture Paris quickly in autumn 1914 failed, and the war on the Western Front became a stalemate. The Allied naval blockade caused severe shortages of food. Germany was repeatedly forced to send troops to bolster Austria and Turkey on other fronts. However, Germany had great success on the Eastern Front; it occupied large Eastern territories following the Treaty of Brest-Litovsk. German declaration of unrestricted submarine warfare in early 1917 was designed to strangle the British; it failed, because of the use of a trans-Atlantic convoy system. But the declaration—along with the Zimmermann Telegram—did bring the United States into the war. Meanwhile, German civilians and soldiers had become war-weary and radicalised by the Russian Revolution. The high command under Paul von Hindenburg and Erich Ludendorff increasingly controlled the country, as they gambled on one last offensive in spring 1918 before the Americans could arrive in force, using large numbers of troops, aeroplanes and artillery withdrawn from the Eastern Front. This failed, and by October the armies were in retreat, the Austro-Hungarian Empire and the Ottoman Empire had collapsed, and the German people had lost faith in their political system. The Empire collapsed in the November 1918 Revolution as the Emperor and all the ruling monarchs abdicated, and a republic took over.", "coordx": 219, "coordy": 111, "condition":[13], "buildingid":[6], "image":"CITY5.png"}, 
    {"id":6, "name":"Zürich", "description":"Zürich or Zurich  is the largest city in Switzerland and the capital of the canton of Zürich. It is located in north-central Switzerland at the northwestern tip of Lake Zürich. The municipality has approximately 400,028 inhabitants, the urban agglomeration 1.315 million, and the Zurich metropolitan area 1.83 million. Zürich is a hub for railways, roads, and air traffic. Both Zürich Airport and railway station are the largest and busiest in the country. Permanently settled for around 2000 years, Zürich has a history that goes back to its founding by the Romans, who, in 15 BC, called it Turicum. However, early settlements have been found dating back more than 6400 years ago. During the Middle Ages, Zürich gained the independent and privileged status of imperial immediacy and, in 1519, became a primary centre of the Protestant Reformation in Europe under the leadership of Ulrich Zwingli. The official language of Zürich is  German, but the main spoken language is the local variant of the Alemannic Swiss German dialect. Zürich is a leading global city and among the world's largest financial centres despite having a relatively low population. The city is home to a large number of financial institutions and banking giants. Most of Switzerland's research and development centres are concentrated in Zürich and the low tax rates attract overseas companies to set up their headquarters there. Monocle's 2012 \"Quality of Life Survey\" ranked Zürich first on a list of the top 25 cities in the world \"to make a base within\".According to several surveys from 2006 to 2008, Zürich was named the city with the best quality of life in the world as well as the wealthiest city in Europe. The Economist Intelligence Unit's Global Liveability Ranking sees Zürich rank among the top ten most liveable cities in the world. Many museums and art galleries can be found in the city, including the Swiss National Museum and the Kunsthaus. Schauspielhaus Zürich is one of the most important theatres in the German-speaking world.", "coordx": 212, "coordy": 123, "condition":[16,16,16,16,16,16], "buildingid":[10,10], "image":"CITY6.png"}, 
    {"id":7, "name":"San Francisco, California", "description":"San Francisco , officially the City and County of San Francisco, is the cultural, commercial, and financial center of Northern California and the only consolidated city-county in California. San Francisco encompasses a land area of about 46.9 square miles  on the northern end of the San Francisco Peninsula, which makes it the smallest county in the state. It has a density of about 18,451 people per square mile , making it the most densely settled large city  in the state of California and the second-most densely populated major city in the United States after New York City. San Francisco is the fourth-most populous city in California, after Los Angeles, San Diego, and San Jose, and the 13th-most populous city in the United States—with a Census-estimated 2015 population of 864,816. The city and its surrounding areas are known as the San Francisco Bay Area, and are a part of the larger OMB-designated San Jose-San Francisco-Oakland combined statistical area, the fifth most populous in the nation with an estimated population of 8.7 million. San Francisco  was founded on June 29, 1776, when colonists from Spain established Presidio of San Francisco at the Golden Gate and Mission San Francisco de Asís named for St. Francis of Assisi a few miles away. The California Gold Rush of 1849 brought rapid growth, making it the largest city on the West Coast at the time. San Francisco became a consolidated city-county in 1856.After three-quarters of the city was destroyed by the 1906 earthquake and fire, San Francisco was quickly rebuilt, hosting the Panama-Pacific International Exposition nine years later. In World War II, San Francisco was the port of embarkation for service members shipping out to the Pacific Theater. After the war, the confluence of returning servicemen, massive immigration, liberalizing attitudes, along with the rise of the \"hippie\" counterculture, the Sexual Revolution, the Peace Movement growing from opposition to United States involvement in the Vietnam War, and other factors led to the Summer of Love and the gay rights movement, cementing San Francisco as a center of liberal activism in the United States. Politically, the city votes strongly along liberal Democratic Party lines. A popular tourist destination, San Francisco is known for its cool summers, fog, steep rolling hills, eclectic mix of architecture, and landmarks, including the Golden Gate Bridge, cable cars, the former Alcatraz Federal Penitentiary, Fisherman's Wharf, and its Chinatown district. San Francisco is also the headquarters of five major banking institutions and various other companies such as Levi Strauss & Co., Gap Inc., Salesforce.com, Dropbox, Reddit, Square, Inc., Dolby, Airbnb, Weebly, Pacific Gas and Electric Company, Yelp, Pinterest, Twitter, Uber, Lyft, Mozilla, Wikimedia Foundation, and Craigslist. It has several nicknames, including \"The City by the Bay\", \"Fog City\", \"San Fran\", and \"Frisco\", as well as older ones like \"The City that Knows How\", \"Baghdad by the Bay\", \"The Paris of the West\", or simply \"The City\". As of 2015, San Francisco was ranked high on world livability rankings.", "coordx": 25, "coordy": 141, "condition":[18], "buildingid":[11], "image":"CITY7.png"}, 
    {"id":8, "name":"State of California", "description":"California  is the most populous state in the United States. It is also the third most extensive by area. Los Angeles, in Southern California, is the state's most populous city and the country's second largest after New York City. California also includes the nation's most populous county, Los Angeles County, and the largest county by area, San Bernardino County. Geographically located in the western part of the United States, California is bordered by the other United States states of Oregon to the north, Nevada to the east, and Arizona to the southeast. California shares an international border with the Mexican state of Baja California to the south and the Pacific Ocean is on the state's western coastline. The state capital is Sacramento, which is located in the northern part of the state. A majority of California's cities are located in either the San Francisco Bay Area or the Sacramento metropolitan area in Northern California; or the Los Angeles area, the Riverside-San Bernardino-Inland Empire, or the San Diego metropolitan area in Southern California. What is now California was first settled by various Native American tribes before being explored by a number of European expeditions during the 16th and 17th centuries. It was then claimed by the Spanish Empire as part of Alta California in the larger territory of New Spain. Alta California became a part of Mexico in 1821 following its successful war for independence, but was ceded to the United States in 1848 after the Mexican–American War. The western portion of Alta California was organized as the State of California, which was admitted as the 31st state on September 9, 1850. The California Gold Rush starting in 1848 led to dramatic social and demographic changes, with large-scale immigration from the east and abroad with an accompanying economic boom. California's diverse geography ranges from the Sierra Nevada in the east to the Pacific Coast in the west, from the redwood–Douglas fir forests of the northwest, to the Mojave Desert areas in the southeast. The center of the state is dominated by the Central Valley, a major agricultural area. California contains both the highest point  and the lowest point  in the contiguous United States. Earthquakes are common because of the state's location along the Pacific Ring of Fire. About 37,000 earthquakes are recorded each year, but most are too small to be felt. California is regarded as a global trendsetter in both popular culture and politics, and is the birthplace of the film industry, the hippie counterculture, the Internet, and the personal computer. The state's economy is centered on finance, government, real estate services, technology, and professional, scientific and technical business services; together comprising 58% of the state's economy. Three of the world's largest 20 firms by revenue, Chevron, Apple, and McKesson, are headquartered in the state. Although only 1.5% of the state's economy, California's agriculture industry has the highest output of any United States state. If it were a country, California would be the 6th largest economy in the world and the 35th most populous.", "coordx": 30, "coordy": 146, "condition":[19], "buildingid":[12], "image":"CITY8.png"}, 
    {"id":9, "name":"New York City", "description":"The City of New York, often called New York City, New York, or simply The City, is the most populous city in the United States. Located at the southern tip of the state of New York, the city is the center of the New York metropolitan area, one of the most populous urban agglomerations in the world. With a U.S. Census Bureau-estimated 2015 population of 8,550,405 distributed over a land area of just 305 square miles , New York is also the most densely populated major city in the United States. A global power city, New York City exerts a significant impact upon commerce, finance, media, art, fashion, research, technology, education, and entertainment, its fast pace defining the term New York minute. Home to the headquarters of the United Nations, New York is an important center for international diplomacy and has been described as the cultural and financial capital of the world. Situated on one of the world's largest natural harbors, New York City consists of five boroughs, each of which is a separate county of New York State. The five boroughs – Brooklyn, Queens, Manhattan, The Bronx, and Staten Island – were consolidated into a single city in 1898. The city and its metropolitan area constitute the premier gateway for legal immigration to the United States, and as many as 800 languages are spoken in New York, making it the most linguistically diverse city in the world. By 2015 estimates, the New York City metropolitan region remains by a significant margin the most populous in the United States, as defined by both the Metropolitan Statistical Area  and the Combined Statistical Area . In 2013, the MSA produced a gross metropolitan product  of nearly US$1.39 trillion, while in 2012, the CSA generated a GMP of over US$1.55 trillion, both ranking first nationally by a wide margin and behind the GDP of only twelve and eleven countries, respectively. New York City traces its origin to its 1624 founding in Lower Manhattan as a trading post by colonists of the Dutch Republic and was named New Amsterdam in 1626. The city and its surroundings came under English control in 1664 and were renamed New York after King Charles II of England granted the lands to his brother, the Duke of York. New York served as the capital of the United States from 1785 until 1790. It has been the country's largest city since 1790. The Statue of Liberty greeted millions of immigrants as they came to the Americas by ship in the late 19th and early 20th centuries and is a symbol of the United States and its democracy. In the 21st century, New York has emerged as a global node of creativity and entrepreneurship, social tolerance, and environmental sustainability. Many districts and landmarks in New York City have become well known, and the city received a record of nearly 60 million tourists in 2015, hosting three of the world's ten most visited tourist attractions in 2013. Several sources have ranked New York the most photographed city in the world. Times Square, iconic as the world's \"heart\" and its \"Crossroads\", is the brightly illuminated hub of the Broadway Theater District, one of the world's busiest pedestrian intersections, and a major center of the world's entertainment industry. The names of many of the city's bridges, tapered skyscrapers, and parks are known around the world. Anchored by Wall Street in the Financial District of Lower Manhattan, New York City has been called both the most economically powerful city and the leading financial center of the world, and the city is home to the world's two largest stock exchanges by total market capitalization, the New York Stock Exchange and NASDAQ. Manhattan's real estate market is among the most expensive in the world. Manhattan's Chinatown incorporates the highest concentration of Chinese people in the Western Hemisphere, with multiple signature Chinatowns developing across the city. Providing continuous 24/7 service, the New York City Subway is one of the most extensive metro systems worldwide, with 469 stations in operation. New York City's higher education network comprises over 120 colleges and universities, including Columbia University, New York University, and Rockefeller University, which have been ranked among the top 35 in the world.", "coordx": 94, "coordy": 136, "condition":[20,33,33], "buildingid":[9,17], "image":"CITY9.png"}, 
    {"id":10, "name":"White House", "description":"The White House is the official residence and principal workplace of the President of the United States, located at 1600 Pennsylvania Avenue NW in Washington, D.C. It has been the residence of every U.S. president since John Adams in 1800. The term White House is often used to refer to actions of the president and his advisers, as in \"The White House announced that...\". The house was designed by Irish-born James Hoban and built between 1792 and 1800 of white-painted Aquia Creek sandstone in the Neoclassical style. When Thomas Jefferson moved into the house in 1801, he  added low colonnades on each wing that concealed stables and storage. In 1814, during the War of 1812, the mansion was set ablaze by the British Army in the Burning of Washington, destroying the interior and charring much of the exterior. Reconstruction began almost immediately, and President James Monroe moved into the partially reconstructed Executive Residence in October 1817. Construction continued with the addition of the semi-circular South portico in 1824 and the North portico in 1829. Because of crowding within the executive mansion itself, President Theodore Roosevelt had all work offices relocated to the newly constructed West Wing in 1901. Eight years later, President William Howard Taft expanded the West Wing and created the first Oval Office which was eventually moved as the section was expanded. In the main mansion, the third-floor attic was converted to living quarters in 1927 by augmenting the existing hip roof with long shed dormers. A newly constructed East Wing was used as a reception area for social events; Jefferson's colonnades connected the new wings. East Wing alterations were completed in 1946, creating additional office space. By 1948, the house's load-bearing exterior walls and internal wood beams were found to be close to failure. Under Harry S. Truman, the interior rooms were completely dismantled and a new internal load-bearing steel frame constructed inside the walls. Once this work was completed, the interior rooms were rebuilt. The modern-day White House complex includes the Executive Residence, West Wing, East Wing, the Eisenhower Executive Office Building—the former State Department, which now houses offices for the President's staff and the Vice President—and Blair House, a guest residence. The Executive Residence is made up of six stories—the Ground Floor, State Floor, Second Floor, and Third Floor, as well as a two-story basement. The property is a National Heritage Site owned by the National Park Service and is part of the President's Park. In 2007, it was ranked second on the American Institute of Architects list of \"America's Favorite Architecture\".", "coordx": 90, "coordy": 139, "condition":[23,23,23,23,23,23], "buildingid":[15,15], "image":"CITY10.png"}, 
    {"id":11, "name":"District of Columbia", "description":"Washington, D.C., formally the District of Columbia and commonly referred to as \"Washington\", \"the District\", or simply \"D.C.\", is the capital of the United States. The signing of the Residence Act on July 16, 1790, approved the creation of a capital district located along the Potomac River on the country's East Coast. The U.S. Constitution provided for a federal district under the exclusive jurisdiction of the Congress and the District is therefore not a part of any state. The states of Maryland and Virginia each donated land to form the federal district, which included the pre-existing settlements of Georgetown and Alexandria. Named in honor of President George Washington, the City of Washington was founded in 1791 to serve as the new national capital. In 1846, Congress returned the land originally ceded by Virginia; in 1871, it created a single municipal government for the remaining portion of the District. Washington had an estimated population of 672,228 as of July 2015. Commuters from the surrounding Maryland and Virginia suburbs raise the city's population to more than one million during the workweek. The Washington metropolitan area, of which the District is a part, has a population of over 6 million, the sixth-largest metropolitan statistical area in the country. The centers of all three branches of the federal government of the United States are in the District, including the Congress, President, and Supreme Court. Washington is home to many national monuments and museums, which are primarily situated on or around the National Mall. The city hosts 176 foreign embassies as well as the headquarters of many international organizations, trade unions, non-profit organizations, lobbying groups, and professional associations. A locally elected mayor and a 13?member council have governed the District since 1973. However, the Congress maintains supreme authority over the city and may overturn local laws. D.C. residents elect a non-voting, at-large congressional delegate to the House of Representatives, but the District has no representation in the Senate. The District receives three electoral votes in presidential elections as permitted by the Twenty-third Amendment to the United States Constitution, ratified in 1961.", "coordx": 90, "coordy": 139, "condition":[26], "buildingid":[16], "image":"CITY11.png"}, 
    {"id":12, "name":"County Kilkenny", "description":"County Kilkenny  is a county in Ireland. It is in the province of Leinster and is part of the South-East Region. It is named after the city of Kilkenny. The county was based on the historic Gaelic kingdom of Ossory , which is also the basis of the Diocese of Ossory. Kilkenny County Council is the local authority for the county. According to the 2011 census the population of the county is 95,419.", "coordx": 189, "coordy": 111, "condition":[25,25], "buildingid":[13], "image":"CITY12.png"}, 
    {"id":13, "name":"Ohio State Buckeyes football", "description":"The Ohio State Buckeyes football team is a college football team that competes as part of the National Collegiate Athletic Association  Division I Football Bowl Subdivision, representing Ohio State University in the East Division of the Big Ten Conference. Ohio State has played their home games at Ohio Stadium in Columbus, Ohio since 1922. The Buckeyes are recognized by the university and NCAA as having won eight national championships along with 37 conference championships , four division championships, 10 undefeated seasons, and six perfect seasons of having no losses or ties. Football was introduced to the university by George Cole and Alexander S. Lilley in 1890. Ohio State was a football independent from 1890 to 1901 before joining the Ohio Athletic Conference  as a charter member in 1902. The Buckeyes won two conference championships while members of the OAC and in 1912 became members of the Big Ten Conference. Ohio State won their first national championship in 1942 under head coach Paul Brown. Following World War II, Ohio State saw sparse success on the football field with three separate coaches and in 1951 hired Woody Hayes to coach the team. Under Hayes, Ohio State won over 200 total games, 13 Big Ten championships and five national championships , and had four Rose Bowl wins in eight appearances. Following Hayes' dismissal in 1978, Earle Bruce and later John Cooper coached the team to a combined seven conference championships between them. Jim Tressel was hired as head coach in 2001 and led Ohio State to its seventh national championship in 2002 with a win in the Fiesta Bowl. Ohio State won seven Big Ten championships under Tressel and appeared in eight Bowl Championship Series  games, winning five of them. On November 28, 2011, two-time National Championship winning coach and Ohio native Urban Meyer became head coach. Meyer led his team to four Division Championships in his first four seasons, as well as a school record 24 straight victories, beginning with a perfect 12–0 in 2012. He led OSU to both the Big Ten and National Championships in the 2014 season, giving Meyer his third national title overall and first at OSU.", "coordx": 81, "coordy": 137, "condition":[27,30], "buildingid":[14,19], "image":"CITY13.png"}, 
    {"id":14, "name":"Morecambe", "description":"Morecambe /?m??k?m/ is a town on Morecambe Bay in Lancashire, England, which had a population of 34,768 at the 2011 Census.", "coordx": 195, "coordy": 108, "condition":[32], "buildingid":[20], "image":"CITY14.png"}, 
    {"id":15, "name":"Everton", "description":"Everton is a district in Liverpool, in Merseyside, England, and a Liverpool City Council ward. Historically in Lancashire, at the 2001 Census the population was recorded as 7,398, increasing to 14,782 at the 2011 Census.", "coordx": 195, "coordy": 109, "condition":[34], "buildingid":[18], "image":"CITY15.png"}],
    "dialoguenodes":[{"id":100, "dialogueline":"I don't have to speak to you", "eventid":"-1", "dialoguetype": 0, "children": [101,124,127,129,131,133], "condition":[], "option":"", "isroot": true}, 
    {"id":133, "dialogueline":"I am know for subject. category:1838 births", "eventid":"66", "dialoguetype": 0, "children": [], "condition":[65], "option":"Have you seen someone suspicious?", "isroot": false}, 
    {"id":131, "dialogueline":"I am know for almamater. eth zurich", "eventid":"64", "dialoguetype": 0, "children": [], "condition":[63], "option":"Have you seen someone suspicious?", "isroot": false}, 
    {"id":129, "dialogueline":"I am know for birthplace. lucknow, india", "eventid":"62", "dialoguetype": 0, "children": [], "condition":[61], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
    {"id":127, "dialogueline":"I am know for field. unknown", "eventid":"60", "dialoguetype": 0, "children": [], "condition":[59], "option":"Is there someone you suspect?", "isroot": false}, 
    {"id":124, "dialogueline":"Martin Lewis Perl is know for subject. category:american chemical engineers", "eventid":"57", "dialoguetype": 0, "children": [], "condition":[-1], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
    {"id":101, "dialogueline":"You'll find nothing.", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
    {"id":93, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [95], "condition":[], "option":"", "isroot": true}, 
    {"id":95, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [96], "condition":[], "option":"<Ask about North West England>", "isroot": false}, 
    {"id":96, "dialogueline":"New York City.", "eventid":"33", "dialoguetype": 0, "children": [], "condition":[], "option":"Where is Henry Brunner?", "isroot": false}, 
    {"id":84, "dialogueline":"I don't have to speak to you", "eventid":"-1", "dialoguetype": 0, "children": [85,102,118,122,135,137,139,141], "condition":[], "option":"", "isroot": true}, 
    {"id":141, "dialogueline":"I am know for subject. category:american physicists", "eventid":"74", "dialoguetype": 0, "children": [], "condition":[73], "option":"Is there someone you suspect?", "isroot": false}, 
    {"id":139, "dialogueline":"I am know for almamater. carnegie mellon university", "eventid":"72", "dialoguetype": 0, "children": [], "condition":[71], "option":"Have you seen someone suspicious?", "isroot": false}, 
    {"id":137, "dialogueline":"I am know for birthplace. lucknow, india", "eventid":"70", "dialoguetype": 0, "children": [], "condition":[69], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
    {"id":135, "dialogueline":"What, field? I don't know anything about that.", "eventid":"68", "dialoguetype": 0, "children": [], "condition":[67], "option":"Is there someone you suspect?", "isroot": false}, 
    {"id":122, "dialogueline":"Martin Lewis Perl is know for almamater. columbia university", "eventid":"55", "dialoguetype": 0, "children": [], "condition":[-1], "option":"Is there someone you suspect?", "isroot": false}, 
    {"id":118, "dialogueline":"Martin Lewis Perl has for field", "eventid":"51", "dialoguetype": 0, "children": [], "condition":[-1], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
    {"id":102, "dialogueline":"Christian Ludwig Gerling has for field", "eventid":"35", "dialoguetype": 0, "children": [], "condition":[-1], "option":"Have you seen someone suspicious?", "isroot": false}, 
    {"id":85, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
    {"id":74, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [75], "condition":[], "option":"", "isroot": true}, 
    {"id":75, "dialogueline":"Go away", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"I'm looking for Prabhakar Misra?...", "isroot": false}, 
    {"id":62, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [77,80,138], "condition":[], "option":"I have some more questions.", "isroot": true}, 
    {"id":138, "dialogueline":"Prabhakar Misra is know for almamater. carnegie mellon university", "eventid":"71", "dialoguetype": 0, "children": [], "condition":[26], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
    {"id":80, "dialogueline":"Stop asking me this!", "eventid":"-1", "dialoguetype": 3, "children": [62], "condition":[], "option":"What can you tell me about yourself?", "isroot": false}, 
    {"id":77, "dialogueline":"Hi", "eventid":"-1", "dialoguetype": 0, "children": [78], "condition":[], "option":"<Ask about District of Columbia>", "isroot": false}, 
    {"id":78, "dialogueline":"The name is familiar. Try searching in Forest", "eventid":"-1", "dialoguetype": 0, "children": [79], "condition":[], "option":"I hear you know Prabhakar Misra?", "isroot": false}, 
    {"id":79, "dialogueline":"Have you tried District of Columbia", "eventid":"26", "dialoguetype": 0, "children": [], "condition":[], "option":"Where is Forest?", "isroot": false}, 
    {"id":76, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [81], "condition":[], "option":"", "isroot": true}, 
    {"id":81, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [82], "condition":[], "option":"<Ask about Prabhakar Misra>", "isroot": false}, 
    {"id":82, "dialogueline":"Try asking Prabhakar Misra", "eventid":"-1", "dialoguetype": 0, "children": [83], "condition":[], "option":"Where is Prabhakar Misra?", "isroot": false}, 
    {"id":83, "dialogueline":"In Ohio State Buckeyes football", "eventid":"27", "dialoguetype": 0, "children": [], "condition":[], "option":"Where can I find Prabhakar Misra?", "isroot": false}, 
    {"id":65, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [70], "condition":[], "option":"", "isroot": true}, 
    {"id":70, "dialogueline":"May I help?", "eventid":"-1", "dialoguetype": 0, "children": [71], "condition":[], "option":"<Ask about James Hoban>", "isroot": false}, 
    {"id":71, "dialogueline":"Don't know. Ask James Hoban", "eventid":"-1", "dialoguetype": 0, "children": [72], "condition":[], "option":"Can you tell me where to find Prabhakar Misra?", "isroot": false}, 
    {"id":72, "dialogueline":"Go to County Kilkenny", "eventid":"25", "dialoguetype": 0, "children": [], "condition":[], "option":"Where is James Hoban?", "isroot": false}, 
    {"id":94, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [97], "condition":[], "option":"", "isroot": true}, 
    {"id":97, "dialogueline":"May I help?", "eventid":"-1", "dialoguetype": 0, "children": [98], "condition":[], "option":"<Ask about Henry Brunner>", "isroot": false}, 
    {"id":98, "dialogueline":"No, but try asking Henry Brunner.", "eventid":"-1", "dialoguetype": 0, "children": [99], "condition":[], "option":"Did you see Henry Brunner?", "isroot": false}, 
    {"id":99, "dialogueline":"Have you tried Everton?", "eventid":"34", "dialoguetype": 0, "children": [], "condition":[], "option":"Where should I go?", "isroot": false}, 
    {"id":59, "dialogueline":"You can't prove anything!", "eventid":"-1", "dialoguetype": 0, "children": [60,114,116,119,121,123,125,140], "condition":[], "option":"", "isroot": true}, 
    {"id":140, "dialogueline":"Prabhakar Misra is know for subject. category:american physicists", "eventid":"73", "dialoguetype": 0, "children": [], "condition":[-1], "option":"Have you seen someone suspicious?", "isroot": false}, 
    {"id":125, "dialogueline":"I am know for subject. category:american chemical engineers", "eventid":"58", "dialoguetype": 0, "children": [], "condition":[57], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
    {"id":123, "dialogueline":"I am know for almamater. columbia university", "eventid":"56", "dialoguetype": 0, "children": [], "condition":[55], "option":"Have you seen someone suspicious?", "isroot": false}, 
    {"id":121, "dialogueline":"I am know for birthplace. new york city", "eventid":"54", "dialoguetype": 0, "children": [], "condition":[53], "option":"Have you seen someone suspicious?", "isroot": false}, 
    {"id":119, "dialogueline":"What, field? I don't know anything about that.", "eventid":"52", "dialoguetype": 0, "children": [], "condition":[51], "option":"Have you seen someone suspicious?", "isroot": false}, 
    {"id":116, "dialogueline":"Hubertus Strughold is know for subject. category:1898 births", "eventid":"49", "dialoguetype": 0, "children": [], "condition":[-1], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
    {"id":114, "dialogueline":"Hubertus Strughold is know for almamater. university of würzburg", "eventid":"47", "dialoguetype": 0, "children": [], "condition":[-1], "option":"Is there someone you suspect?", "isroot": false}, 
    {"id":60, "dialogueline":"Fine.", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
    {"id":52, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [56], "condition":[], "option":"", "isroot": true}, 
    {"id":56, "dialogueline":"Hi", "eventid":"-1", "dialoguetype": 0, "children": [57], "condition":[], "option":"<Ask about Martin Lewis Perl>", "isroot": false}, 
    {"id":57, "dialogueline":"Try talking to Martin Lewis Perl", "eventid":"-1", "dialoguetype": 0, "children": [58], "condition":[], "option":"Can you tell me where to find Martin Lewis Perl?", "isroot": false}, 
    {"id":58, "dialogueline":"New York City.", "eventid":"20", "dialoguetype": 0, "children": [], "condition":[], "option":"Where is Martin Lewis Perl?", "isroot": false}, 
    {"id":48, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [53], "condition":[], "option":"", "isroot": true}, 
    {"id":53, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [54], "condition":[], "option":"<Ask about State of California>", "isroot": false}, 
    {"id":54, "dialogueline":"No, but I think I saw something in School", "eventid":"-1", "dialoguetype": 0, "children": [55], "condition":[], "option":"Can you point me towards Martin Lewis Perl?", "isroot": false}, 
    {"id":55, "dialogueline":"Have you tried State of California", "eventid":"19", "dialoguetype": 0, "children": [], "condition":[], "option":"Where is School?", "isroot": false}, 
    {"id":43, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [49], "condition":[], "option":"", "isroot": true}, 
    {"id":49, "dialogueline":"May I help?", "eventid":"-1", "dialoguetype": 0, "children": [50], "condition":[], "option":"<Ask about San Francisco, California>", "isroot": false}, 
    {"id":50, "dialogueline":"The name is familiar. Try searching in Police Station", "eventid":"-1", "dialoguetype": 0, "children": [51], "condition":[], "option":"Can you point me towards Martin Lewis Perl?", "isroot": false}, 
    {"id":51, "dialogueline":"Maybe you can find it in San Francisco, California", "eventid":"18", "dialoguetype": 0, "children": [], "condition":[], "option":"Which is where?", "isroot": false}, 
    {"id":38, "dialogueline":"I want my lawyer", "eventid":"-1", "dialoguetype": 0, "children": [39,104,111,113,115,117], "condition":[], "option":"", "isroot": true}, 
    {"id":117, "dialogueline":"I am know for subject. category:1898 births", "eventid":"50", "dialoguetype": 0, "children": [], "condition":[49], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
    {"id":115, "dialogueline":"I am know for almamater. university of würzburg", "eventid":"48", "dialoguetype": 0, "children": [], "condition":[47], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
    {"id":113, "dialogueline":"I am know for birthplace. hamm", "eventid":"46", "dialoguetype": 0, "children": [], "condition":[45], "option":"Is there someone you suspect?", "isroot": false}, 
    {"id":111, "dialogueline":"What, field? I don't know anything about that.", "eventid":"44", "dialoguetype": 0, "children": [], "condition":[43], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
    {"id":104, "dialogueline":"Christian Ludwig Gerling is know for birthplace. hamburg", "eventid":"37", "dialoguetype": 0, "children": [], "condition":[-1], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
    {"id":39, "dialogueline":"You'll find nothing.", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
    {"id":25, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [33,36,37], "condition":[], "option":"I have some more questions.", "isroot": true}, 
    {"id":37, "dialogueline":"You are asking a lot of questions...I don't like this.", "eventid":"-1", "dialoguetype": 3, "children": [25], "condition":[], "option":"You seem familiar, remind me why?", "isroot": false}, 
    {"id":36, "dialogueline":"That is none of your business.", "eventid":"-1", "dialoguetype": 2, "children": [25], "condition":[], "option":"Where do you live? It might provide clues.", "isroot": false}, 
    {"id":33, "dialogueline":"Hi", "eventid":"-1", "dialoguetype": 0, "children": [34], "condition":[], "option":"<Ask about Aesthetics>", "isroot": false}, 
    {"id":34, "dialogueline":"No, but I think I saw something in Police Station", "eventid":"-1", "dialoguetype": 0, "children": [35], "condition":[], "option":"I'm looking for Hubertus Strughold.", "isroot": false}, 
    {"id":35, "dialogueline":"In Freie und Hansestadt Hamburg", "eventid":"11", "dialoguetype": 0, "children": [], "condition":[], "option":"Where can I find Police Station?", "isroot": false}, 
    {"id":22, "dialogueline":"You can't prove anything!", "eventid":"-1", "dialoguetype": 0, "children": [23,103,105,107,109,110,130], "condition":[], "option":"", "isroot": true}, 
    {"id":130, "dialogueline":"Henry Brunner is know for almamater. eth zurich", "eventid":"63", "dialoguetype": 0, "children": [], "condition":[-1], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
    {"id":110, "dialogueline":"Hubertus Strughold has for field", "eventid":"43", "dialoguetype": 0, "children": [], "condition":[-1], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
    {"id":109, "dialogueline":"I am know for subject. category:university of göttingen alumni", "eventid":"42", "dialoguetype": 0, "children": [], "condition":[41], "option":"Have you seen someone suspicious?", "isroot": false}, 
    {"id":107, "dialogueline":"I am know for almamater. university of göttingen", "eventid":"40", "dialoguetype": 0, "children": [], "condition":[39], "option":"Have you seen someone suspicious?", "isroot": false}, 
    {"id":105, "dialogueline":"I am know for birthplace. hamburg", "eventid":"38", "dialoguetype": 0, "children": [], "condition":[37], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
    {"id":103, "dialogueline":"What, field? I don't know anything about that.", "eventid":"36", "dialoguetype": 0, "children": [], "condition":[35], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
    {"id":23, "dialogueline":"You have no proof.", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
    {"id":15, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [16], "condition":[], "option":"", "isroot": true}, 
    {"id":16, "dialogueline":"Get out", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"I'm looking for Christian Ludwig Gerling?...", "isroot": false}, 
    {"id":2, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [17,20,136], "condition":[], "option":"I have some more questions.", "isroot": true}, 
    {"id":136, "dialogueline":"Prabhakar Misra is know for birthplace. lucknow, india", "eventid":"69", "dialoguetype": 0, "children": [], "condition":[6], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
    {"id":20, "dialogueline":"I don't have to answer that.", "eventid":"-1", "dialoguetype": 1, "children": [21], "condition":[], "option":"Where were you born?", "isroot": false}, 
    {"id":21, "dialogueline":"I don't have to answer that.", "eventid":"-1", "dialoguetype": 1, "children": [2], "condition":[], "option":"When were you born?", "isroot": false}, 
    {"id":17, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [18], "condition":[], "option":"<Ask about Christian Ludwig Gerling>", "isroot": false}, 
    {"id":18, "dialogueline":"Try talking to Christian Ludwig Gerling", "eventid":"-1", "dialoguetype": 0, "children": [19], "condition":[], "option":"Where is Christian Ludwig Gerling?", "isroot": false}, 
    {"id":19, "dialogueline":"Maybe you can find him in Freie und Hansestadt Hamburg", "eventid":"6", "dialoguetype": 0, "children": [], "condition":[], "option":"Where can I find Christian Ludwig Gerling?", "isroot": false}, 
    {"id":1, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [9,12,106], "condition":[], "option":"I have some more questions.", "isroot": true}, 
    {"id":106, "dialogueline":"Christian Ludwig Gerling is know for almamater. university of göttingen", "eventid":"39", "dialoguetype": 0, "children": [], "condition":[5], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
    {"id":12, "dialogueline":"This is a silly question, and I will not answer you.", "eventid":"-1", "dialoguetype": 1, "children": [13], "condition":[], "option":"Where were you born?", "isroot": false}, 
    {"id":13, "dialogueline":"Stop questioning me!", "eventid":"-1", "dialoguetype": 1, "children": [1], "condition":[], "option":"When is your birthday?", "isroot": false}, 
    {"id":9, "dialogueline":"May I help?", "eventid":"-1", "dialoguetype": 0, "children": [10], "condition":[], "option":"<Ask about ????? ???????? ???????>", "isroot": false}, 
    {"id":10, "dialogueline":"No, but try asking ????? ???????? ???????.", "eventid":"-1", "dialoguetype": 0, "children": [11], "condition":[], "option":"Did you see Christian Ludwig Gerling?", "isroot": false}, 
    {"id":11, "dialogueline":"Try Göttingen", "eventid":"5", "dialoguetype": 0, "children": [], "condition":[], "option":"Where should I go?", "isroot": false}, 
    {"id":88, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [89], "condition":[], "option":"", "isroot": true}, 
    {"id":89, "dialogueline":"Do really I have to?", "eventid":"28", "dialoguetype": 0, "children": [90], "condition":[], "option":"I'm sorry to disturb, but I have some questions for you.", "isroot": false}, 
    {"id":90, "dialogueline":"Maybe... You can call me Boris.", "eventid":"29", "dialoguetype": 0, "children": [91], "condition":[], "option":"Can you tell me your name?", "isroot": false}, 
    {"id":91, "dialogueline":"I think he went to Ohio State Buckeyes football", "eventid":"30", "dialoguetype": 0, "children": [92], "condition":[], "option":"Is there anything that comes to your mind?", "isroot": false}, 
    {"id":92, "dialogueline":"Yes, Henry_Brunner", "eventid":"31", "dialoguetype": 0, "children": [], "condition":[], "option":"Do you have any hints?", "isroot": false}, 
    {"id":64, "dialogueline":"Detective?", "eventid":"-1", "dialoguetype": 0, "children": [66,134], "condition":[], "option":"", "isroot": true}, 
    {"id":134, "dialogueline":"Prabhakar Misra has for field", "eventid":"67", "dialoguetype": 0, "children": [], "condition":[24], "option":"Is there someone you suspect?", "isroot": false}, 
    {"id":66, "dialogueline":"Yes, anything to help", "eventid":"21", "dialoguetype": 0, "children": [67], "condition":[], "option":"Could you answer some questions for me?", "isroot": false}, 
    {"id":67, "dialogueline":"Yes. My name is Victor Henry Anderson.", "eventid":"22", "dialoguetype": 0, "children": [68], "condition":[], "option":"Who are you?", "isroot": false}, 
    {"id":68, "dialogueline":"he went to White House not long ago.", "eventid":"23", "dialoguetype": 0, "children": [69], "condition":[], "option":"Did the victim mention something to you?", "isroot": false}, 
    {"id":69, "dialogueline":"I think Prabhakar_Misra", "eventid":"24", "dialoguetype": 0, "children": [], "condition":[], "option":"Do you have any hints?", "isroot": false}, 
    {"id":42, "dialogueline":"Hello.", "eventid":"-1", "dialoguetype": 0, "children": [44,108,112,132], "condition":[], "option":"", "isroot": true}, 
    {"id":132, "dialogueline":"Henry Brunner is know for subject. category:1838 births", "eventid":"65", "dialoguetype": 0, "children": [], "condition":[17], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
    {"id":112, "dialogueline":"Hubertus Strughold is know for birthplace. hamm", "eventid":"45", "dialoguetype": 0, "children": [], "condition":[17], "option":"Have you seen someone suspicious?", "isroot": false}, 
    {"id":108, "dialogueline":"Christian Ludwig Gerling is know for subject. category:university of göttingen alumni", "eventid":"41", "dialoguetype": 0, "children": [], "condition":[17], "option":"Is there someone you suspect?", "isroot": false}, 
    {"id":44, "dialogueline":"Sure.", "eventid":"14", "dialoguetype": 0, "children": [45], "condition":[], "option":"Please, would you help answer some questions?", "isroot": false}, 
    {"id":45, "dialogueline":"Maybe... You can call me Emil Otto Hoppé.", "eventid":"15", "dialoguetype": 0, "children": [46], "condition":[], "option":"Who are you?", "isroot": false}, 
    {"id":46, "dialogueline":"Zürich. he liked there.", "eventid":"16", "dialoguetype": 0, "children": [47], "condition":[], "option":"Did the victim mention something to you?", "isroot": false}, 
    {"id":47, "dialogueline":"I think Martin_Lewis_Perl could have done it", "eventid":"17", "dialoguetype": 0, "children": [], "condition":[], "option":"Is there anyone you suspect?", "isroot": false}, 
    {"id":27, "dialogueline":"Oh, it's you, detective.", "eventid":"-1", "dialoguetype": 0, "children": [28], "condition":[], "option":"", "isroot": true}, 
    {"id":28, "dialogueline":"Ok, but please be quick.", "eventid":"7", "dialoguetype": 0, "children": [29], "condition":[], "option":"Please, would you help answer some questions?", "isroot": false}, 
    {"id":29, "dialogueline":"You can call me Jo Davidson.", "eventid":"8", "dialoguetype": 0, "children": [30], "condition":[], "option":"Can you tell me your name?", "isroot": false}, 
    {"id":30, "dialogueline":"he used to visit David Hume", "eventid":"9", "dialoguetype": 0, "children": [31,32], "condition":[], "option":"Did the victim mention something to you?", "isroot": false}, 
    {"id":32, "dialogueline":"Hubertus_Strughold ", "eventid":"10", "dialoguetype": 0, "children": [], "condition":[], "option":"Do you have any hints?", "isroot": false}, 
    {"id":31, "dialogueline":"David Hume used to visit City of Edinburgh", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"Do you know where David Hume is?", "isroot": false}, 
    {"id":4, "dialogueline":"Hello.", "eventid":"-1", "dialoguetype": 0, "children": [5,128], "condition":[], "option":"", "isroot": true}, 
    {"id":128, "dialogueline":"Henry Brunner is know for birthplace. everton, liverpool", "eventid":"61", "dialoguetype": 0, "children": [], "condition":[3], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
    {"id":5, "dialogueline":"Ok.", "eventid":"0", "dialoguetype": 0, "children": [6], "condition":[], "option":"I'm sorry to disturb, but I have some questions for you.", "isroot": false}, 
    {"id":6, "dialogueline":"I guess... My name is Rudolph Nissen.", "eventid":"1", "dialoguetype": 0, "children": [7], "condition":[], "option":"What is your name?", "isroot": false}, 
    {"id":7, "dialogueline":"Göttingen. he used to go there.", "eventid":"2", "dialoguetype": 0, "children": [8], "condition":[], "option":"Is there something you think I should know?", "isroot": false}, 
    {"id":8, "dialogueline":"Christian_Ludwig_Gerling ", "eventid":"3", "dialoguetype": 0, "children": [], "condition":[], "option":"Can you think of someone with reason to do this?", "isroot": false}],
    "crime":{"suspects":[3,8,11,24,18],"culprit":24,"facts":[{"pid":3,"factoid":"Christian Ludwig Gerling has for field","condition":35},{"pid":3,"factoid":"Christian Ludwig Gerling is know for birthplace. hamburg","condition":37},{"pid":3,"factoid":"Christian Ludwig Gerling is know for almamater. university of göttingen","condition":39},{"pid":3,"factoid":"Christian Ludwig Gerling is know for subject. category:university of göttingen alumni","condition":41},{"pid":8,"factoid":"Hubertus Strughold has for field","condition":43},{"pid":8,"factoid":"Hubertus Strughold is know for birthplace. hamm","condition":45},{"pid":8,"factoid":"Hubertus Strughold is know for almamater. university of würzburg","condition":47},{"pid":8,"factoid":"Hubertus Strughold is know for subject. category:1898 births","condition":49},{"pid":11,"factoid":"Martin Lewis Perl has for field","condition":51},{"pid":11,"factoid":"Martin Lewis Perl is know for birthplace. new york city","condition":53},{"pid":11,"factoid":"Martin Lewis Perl is know for almamater. columbia university","condition":55},{"pid":11,"factoid":"Martin Lewis Perl is know for subject. category:american chemical engineers","condition":57},{"pid":24,"factoid":"Henry Brunner has for field","condition":59},{"pid":24,"factoid":"Henry Brunner is know for birthplace. everton, liverpool","condition":61},{"pid":24,"factoid":"Henry Brunner is know for almamater. eth zurich","condition":63},{"pid":24,"factoid":"Henry Brunner is know for subject. category:1838 births","condition":65},{"pid":18,"factoid":"Prabhakar Misra has for field","condition":67},{"pid":18,"factoid":"Prabhakar Misra is know for birthplace. lucknow, india","condition":69},{"pid":18,"factoid":"Prabhakar Misra is know for almamater. carnegie mellon university","condition":71},{"pid":18,"factoid":"Prabhakar Misra is know for subject. category:american physicists","condition":73}]}}
    