<<<<<<< Updated upstream
{
"people" : [
{"id":4, "name":"Heinrich Friedrich Weber", "description":"Heinrich Friedrich Weber  was a physicist born in the town of Magdala, near Weimar.", "drootid": 4, "condition":[], "buildingid":0, "image":"PERSON4.png"}, 
{"id":11, "name":"Alfred Alexander", "description":"Dr.  Alfred Alexander  was the President of the Berlin Association of Doctors during the 1930s.", "drootid": 26, "condition":[], "buildingid":0, "image":"PERSON11.png"}, 
{"id":16, "name":"Khosro Naghed", "description":"Khosro Naghed  is a Persian writer, Iranist and linguist.  He has written numerous books and articles on Iranian culture, Persian history, Persian language and literature and philosophy.", "drootid": 46, "condition":[], "buildingid":0, "image":"PERSON16.png"}, 
{"id":22, "name":"Louis de Broglie", "description":" Louis-Victor-Pierre-Raymond, 7e duc de Broglie  was a French physicist who made groundbreaking contributions to quantum theory.  In his 1924 PhD thesis he postulated the wave nature of electrons and suggested that all matter has wave properties.", "drootid": 60, "condition":[], "buildingid":0, "image":"PERSON22.png"}, 
{"id":28, "name":"Caio", "description":"There is no information available for this character.", "drootid": 85, "condition":[], "buildingid":0, "image":"PERSON28.png"}, 
{"id":1, "name":"Terry Pratchett", "description":"Sir Terence David John \"Terry\" Pratchett, OBE  was an English author of fantasy novels, especially comical works.  He is best known for his Discworld series of 41 novels.", "drootid": 1, "condition":[4], "buildingid":1, "image":"PERSON1.png"}, 
{"id":5, "name":"Albert Einstein", "description":"Albert Einstein  was a German-born theoretical physicist.  He developed the general theory of relativity, one of the two pillars of modern physics .", "drootid": 10, "condition":[4], "buildingid":1, "image":"PERSON5.png"}, 
{"id":2, "name":"University of East Anglia", "description":"The University of East Anglia  is an English public research university located in the city of Norwich.  Established in 1963, the university comprises 4 faculties and 26 schools of study.", "drootid": 2, "condition":[5], "buildingid":2, "image":"PERSON2.png"}, 
{"id":6, "name":"Caio", "description":"There is no information available for this character.", "drootid": 16, "condition":[5], "buildingid":2, "image":"PERSON6.png"}, 
{"id":3, "name":"Enrico Coen", "description":"Enrico Sandro Coen CBE FRS  is a biologist who studies the mechanisms used by plants to create complex and varied flower structures.  Enrico combines molecular, genetic and imaging studies with population and ecological models and computational analysis to understand flower development.", "drootid": 20, "condition":[6], "buildingid":3, "image":"PERSON3.png"}, 
{"id":8, "name":"Thurgood Marshall", "description":"Thurgood Marshall  was an Associate Justice of the Supreme Court of the United States, serving from October 1967 until October 1991.  Marshall was the Court's 96th justice and its first African-American justice.", "drootid": 23, "condition":[9], "buildingid":5, "image":"PERSON8.png"}, 
{"id":9, "name":"Lyndon B. Johnson", "description":".  Lyndon Baines Johnson , often referred to as LBJ, was an American politician who served as the 36th President of the United States from 1963 to 1969, assuming the office after serving as the 37th Vice President of the United States under President John F.", "drootid": 24, "condition":[11], "buildingid":6, "image":"PERSON9.png"}, 
{"id":10, "name":"Beno Gutenberg", "description":"Beno Gutenberg  was a German-American seismologist who made several important contributions to the science.  He was a colleague and mentor of Charles Francis Richter at the California Institute of Technology and Richter's collaborator in developing the Richter magnitude scale for measuring an earthquake's magnitude.", "drootid": 41, "condition":[13], "buildingid":7, "image":"PERSON10.png"}, 
{"id":12, "name":"1921", "description":"1921 was a common year starting on Saturday  of the Gregorian calendar, the 1921st year of the Common Era  and Anno Domini  designations, the 921st year of the 2nd millennium, the 21st year of the 20th century, and the 2nd year of the 1920s decade.", "drootid": 39, "condition":[13], "buildingid":7, "image":"PERSON12.png"}, 
{"id":14, "name":"World War II", "description":" and WWII .  World War II , also known as the Second World War, was a global war that lasted from 1939 to 1945, although related conflicts began earlier.", "drootid": 44, "condition":[19], "buildingid":9, "image":"PERSON14.png"}, 
{"id":15, "name":"Frederick G. Donnan", "description":"Frederick George Donnan CBE FRS FRSE  was an Irish physical chemist who is known for his work on membrane equilibria, and commemorated in the Donnan equilibrium describing ionic transport in cells.  He spent most of his career at University College London.", "drootid": 53, "condition":[20], "buildingid":10, "image":"PERSON15.png"}, 
{"id":18, "name":"Mileva Mari?", "description":"Mileva Mari?  was a Serbian physicist.  She was the only woman among Albert Einstein's fellow students at the Zurich Polytechnic and was the second woman to finish a full program of study at the Department: Mathematics and Physics.", "drootid": 56, "condition":[23], "buildingid":13, "image":"PERSON18.png"}, 
{"id":19, "name":"Nikola Tesla", "description":".  Nikola Tesla  was a Serbian-American inventor, electrical engineer, mechanical engineer, physicist, and futurist best known for his contributions to the design of the modern alternating current  electricity supply system.", "drootid": 57, "condition":[25], "buildingid":14, "image":"PERSON19.png"}, 
{"id":23, "name":"Adam", "description":"There is no information available for this character.", "drootid": 69, "condition":[25], "buildingid":14, "image":"PERSON23.png"}, 
{"id":20, "name":"the United States", "description":", US , USA , and United States .  The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.", "drootid": 58, "condition":[26], "buildingid":15, "image":"PERSON20.png"}, 
{"id":24, "name":"Victor", "description":"There is no information available for this character.", "drootid": 75, "condition":[26], "buildingid":15, "image":"PERSON24.png"}, 
{"id":21, "name":"Paul Kollsman", "description":"Paul Kollsman  was a German-American inventor.  He invented barometers and instruments for instrument flight in airplanes.", "drootid": 80, "condition":[27], "buildingid":16, "image":"PERSON21.png"}, 
{"id":29, "name":"Bruno", "description":"There is no information available for this character.", "drootid": 91, "condition":[32], "buildingid":19, "image":"PERSON29.png"}, 
{"id":30, "name":"John", "description":"There is no information available for this character.", "drootid": 98, "condition":[33], "buildingid":20, "image":"PERSON30.png"}, 
{"id":26, "name":"Hans Albert Einstein", "description":" Hans Albert Einstein  was a Swiss-American engineer and educator, and the second child and first son of Albert Einstein and Mileva Mari?.  He is best known for his research on sediment transport.", "drootid": 83, "condition":[30], "buildingid":17, "image":"PERSON26.png"}, 
{"id":27, "name":"Mildred Allen", "description":"Mildred Allen  was an American physicist.", "drootid": 103, "condition":[34], "buildingid":18, "image":"PERSON27.png"}],
"items":[{"id":4, "name":"Crowbar", "description":"", "condition": [], "eventid": -1, "buildingid":0, "image":"null"}, 
{"id":0, "name":"Nation", "description":"It is a book about Nation. It says: Nation is a novel by Terry Pratchett, published in the UK on 11 September 2008.  It was the first non-Discworld Pratchett novel since Johnny and the Bomb .  The following people are mentioned:  Albert Einstein Terry Pratchett   And the following place: Beaconsfield", "condition": [2], "eventid": 4, "buildingid":4, "image":"null"}, 
{"id":1, "name":"1960", "description":"It is a list about 1960. It says:  1960 was a leap year starting on Friday  of the Gregorian calendar, the 1960th year of the Common Era  and Anno Domini  designations, the 960th year of the 2nd millennium, the 60th year of the 20th century, and the 1st year of the 1960s decade.  It is also known as the \"Year of Africa\" because of major eventsparticularly the independence of seventeen African nationsthat focused global attention on the continent and intensified feelings of Pan-Africanism.  The following people are mentioned:  Beno Gutenberg 1921   And the following place: German Empire", "condition": [12], "eventid": 13, "buildingid":8, "image":"null"}, 
{"id":3, "name":"Neutral powers during World War II", "description":"It is a photograph about Neutral powers during World War II. In a corner, it says:The neutral powers were countries that remained neutral during World War II.  Some of these countries had large colonies abroad or had great economic power.  There are things written behind: World War II   And the following place: Second Happy Time", "condition": [18], "eventid": 19, "buildingid":12, "image":"PHOTO03.png"}, 
{"id":2, "name":"United Nations", "description":"It is a book about United Nations. It says: The Allies of World War II, called the United Nations from the 1 January 1942 declaration, were the countries that together opposed the Axis powers during the Second World War .  The Allies promoted the alliance as seeking to stop German, Japanese and Italian aggression.  The following people are mentioned:  Neutral powers during World War II United Kingdom World War II Attack on Pearl Harbor Luxembourg government-in-exile Presidencies and provinces of British India Red Army  And the following place: Stonewall, Texas", "condition": [16], "eventid": 18, "buildingid":11, "image":"null"}, 
{"id":5, "name":"Key", "description":"", "condition": [], "eventid": -1, "buildingid":18, "image":"null"}],
"buildings":[{"id":0, "name":"House of Albert Einstein", "description":" and Swiss Confederation  Switzerland , officially the Swiss Confederation is a federal republic in Europe", "locktype": "null", "coordx": 239, "coordy": 61, "condition":[], "cityid":0, "peopleid":[4,11,16,22,28], "itemsid":[4], "image":"BUILDING0.png"}, 
{"id":1, "name":"House of Terry Pratchett", "description":"Beaconsfield /?b?k?nzfi?ld/ is a market town and civil parish within the South Bucks district in Buckinghamshire centred 236 miles  WNW of London and 17 miles  SSE of the county's administrative town, Aylesbury", "locktype": "null", "coordx": 59, "coordy": 181, "condition":[4,4], "cityid":1, "peopleid":[1,5], "itemsid":[], "image":"BUILDING1.png"}, 
{"id":2, "name":"House of University of East Anglia", "description":"Dublin  is the capital and largest city of Ireland Dublin is in the province of Leinster on Ireland's east coast, at the mouth of the River Liffey", "locktype": "null", "coordx": 337, "coordy": 208, "condition":[5,5], "cityid":2, "peopleid":[2,6], "itemsid":[], "image":"BUILDING2.png"}, 
{"id":3, "name":"House of Enrico Coen", "description":"Cambridge  is a university city and the county town of Cambridgeshire, England, on the River Cam about 50 miles  north of London At the United Kingdom Census 2011, its population was 123,867, including 24,488 students", "locktype": "null", "coordx": 138, "coordy": 214, "condition":[6], "cityid":3, "peopleid":[3], "itemsid":[], "image":"BUILDING3.png"}, 
{"id":4, "name":"Villa", "description":" There is archaeological evidence of settlement in the area in the Bronze Age and in Roman Britain; under Viking rule, Cambridge became an important trading centre The first town charters were granted in the 12th century, although city status was not conferred until 1951", "locktype": "null", "coordx": 288, "coordy": 294, "condition":[2], "cityid":3, "peopleid":[], "itemsid":[0], "image":"BUILDING4.png"}, 
{"id":5, "name":"House of Thurgood Marshall", "description":"Baltimore  is the largest city in the US", "locktype": "null", "coordx": 307, "coordy": 286, "condition":[9], "cityid":4, "peopleid":[8], "itemsid":[], "image":"BUILDING5.png"}, 
{"id":8, "name":"Hospital", "description":" state of Maryland, and the 29th-most populous city in the country It was established by the Constitution of Maryland and is not part of any county; thus, it is the largest independent city in the United States", "locktype": "null", "coordx": 315, "coordy": 73, "condition":[12], "cityid":4, "peopleid":[], "itemsid":[1], "image":"BUILDING8.png"}, 
{"id":6, "name":"House of Lyndon B. Johnson", "description":"Stonewall is a census-designated place  in Gillespie County, Texas, United States The population was 525 at the 2010 census", "locktype": "null", "coordx": 97, "coordy": 92, "condition":[11], "cityid":5, "peopleid":[9], "itemsid":[], "image":"BUILDING6.png"}, 
{"id":12, "name":"Hospital", "description":" It was named after Thomas J  Jackson, by Israel P", "locktype": "null", "coordx": 234, "coordy": 87, "condition":[18], "cityid":5, "peopleid":[], "itemsid":[3], "image":"BUILDING12.png"}, 
{"id":7, "name":"House of Beno Gutenberg", "description":"The German Empire  was the historical German nation state that existed from the unification of Germany in 1871 to the abdication of Kaiser Wilhelm II in November 1918, when Germany became a federal republic The German Empire consisted of 26 constituent territories, with most being ruled by royal families", "locktype": "null", "coordx": 302, "coordy": 239, "condition":[13,13], "cityid":6, "peopleid":[10,12], "itemsid":[], "image":"BUILDING7.png"}, 
{"id":9, "name":"House of World War II", "description":"The Second Happy Time, also known among German submarine commanders as the American shooting season, was the informal name for a phase in the Battle of the Atlantic during which Axis submarines attacked merchant shipping and Allied naval vessels along the east coast of North America The first \"Happy Time\" was in 194041 in the North Atlantic and North Sea", "locktype": "null", "coordx": 141, "coordy": 253, "condition":[19], "cityid":7, "peopleid":[14], "itemsid":[], "image":"BUILDING9.png"}, 
{"id":11, "name":"School", "description":" The Second Happy Time lasted from January 1942 to about August of that year and involved several German naval operations including Operation Paukenschlag  and Operation Neuland German submariners named it the happy time or the golden time as defense measures were weak and disorganized, and the U-boats were able to inflict massive damage with little risk", "locktype": "chain", "coordx": 81, "coordy": 124, "condition":[16], "cityid":7, "peopleid":[], "itemsid":[2], "image":"BUILDING11.png"}, 
{"id":10, "name":"House of Frederick G. Donnan", "description":"London /?l?nd?n/ is the capital and most populous city of England and the United Kingdom Standing on the River Thames in the south east of the island of Great Britain, London has been a major settlement for two millennia", "locktype": "null", "coordx": 323, "coordy": 272, "condition":[20], "cityid":8, "peopleid":[15], "itemsid":[], "image":"BUILDING10.png"}, 
{"id":13, "name":"House of Mileva Mari?", "description":"Titel  is a town and municipality in the South Ba?ka District of the Vojvodina, Serbia The town of Titel has a population of 5,247, while the population of the municipality of Titel is 15,738", "locktype": "null", "coordx": 150, "coordy": 141, "condition":[23], "cityid":9, "peopleid":[18], "itemsid":[], "image":"BUILDING13.png"}, 
{"id":14, "name":"House of Nikola Tesla", "description":"Smiljan  is a village in the mountainous region of Western Lika in Croatia It is located 6 km  northwest of Gospi?, and fifteen kilometers from the Zagreb-Split highway; its population is 418 ", "locktype": "null", "coordx": 294, "coordy": 137, "condition":[25,25], "cityid":10, "peopleid":[19,23], "itemsid":[], "image":"BUILDING14.png"}, 
{"id":15, "name":"House of the United States", "description":", US , USA , and United States  The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions", "locktype": "null", "coordx": 138, "coordy": 239, "condition":[26,26], "cityid":11, "peopleid":[20,24], "itemsid":[], "image":"BUILDING15.png"}, 
{"id":16, "name":"House of Paul Kollsman", "description":"Germany , officially the Federal Republic of Germany , is a federal parliamentary republic in central-western Europe It includes 16 constituent states, covers an area of 357,021 square kilometres , and has a largely temperate seasonal climate", "locktype": "key", "coordx": 224, "coordy": 255, "condition":[27], "cityid":12, "peopleid":[21], "itemsid":[], "image":"BUILDING16.png"}, 
{"id":19, "name":"Museum", "description":"Massachusetts /?ms??t?u?s?ts/ mass-?-CHOO-sits; officially the Commonwealth of Massachusetts, is the most populous state in the New England region of the northeastern United States It is bordered by the Atlantic Ocean to the east, the states of Connecticut and Rhode Island to the south, New Hampshire and Vermont to the north, and New York to the west", "locktype": "null", "coordx": 117, "coordy": 232, "condition":[32], "cityid":13, "peopleid":[29], "itemsid":[], "image":"BUILDING19.png"}, 
{"id":20, "name":"Stadium", "description":"Holyoke is a city in Hampden County, Massachusetts, United States that lies between the western bank of the Connecticut River and the Mount Tom Range As of 2012, the city had an estimated population of 40,135", "locktype": "null", "coordx": 318, "coordy": 89, "condition":[33], "cityid":14, "peopleid":[30], "itemsid":[], "image":"BUILDING20.png"}, 
{"id":17, "name":"House of Hans Albert Einstein", "description":"The city of Bern  or Berne  is the de facto capital of Switzerland, referred to by the Swiss as their  Bundesstadt, or \"federal city\" With a population of 141,107 , Bern is the fourth most populous city in Switzerland", "locktype": "null", "coordx": 218, "coordy": 108, "condition":[30], "cityid":15, "peopleid":[26], "itemsid":[], "image":"BUILDING17.png"}, 
{"id":18, "name":"House of Mildred Allen", "description":"Sharon is a town in Norfolk County, Massachusetts, United States The population was 17,612 at the 2010 census", "locktype": "null", "coordx": 349, "coordy": 279, "condition":[34], "cityid":16, "peopleid":[27], "itemsid":[5], "image":"BUILDING18.png"}],
"cities":[{"id":0, "name":"Switzerland", "description":" and Swiss Confederation . Switzerland , officially the Swiss Confederation is a federal republic in Europe. While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\" . The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2 . While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zrich and Geneva. The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. The country has a history of armed neutrality going back to the Reformation, it has not been in a state of war internationally since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. In addition to being the birthplace of the Red Cross, Switzerland is home to numerous international organisations, including the second largest UN office. On the European level, it is a founding member of the European Free Trade Association, but notably it is not part of the European Union, nor the European Economic Area. However, the country does participate in the Schengen Area and the EU's single market through a number of bilateral treaties. Spanning the intersection of Germanic and Romance Europe, Switzerland comprises four main linguistic and cultural regions: German, French, Italian and Romansh. Although the majority of the population are German speaking, Swiss national identity is rooted in a common historical background, shared values such as federalism and direct democracy, and Alpine symbolism. Due to its linguistic diversity, Switzerland is known by a variety of native names: Schweiz [??va?ts] ; Suisse [s?is] ; Svizzera [?zvittsera] ; and Svizra [??vi?tsr?] or [??vi?ts???] . On coins and stamps, Latin  is used instead of the four living languages. Switzerland is one of the most developed countries in the world, with the highest nominal wealth per adult and the eighth-highest per capita gross domestic product according to the IMF. Switzerland ranks at or near the top globally in several metrics of national performance, including government transparency, civil liberties, quality of life, economic competitiveness, and human development. Zrich and Geneva have each been ranked among the top cities in the world in terms of quality of life, with the former ranked second globally, according to Mercer.", "coordx": 210, "coordy": 124, "condition":[], "buildingid":[0], "image":"CITY0.png"}, 
{"id":1, "name":"Beaconsfield", "description":"Beaconsfield /?b?k?nzfi?ld/ is a market town and civil parish within the South Bucks district in Buckinghamshire centred 23.6 miles  WNW of London and 17 miles  SSE of the county's administrative town, Aylesbury. Four towns are within five miles: Slough, Amersham, Gerrards Cross and High Wycombe. The town is adjacent to the Chiltern Hills Area of Outstanding Natural Beauty and has a wide area of Georgian, neo-Georgian and Tudor revival high street architecture, known as the Old Town. It is celebrated for the first model village in the world and, in education, a direction and technical production institute, the National Film and Television School.", "coordx": 199, "coordy": 114, "condition":[4,4], "buildingid":[1], "image":"CITY1.png"}, 
{"id":2, "name":"Dublin", "description":"Dublin  is the capital and largest city of Ireland. Dublin is in the province of Leinster on Ireland's east coast, at the mouth of the River Liffey. The city has an urban area population of 1,345,402. The population of the Greater Dublin Area, as of 2016, was 1,904,806 people. Founded as a Viking settlement, the Kingdom of Dublin became Ireland's principal city following the Norman invasion. The city expanded rapidly from the 17th century and was briefly the second largest city in the British Empire before the Acts of Union in 1800. Following the partition of Ireland in 1922, Dublin became the capital of the Irish Free State, later renamed Ireland. Dublin is administered by a City Council. The city is listed by the Globalization and World Cities Research Network  as a global city, with a ranking of \"Alpha-\", placing it among the top thirty cities in the world. It is a historical and contemporary centre for education, the arts, administration, economy and industry.", "coordx": 191, "coordy": 109, "condition":[5,5], "buildingid":[2], "image":"CITY2.png"}, 
{"id":3, "name":"Cambridge", "description":"Cambridge  is a university city and the county town of Cambridgeshire, England, on the River Cam about 50 miles  north of London. At the United Kingdom Census 2011, its population was 123,867, including 24,488 students. There is archaeological evidence of settlement in the area in the Bronze Age and in Roman Britain; under Viking rule, Cambridge became an important trading centre. The first town charters were granted in the 12th century, although city status was not conferred until 1951. The skyline is dominated by the last two buildings, along with the spire of the Our Lady and the English Martyrs Church, the chimney of Addenbrooke's Hospital and St John's College Chapel tower. The University of Cambridge, founded in 1209 is one of the top five universities in the world. The university includes the Cavendish Laboratory, King's College Chapel, and the Cambridge University Library. Anglia Ruskin University, formed from the Cambridge School of Art and the Cambridgeshire College of Arts and Technology, also has a campus in the city. Cambridge is at the heart of the high-technology Silicon Fen with industries such as software and bioscience and many start-up companies spun out of the university. More than 40% of the workforce has a higher education qualification, more than twice the national average. The Cambridge Biomedical Campus, one of the largest biomedical research clusters in the world, is soon to be home to AstraZeneca, a hotel and the relocated Papworth Hospital. Parker's Piece hosted the first ever game of Association football. The Strawberry Fair music and arts festival and Midsummer Fairs are held on Midsummer Common, and the annual Cambridge Beer Festival takes place on Jesus Green. The city is adjacent to the M11 and A14 roads, and Cambridge station is less than an hour from London King's Cross railway station.", "coordx": 200, "coordy": 112, "condition":[6,2], "buildingid":[3,4], "image":"CITY3.png"}, 
{"id":4, "name":"Baltimore, Maryland", "description":"Baltimore  is the largest city in the U.S. state of Maryland, and the 29th-most populous city in the country. It was established by the Constitution of Maryland and is not part of any county; thus, it is the largest independent city in the United States. Baltimore has more public monuments per capita than any other city in the country and is home to some of the earliest National Register historic districts in the nation, including Fell's Point , Federal Hill  and Mount Vernon Place . More than 65,000 properties, or roughly one in three buildings in the city, are listed on the National Register, more than any other city in the nation. Founded in 1729, Baltimore is the second largest seaport in the Mid-Atlantic. Baltimore's Inner Harbor was once the second leading port of entry for immigrants to the United States and a major manufacturing center. After a decline in major manufacturing, industrialization and rail transportation, Baltimore shifted to a service-oriented economy, with the Johns Hopkins Hospital , and Johns Hopkins University , now the city's top two employers. Baltimore had a population of 621,849 in 2015; in 2010, that of Baltimore Metropolitan Area was 2.7 million, the 21st largest in the country. With hundreds of identified districts, Baltimore has been dubbed \"a city of neighborhoods\". Famous residents have included the writers Edgar Allan Poe, Edith Hamilton, Frederick Douglass, and H.L. Mencken; jazz musician James \"Eubie\" Blake; singer Billie Holiday; actor and filmmaker John Waters; and baseball player Babe Ruth. In the War of 1812, Francis Scott Key wrote The Star-Spangled Banner, later the American national anthem, in the city.", "coordx": 91, "coordy": 139, "condition":[9,12], "buildingid":[5,8], "image":"CITY4.png"}, 
{"id":5, "name":"Stonewall, Texas", "description":"Stonewall is a census-designated place  in Gillespie County, Texas, United States. The population was 525 at the 2010 census. It was named after Thomas J.  Jackson, by Israel P. Nunez, who established a stage station near the site in 1870. Stonewall is the birthplace and deathplace of former U.S. President Lyndon B. Johnson, and his LBJ Ranch  is located nearby.", "coordx": 59, "coordy": 154, "condition":[11,18], "buildingid":[6,12], "image":"CITY5.png"}, 
{"id":6, "name":"German Empire", "description":"The German Empire  was the historical German nation state that existed from the unification of Germany in 1871 to the abdication of Kaiser Wilhelm II in November 1918, when Germany became a federal republic. The German Empire consisted of 26 constituent territories, with most being ruled by royal families. This included four kingdoms, six grand duchies, five duchies , seven principalities, three free Hanseatic cities, and one imperial territory. Although the Kingdom of Prussia contained most of the Empire's population and territory, it played a lesser role. As Dwyer  points out, Prussia's \"political and cultural influence had diminished considerably\" by the 1890s. After 1850, the states of Germany had rapidly become industrialized, with particular strengths in coal, iron , chemicals, and railways. In 1871 it had a population of 41 million people, and by 1913 this had increased to 68 million. A heavily rural collection of states in 1815, the united Germany became predominantly urban. During its 47 years of existence, the German Empire operated as an industrial, technological, and scientific giant, gaining more Nobel Prizes in science than any other country. Germany became a great power, boasting a rapidly growing rail network, the world's strongest army, and a fast-growing industrial base. In less than a decade, its navy became second only to Britain's Royal Navy. When the great crisis of 1914 arrived, the German Empire had only one ally  Austria-Hungary. They were later joined by the Ottoman Empire and Bulgaria to form the Central Powers or Quadruple Alliance. In the First World War, German plans to capture Paris quickly in autumn 1914 failed, and the war on the Western Front became a stalemate. The Allied naval blockade caused severe shortages of food. Germany was repeatedly forced to send troops to bolster Austria and Turkey on other fronts. However, Germany had great success on the Eastern Front; it occupied large Eastern territories following the Treaty of Brest-Litovsk. German declaration of unrestricted submarine warfare in early 1917 was designed to strangle the British; it failed, because of the use of a trans-Atlantic convoy system. But the declarationalong with the Zimmermann Telegramdid bring the United States into the war. Meanwhile, German civilians and soldiers had become war-weary and radicalised by the Russian Revolution. The high command under Paul von Hindenburg and Erich Ludendorff increasingly controlled the country, as they gambled on one last offensive in spring 1918 before the Americans could arrive in force, using large numbers of troops, aeroplanes and artillery withdrawn from the Eastern Front. This failed, and by October the armies were in retreat, the Austro-Hungarian Empire and the Ottoman Empire had collapsed, and the German people had lost faith in their political system. The Empire collapsed in the November 1918 Revolution as the Emperor and all the ruling monarchs abdicated, and a republic took over.", "coordx": 219, "coordy": 111, "condition":[13,13], "buildingid":[7], "image":"CITY6.png"}, 
{"id":7, "name":"Second Happy Time", "description":"The Second Happy Time, also known among German submarine commanders as the American shooting season, was the informal name for a phase in the Battle of the Atlantic during which Axis submarines attacked merchant shipping and Allied naval vessels along the east coast of North America. The first \"Happy Time\" was in 194041 in the North Atlantic and North Sea. The Second Happy Time lasted from January 1942 to about August of that year and involved several German naval operations including Operation Paukenschlag  and Operation Neuland. German submariners named it the happy time or the golden time as defense measures were weak and disorganized, and the U-boats were able to inflict massive damage with little risk. During this period, Axis submarines sank 609 ships totaling 3.1 million tons and the loss of thousands of lives, mainly those of merchant mariners, against a loss of only 22 U-boats. Although less than losses during the 1917 campaign of the First World War, it was roughly one quarter of all shipping sunk by U-boats during the entire Second World War. Historian Michael Gannon called it \"America's Second Pearl Harbor\" and placed the blame for the nation's failure to respond quickly to the attacks on the inaction of Admiral Ernest J. King, commander-in-chief of the U.S. fleet. Others however have pointed out that the belated institution of a convoy system was at least in substantial part due to a severe shortage of suitable escort vessels, without which convoys were seen as actually more vulnerable than lone ships.", "coordx": 99, "coordy": 137, "condition":[19,16], "buildingid":[9,11], "image":"CITY7.png"}, 
{"id":8, "name":"London", "description":"London /?l?nd?n/ is the capital and most populous city of England and the United Kingdom. Standing on the River Thames in the south east of the island of Great Britain, London has been a major settlement for two millennia. It was founded by the Romans, who named it Londinium. London's ancient core, the City of London, largely retains its 1.12-square-mile  medieval boundaries. Since at least the 19th century, \"London\" has also referred to the metropolis around this core, historically split between Middlesex, Essex, Surrey, Kent, and Hertfordshire, which today largely makes up Greater London, governed by the Mayor of London and the London Assembly. As a Nylonkong metropolis, London is a leading global city, in the arts, commerce, education, entertainment, fashion, finance, healthcare, media, professional services, research and development, tourism, and transport. It is one of the world's leading financial centres and has the fifth- or sixth-largest metropolitan area GDP in the world. London is a world cultural capital. It is the world's most-visited city as measured by international arrivals and has the world's largest city airport system measured by passenger traffic. London is the world's leading investment destination, hosting more international retailers and ultra high-net-worth individuals than any other city. London's universities form the largest concentration of higher education institutes in Europe, and a 2014 report placed it first in the world university rankings. According to the report London also ranks first in the world in software, multimedia development and design, and shares first position in technology readiness. In 2012, London became the only city to host the modern Summer Olympic Games three times. London has a diverse range of people and cultures, and more than 300 languages are spoken in the region. Its estimated mid-2015 municipal population  was 8,673,713, the largest of any city in the European Union, and accounting for 12.5 per cent of the UK population. London's urban area is the second most populous in the EU, after Paris, with 9,787,426 inhabitants at the 2011 census. The city's metropolitan area is one of the most populous in Europe with 13,879,757 inhabitants, while the Greater London Authority states the population of the city-region  as 22.7 million.London was the world's most populous city from around 1831 to 1925. London contains four World Heritage Sites: the Tower of London; Kew Gardens; the site comprising the Palace of Westminster, Westminster Abbey, and St Margaret's Church; and the historic settlement of Greenwich . Other famous landmarks include Buckingham Palace, the London Eye, Piccadilly Circus, St Paul's Cathedral, Tower Bridge, Trafalgar Square, and The Shard. London is home to numerous museums, galleries, libraries, sporting events and other cultural institutions, including the British Museum, National Gallery, Natural History Museum, Tate Modern, British Library and West End theatres. The London Underground is the oldest underground railway network in the world.", "coordx": 199, "coordy": 114, "condition":[20], "buildingid":[10], "image":"CITY8.png"}, 
{"id":9, "name":"Titel", "description":"Titel  is a town and municipality in the South Ba?ka District of the Vojvodina, Serbia. The town of Titel has a population of 5,247, while the population of the municipality of Titel is 15,738. It is located in southeastern part of Ba?ka, known as ajkaka.", "coordx": 228, "coordy": 127, "condition":[23], "buildingid":[13], "image":"CITY9.png"}, 
{"id":10, "name":"Smiljan", "description":"Smiljan  is a village in the mountainous region of Western Lika in Croatia. It is located 6 km  northwest of Gospi?, and fifteen kilometers from the Zagreb-Split highway; its population is 418 . Smiljan is famous as the birthplace of scientist Nikola Tesla.", "coordx": 221, "coordy": 129, "condition":[25,25], "buildingid":[14], "image":"CITY10.png"}, 
{"id":11, "name":"the United States", "description":", US , USA , and United States . The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.The 48 contiguous states and federal district are in central North America between Canada and Mexico, with the state of Alaska in the northwestern part of North America and the state of Hawaii comprising an archipelago in the mid-Pacific. The territories are scattered about the Pacific Ocean and the Caribbean Sea. At 3.8 million square miles  and with over 324 million people, the United States is the world's third-largest country by total area  and the third-most populous. It is one of the world's most ethnically diverse and multicultural nations, the product of large-scale immigration from many other countries. The country's capital is Washington, D.C. and its largest city is New York City; other major metropolitan areas include Los Angeles, Chicago, Dallas, San Francisco, Boston, Philadelphia, Houston, Atlanta, and Miami. The geography, climate and wildlife of the country are extremely diverse. Paleo-Indians migrated from Asia to the North American mainland at least 15,000 years ago, with European colonization beginning in the 16th century. The United States emerged from 13 British colonies along the East Coast. Numerous disputes between Great Britain and the colonies in the aftermath of the Seven Years War led to the American Revolution, which began in 1775. On July 4, 1776, as the colonies were fighting Great Britain in the American Revolutionary War, delegates from the 13 colonies unanimously adopted the Declaration of Independence. The war ended in 1783 with recognition of the independence of the United States by Great Britain, and was the first successful war of independence against a European colonial empire. The current constitution was adopted in 1788, after the Articles of Confederation, adopted in 1781, were felt to have provided inadequate federal powers. The first ten amendments, collectively named the Bill of Rights, were ratified in 1791 and designed to guarantee many fundamental civil liberties. The United States embarked on a vigorous expansion across North America throughout the 19th century, displacing American Indian tribes, acquiring new territories, and gradually admitting new states until it spanned the continent by 1848. During the second half of the 19th century, the American Civil War led to the end of legal slavery in the country. By the end of that century, the United States extended into the Pacific Ocean, and its economy, driven in large part by the Industrial Revolution, began to soar. The SpanishAmerican War and World War I confirmed the country's status as a global military power. The United States emerged from World War II as a global superpower, the first country to develop nuclear weapons, the only country to use them in warfare, and a permanent member of the United Nations Security Council. The end of the Cold War and the dissolution of the Soviet Union in 1991 left the United States as the world's sole superpower. The United States is a highly developed country, with the world's largest economy by nominal GDP. It ranks highly in several measures of socioeconomic performance, including average wage, human development, per capita GDP, and productivity per person. While the U.S. economy is considered post-industrial, characterized by the dominance of services, the manufacturing sector remains the second-largest in the world. Though its population is only 4.4% of the world total, the United States accounts for nearly a quarter of world GDP and almost a third of global military spending, making it the world's foremost military and economic power. The United States is a prominent political and cultural force internationally, and a leader in scientific research and technological innovations.", "coordx": 90, "coordy": 139, "condition":[26,26], "buildingid":[15], "image":"CITY11.png"}, 
{"id":12, "name":"Germany", "description":"Germany , officially the Federal Republic of Germany , is a federal parliamentary republic in central-western Europe. It includes 16 constituent states, covers an area of 357,021 square kilometres , and has a largely temperate seasonal climate. With about 82 million inhabitants, Germany is the most populous member state of the European Union. After the United States, it is the second most popular immigration destination in the world. Germany's capital and largest metropolis is Berlin. Major urban areas include Ruhr, Hamburg, Munich, Cologne, Frankfurt and Stuttgart. Various Germanic tribes have occupied the northern parts of modern Germany since classical antiquity. A region named Germania was documented before 100 AD. During the Migration Period the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. In 1871, Germany became a nation state when most of the German states unified into the Prussian-dominated German Empire. After World War I and the German Revolution of 19181919, the Empire was replaced by the parliamentary Weimar Republic. The establishment of the national socialist dictatorship in 1933 led to World War II and a genocide. After a period of Allied occupation, two German states were founded: the Federal Republic of Germany and the German Democratic Republic. In 1990, the country was reunified. In the 21st century, Germany is a great power and has the world's fourth-largest economy by nominal GDP, as well as the fifth-largest by PPP. As a global leader in several industrial and technological sectors, it is both the world's third-largest exporter and importer of goods. Germany is a developed country with a very high standard of living sustained by a skilled and productive society. It upholds a social security and universal health care system, environmental protection and a tuition-free university education. Germany was a founding member of the European Union in 1993. It is part of the Schengen Area, and became a co-founder of the Eurozone in 1999. Germany is a member of the United Nations, NATO, the G8, the G20, and the OECD. The national military expenditure is the 9th highest in the world. Known for its rich cultural history, Germany has been continuously the home of influential artists, philosophers, musicians, sportspeople and entrepreneurs. It is a global leader in science and technology.", "coordx": 219, "coordy": 111, "condition":[27], "buildingid":[16], "image":"CITY12.png"}, 
{"id":13, "name":"Commonwealth of Massachusetts", "description":"Massachusetts /?ms??t?u?s?ts/ mass-?-CHOO-sits; officially the Commonwealth of Massachusetts, is the most populous state in the New England region of the northeastern United States. It is bordered by the Atlantic Ocean to the east, the states of Connecticut and Rhode Island to the south, New Hampshire and Vermont to the north, and New York to the west. The capital of Massachusetts and the most populous city in New England is Boston. Over 80% of Massachusetts' population lives in the Greater Boston metro area, a region influential upon American history, academia, and industry. Originally dependent on agriculture, fishing and trade, Massachusetts was transformed into a manufacturing center during the Industrial Revolution. During the 20th century, Massachusetts' economy shifted from manufacturing to services. Modern Massachusetts is a global leader in biotechnology, engineering, higher education, finance, and maritime trade. Plymouth was the site of the first colony in New England, founded in 1620 by the Pilgrims, passengers of the Mayflower. In 1692, the town of Salem and surrounding areas experienced one of America's most infamous cases of mass hysteria, the Salem witch trials. In 1777, General Henry Knox founded the Springfield Armory, which during the Industrial Revolution catalyzed numerous important technological advances, including interchangeable parts. In 1786, Shays' Rebellion, a populist revolt led by disaffected Revolutionary War veterans, influenced the United States Constitutional Convention. In the 18th century, the Protestant First Great Awakening, which swept the Atlantic world, originated from the pulpit of Northampton preacher Jonathan Edwards. In the late 18th century, Boston became known as the \"Cradle of Liberty\" for the agitation there that led to the American Revolution. The entire Commonwealth of Massachusetts has played a powerful commercial and cultural role in the history of the United States. Before the American Civil War, Massachusetts was a center for the abolitionist, temperance, and transcendentalist movements. In the late 19th century, the sports of basketball and volleyball were invented in the western Massachusetts cities of Springfield and Holyoke, respectively. In 2004, Massachusetts became the first U.S. state to legally recognize same-sex marriage as a result of the decision of the state's Supreme Judicial Court. Many prominent American political dynasties have hailed from the state, including the Adams and Kennedy families. Harvard University in Cambridge is the oldest institution of higher learning in the United States, with the largest financial endowment of any university, and whose Law School has spawned a contemporaneous majority of United States Supreme Court Justices. Both Harvard University and the Massachusetts Institute of Technology, also in Cambridge, have been ranked among the most highly regarded academic institutions in the world.", "coordx": 98, "coordy": 133, "condition":[32], "buildingid":[19], "image":"CITY13.png"}, 
{"id":14, "name":"Holyoke, Massachusetts", "description":"Holyoke is a city in Hampden County, Massachusetts, United States that lies between the western bank of the Connecticut River and the Mount Tom Range. As of 2012, the city had an estimated population of 40,135. Sitting eight miles north of Springfield, Holyoke is part of the Springfield Metropolitan Area, one of the two distinct metropolitan areas in Massachusetts.", "coordx": 96, "coordy": 133, "condition":[33], "buildingid":[20], "image":"CITY14.png"}, 
{"id":15, "name":"Bern", "description":"The city of Bern  or Berne  is the de facto capital of Switzerland, referred to by the Swiss as their  Bundesstadt, or \"federal city\". With a population of 141,107 , Bern is the fourth most populous city in Switzerland. The Bern agglomeration, which includes 36 municipalities, had a population of 406,900 in 2014. The metropolitan area had a population of 660,000 in 2000. Bern is also the capital of the Canton of Bern, the second most populous of Switzerland's cantons. The official language in Bern is the Swiss variety of Standard German, but the most-spoken language is an Alemannic Swiss German dialect, Bernese German. In 1983, the historic old town in the centre of Bern became a UNESCO World Heritage Site. Bern is ranked among the worlds top ten cities for the best quality of life .", "coordx": 210, "coordy": 124, "condition":[30], "buildingid":[17], "image":"CITY15.png"}, 
{"id":16, "name":"Sharon, Massachusetts", "description":"Sharon is a town in Norfolk County, Massachusetts, United States. The population was 17,612 at the 2010 census. Sharon is part of Greater Boston, about 17 miles  southwest of downtown Boston.", "coordx": 98, "coordy": 133, "condition":[34], "buildingid":[18], "image":"CITY16.png"}],
"dialoguenodes":[{"id":103, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 0, "children": [104,108,126,138,142], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":142, "dialogueline":"What, nationality? I don't know anything about that.", "eventid":"72", "dialoguetype": 0, "children": [], "condition":[71], "option":"I could use your cooperation. Could you tell me any information about one of the suspects?", "isroot": false}, 
{"id":138, "dialogueline":"I am know for subject. category:1894 births", "eventid":"68", "dialoguetype": 0, "children": [], "condition":[67], "option":"I need your cooperation. Do you know some information about one of the suspects?", "isroot": false}, 
{"id":126, "dialogueline":"I am know for field. engineer", "eventid":"56", "dialoguetype": 0, "children": [], "condition":[55], "option":"I need a lead. Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":108, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"38", "dialoguetype": 0, "children": [], "condition":[37], "option":"I need a lead. Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":104, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [103], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":83, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [92,95,97], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":97, "dialogueline":"You are asking a lot of questions...I don't like this.", "eventid":"-1", "dialoguetype": 3, "children": [83], "condition":[], "option":"What can you tell me about yourself?", "isroot": false}, 
{"id":95, "dialogueline":"Why do you care about where I was born?", "eventid":"-1", "dialoguetype": 1, "children": [96], "condition":[], "option":"What city were you born in?", "isroot": false}, 
{"id":96, "dialogueline":"That is none of your business.", "eventid":"-1", "dialoguetype": 1, "children": [83], "condition":[], "option":"When were you born?", "isroot": false}, 
{"id":92, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [93], "condition":[], "option":"<Ask about Commonwealth of Massachusetts>", "isroot": false}, 
{"id":93, "dialogueline":"I think the Museum could have a clue.", "eventid":"-1", "dialoguetype": 0, "children": [94], "condition":[], "option":"Someone told me to find Mildred Allen. Have you heard of them?", "isroot": false}, 
{"id":94, "dialogueline":"Have you travelled to in Commonwealth of Massachusetts? Try searching there.", "eventid":"32", "dialoguetype": 0, "children": [83], "condition":[], "option":"Where is the Museum?", "isroot": false}, 
{"id":98, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [102], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":102, "dialogueline":"Hello", "eventid":"34", "dialoguetype": 0, "children": [98], "condition":[], "option":"<Ask about Mildred Allen>", "isroot": false}, 
{"id":91, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [99], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":99, "dialogueline":"May I help?", "eventid":"-1", "dialoguetype": 0, "children": [100], "condition":[], "option":"<Ask about Holyoke, Massachusetts>", "isroot": false}, 
{"id":100, "dialogueline":"I'm not quite certain. Perhaps, I would look inside the Stadium if I were you. You could find something.", "eventid":"-1", "dialoguetype": 0, "children": [101], "condition":[], "option":"Somebody told me to find Mildred Allen. Do you know?", "isroot": false}, 
{"id":101, "dialogueline":"A friend told me it is was rumored to be in Holyoke, Massachusetts. Try searching there.", "eventid":"33", "dialoguetype": 0, "children": [91], "condition":[], "option":"Where might I see the Stadium?", "isroot": false}, 
{"id":80, "dialogueline":"I'm innocent", "eventid":"-1", "dialoguetype": 0, "children": [81,120,134,136,140], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":140, "dialogueline":"What, nationality? I don't know anything about that.", "eventid":"70", "dialoguetype": 0, "children": [], "condition":[69], "option":"Would you give me some information about one of the suspects?", "isroot": false}, 
{"id":136, "dialogueline":"I am know for subject. 1982 deaths", "eventid":"66", "dialoguetype": 0, "children": [], "condition":[65], "option":"Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":134, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"64", "dialoguetype": 0, "children": [], "condition":[63], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":120, "dialogueline":"I am know for field. engineer", "eventid":"50", "dialoguetype": 0, "children": [], "condition":[49], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":81, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [80], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":75, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [76], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":76, "dialogueline":"Go away", "eventid":"-1", "dialoguetype": 0, "children": [75], "condition":[], "option":"I'm looking for Paul Kollsman?...", "isroot": false}, 
{"id":58, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [77,78,79,143], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":143, "dialogueline":"Beno Gutenberg has for nationality", "eventid":"73", "dialoguetype": 0, "children": [58], "condition":[-1], "option":"Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":79, "dialogueline":"I'm not going to answer that!", "eventid":"-1", "dialoguetype": 3, "children": [58], "condition":[], "option":"What can you tell me about yourself?", "isroot": false}, 
{"id":78, "dialogueline":"What is this, an interrogation?!", "eventid":"-1", "dialoguetype": 2, "children": [58], "condition":[], "option":"Where do you live? It might provide clues.", "isroot": false}, 
{"id":77, "dialogueline":"Hi", "eventid":"27", "dialoguetype": 0, "children": [58], "condition":[], "option":"<Ask about Paul Kollsman>", "isroot": false}, 
{"id":69, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [70], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":70, "dialogueline":"Don't know.", "eventid":"-1", "dialoguetype": 0, "children": [69], "condition":[], "option":"I'm looking for Paul Kollsman?...", "isroot": false}, 
{"id":57, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [71,72,73,139], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":139, "dialogueline":"Paul Kollsman has for nationality", "eventid":"69", "dialoguetype": 0, "children": [141], "condition":[-1], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":141, "dialogueline":"Mildred Allen has for nationality", "eventid":"71", "dialoguetype": 0, "children": [57], "condition":[69], "option":"I could use your help. Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":73, "dialogueline":"That is none of your business.", "eventid":"-1", "dialoguetype": 2, "children": [57], "condition":[], "option":"Do you live anywhere associated with this?", "isroot": false}, 
{"id":72, "dialogueline":"Why do you want to know? Show me your badge!", "eventid":"-1", "dialoguetype": 3, "children": [57], "condition":[], "option":"You seem familiar, remind me why?", "isroot": false}, 
{"id":71, "dialogueline":"Hi", "eventid":"26", "dialoguetype": 0, "children": [57], "condition":[], "option":"<Ask about the United States>", "isroot": false}, 
{"id":56, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [66,67,131], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":131, "dialogueline":"Frederick G. Donnan has for deathplace", "eventid":"61", "dialoguetype": 0, "children": [133], "condition":[-1], "option":"Would you tell me some information about one of the suspects?", "isroot": false}, 
{"id":133, "dialogueline":"Paul Kollsman has for deathplace", "eventid":"63", "dialoguetype": 0, "children": [135], "condition":[61], "option":"Do you know some information about one of the suspects?", "isroot": false}, 
{"id":135, "dialogueline":"Paul Kollsman is know for subject. 1982 deaths", "eventid":"65", "dialoguetype": 0, "children": [137], "condition":[63], "option":"I need some cooperation. Do you recall any information about one of the suspects?", "isroot": false}, 
{"id":137, "dialogueline":"Mildred Allen is know for subject. category:1894 births", "eventid":"67", "dialoguetype": 0, "children": [56], "condition":[65], "option":"Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":67, "dialogueline":"I don't have to answer that...", "eventid":"-1", "dialoguetype": 2, "children": [56], "condition":[], "option":"Do you live anywhere associated with this?", "isroot": false}, 
{"id":66, "dialogueline":"Hi", "eventid":"25", "dialoguetype": 0, "children": [56], "condition":[], "option":"<Ask about Nikola Tesla>", "isroot": false}, 
{"id":53, "dialogueline":"I don't have to speak to you", "eventid":"-1", "dialoguetype": 0, "children": [54,116,128,130,132], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":132, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"62", "dialoguetype": 0, "children": [], "condition":[61], "option":"Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":130, "dialogueline":"I am know for subject. academics of university college london", "eventid":"60", "dialoguetype": 0, "children": [], "condition":[59], "option":"I need some assistance. Would you give me some information about one of the suspects?", "isroot": false}, 
{"id":128, "dialogueline":"What, nationality? I don't know anything about that.", "eventid":"58", "dialoguetype": 0, "children": [], "condition":[57], "option":"Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":116, "dialogueline":"I am know for field. chemistry", "eventid":"46", "dialoguetype": 0, "children": [], "condition":[45], "option":"Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":54, "dialogueline":"You have no proof.", "eventid":"-1", "dialoguetype": 0, "children": [53], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":44, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [51,52,127], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":127, "dialogueline":"Frederick G. Donnan has for nationality", "eventid":"57", "dialoguetype": 0, "children": [129], "condition":[-1], "option":"I could use some help. Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":129, "dialogueline":"Frederick G. Donnan is know for subject. academics of university college london", "eventid":"59", "dialoguetype": 0, "children": [44], "condition":[57], "option":"I could use your cooperation. Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":52, "dialogueline":"Why do you want to know? Show me your badge!", "eventid":"-1", "dialoguetype": 3, "children": [44], "condition":[], "option":"What are you most known for?", "isroot": false}, 
{"id":51, "dialogueline":"May I help?", "eventid":"20", "dialoguetype": 0, "children": [44], "condition":[], "option":"<Ask about Frederick G. Donnan>", "isroot": false}, 
{"id":39, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [40], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":40, "dialogueline":"I have no idea what you're talking about", "eventid":"-1", "dialoguetype": 0, "children": [39], "condition":[], "option":"I'm looking for Beno Gutenberg?...", "isroot": false}, 
{"id":41, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 0, "children": [42,110,112,121,124,144], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":144, "dialogueline":"What, nationality? I don't know anything about that.", "eventid":"74", "dialoguetype": 0, "children": [], "condition":[73], "option":"I could use your help. Do you recall some information about one of the suspects?", "isroot": false}, 
{"id":124, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"54", "dialoguetype": 0, "children": [], "condition":[53], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":121, "dialogueline":"Enrico Coen has for nationality", "eventid":"51", "dialoguetype": 0, "children": [123], "condition":[-1], "option":"I could use some help. Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":123, "dialogueline":"Beno Gutenberg has for deathplace", "eventid":"53", "dialoguetype": 0, "children": [41], "condition":[51], "option":"I need your cooperation. Do you know any information about one of the suspects?", "isroot": false}, 
{"id":112, "dialogueline":"I am know for subject. american jews", "eventid":"42", "dialoguetype": 0, "children": [], "condition":[41], "option":"I need your assistance. Do you know some information about one of the suspects?", "isroot": false}, 
{"id":110, "dialogueline":"I am know for field. seismology", "eventid":"40", "dialoguetype": 0, "children": [], "condition":[39], "option":"I need a lead. Do you know any information about one of the suspects?", "isroot": false}, 
{"id":42, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [41], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":24, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [34,35,37,119], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":119, "dialogueline":"Paul Kollsman is know for field. engineer", "eventid":"49", "dialoguetype": 0, "children": [24], "condition":[-1], "option":"Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":37, "dialogueline":"What is this, an interrogation?!", "eventid":"-1", "dialoguetype": 2, "children": [24], "condition":[], "option":"Do you live anywhere associated with this?", "isroot": false}, 
{"id":35, "dialogueline":"Why does it matter where I was born..?", "eventid":"-1", "dialoguetype": 1, "children": [36], "condition":[], "option":"What city were you born in?", "isroot": false}, 
{"id":36, "dialogueline":"That is none of your business.", "eventid":"-1", "dialoguetype": 1, "children": [24], "condition":[], "option":"What year were you born in?", "isroot": false}, 
{"id":34, "dialogueline":"Hello", "eventid":"12", "dialoguetype": 0, "children": [24], "condition":[], "option":"<Ask about 1960>", "isroot": false}, 
{"id":23, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [32,33,117], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":117, "dialogueline":"Enrico Coen is know for field. plant development", "eventid":"47", "dialoguetype": 0, "children": [23], "condition":[-1], "option":"Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":33, "dialogueline":"That is none of your business.", "eventid":"-1", "dialoguetype": 2, "children": [23], "condition":[], "option":"Do you live anywhere associated with this?", "isroot": false}, 
{"id":32, "dialogueline":"Hi", "eventid":"11", "dialoguetype": 0, "children": [23], "condition":[], "option":"<Ask about Lyndon B. Johnson>", "isroot": false}, 
{"id":20, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 0, "children": [21,106,113,114,118,122], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":122, "dialogueline":"What, nationality? I don't know anything about that.", "eventid":"52", "dialoguetype": 0, "children": [], "condition":[51], "option":"I could use your help. Do you have any information about one of the suspects?", "isroot": false}, 
{"id":118, "dialogueline":"I am know for field. plant development", "eventid":"48", "dialoguetype": 0, "children": [], "condition":[47], "option":"Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":114, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"44", "dialoguetype": 0, "children": [], "condition":[43], "option":"I need a lead. Do you know any information about one of the suspects?", "isroot": false}, 
{"id":113, "dialogueline":"Enrico Coen has for deathplace", "eventid":"43", "dialoguetype": 0, "children": [20], "condition":[-1], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":106, "dialogueline":"I am know for subject. category:commanders of the order of the british empire", "eventid":"36", "dialoguetype": 0, "children": [], "condition":[35], "option":"Do you have any information about one of the suspects?", "isroot": false}, 
{"id":21, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [20], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":16, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [17], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":17, "dialogueline":"Please go away", "eventid":"-1", "dialoguetype": 0, "children": [16], "condition":[], "option":"I'm looking for Enrico Coen?...", "isroot": false}, 
{"id":2, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [18,19,111], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":111, "dialogueline":"Beno Gutenberg is know for subject. american jews", "eventid":"41", "dialoguetype": 0, "children": [2], "condition":[-1], "option":"Do you know some information about one of the suspects?", "isroot": false}, 
{"id":19, "dialogueline":"That is none of your business.", "eventid":"-1", "dialoguetype": 2, "children": [2], "condition":[], "option":"Do you live anywhere associated with this?", "isroot": false}, 
{"id":18, "dialogueline":"May I help?", "eventid":"6", "dialoguetype": 0, "children": [2], "condition":[], "option":"<Ask about Enrico Coen>", "isroot": false}, 
{"id":10, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [11], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":11, "dialogueline":"Please, leave", "eventid":"-1", "dialoguetype": 0, "children": [10], "condition":[], "option":"I'm looking for Enrico Coen?...", "isroot": false}, 
{"id":1, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [12,13,14,109], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":109, "dialogueline":"Beno Gutenberg is know for field. seismology", "eventid":"39", "dialoguetype": 0, "children": [1], "condition":[-1], "option":"Do you know some information about one of the suspects?", "isroot": false}, 
{"id":14, "dialogueline":"Stop asking me this!", "eventid":"-1", "dialoguetype": 3, "children": [1], "condition":[], "option":"What can you tell me about yourself?", "isroot": false}, 
{"id":13, "dialogueline":"I don't have to answer that...", "eventid":"-1", "dialoguetype": 2, "children": [1], "condition":[], "option":"Where do you live? It might provide clues.", "isroot": false}, 
{"id":12, "dialogueline":"Hello", "eventid":"5", "dialoguetype": 0, "children": [1], "condition":[], "option":"<Ask about University of East Anglia>", "isroot": false}, 
{"id":85, "dialogueline":"Hello?", "eventid":"-1", "dialoguetype": 0, "children": [86], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":86, "dialogueline":"I'll do my best.", "eventid":"28", "dialoguetype": 0, "children": [87], "condition":[], "option":"Hi, I'm a private-eye assigned to the victim's case. If you don't mind, can I ask you some questions?", "isroot": false}, 
{"id":87, "dialogueline":"I am called Caio.", "eventid":"29", "dialoguetype": 0, "children": [88], "condition":[], "option":"Please, state your name.", "isroot": false}, 
{"id":88, "dialogueline":"Last I thought, I heard the victim was friends with Hans Albert Einstein. Perhaps they have heard of something.", "eventid":"30", "dialoguetype": 0, "children": [89,90], "condition":[], "option":"Is there something you recollect that might be valuable to the investigation?", "isroot": false}, 
{"id":90, "dialogueline":"I think Mildred Allen could be connected. But, I'm not completely convinced.", "eventid":"31", "dialoguetype": 0, "children": [85], "condition":[], "option":"I would like a lead. Do you have any more information?", "isroot": false}, 
{"id":89, "dialogueline":"I think Hans Albert Einstein was in Bern.", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"If you could tell me, where would I find Hans Albert Einstein? I would really welcome information.", "isroot": false}, 
{"id":60, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [61], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":61, "dialogueline":"Certainly. Anything to help.", "eventid":"21", "dialoguetype": 0, "children": [62], "condition":[], "option":"Greetings, I'm following the victim's case. If you don't mind, please could you help answer some questions?", "isroot": false}, 
{"id":62, "dialogueline":"I am known as Louis de Broglie.", "eventid":"22", "dialoguetype": 0, "children": [63], "condition":[], "option":"Please, state your name.", "isroot": false}, 
{"id":63, "dialogueline":"the victim was friends with Mileva Mari?.  That's what I was led to believe at least.", "eventid":"23", "dialoguetype": 0, "children": [64,65], "condition":[], "option":"Do you have something that might be of use to the investigation?", "isroot": false}, 
{"id":65, "dialogueline":"I believe Paul Kollsman might be connected.", "eventid":"24", "dialoguetype": 0, "children": [60], "condition":[], "option":"Do you have any more information?", "isroot": false}, 
{"id":64, "dialogueline":"Mileva Mari? was travelling to Titel. Maybe that assists you.", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"If you don't mind being accomodating, where can I find Mileva Mari??", "isroot": false}, 
{"id":46, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [47], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":47, "dialogueline":"I'll do my best.", "eventid":"14", "dialoguetype": 0, "children": [48], "condition":[], "option":"Hello, I'm a private-eye. Would I ask you some questions?", "isroot": false}, 
{"id":48, "dialogueline":"I am named Khosro Naghed.", "eventid":"15", "dialoguetype": 0, "children": [49], "condition":[], "option":"Tell me your name.", "isroot": false}, 
{"id":49, "dialogueline":"The victim talked about a thing called $thingName$.", "eventid":"16", "dialoguetype": 0, "children": [50], "condition":[], "option":"Is there anything specific you think I should know about?", "isroot": false}, 
{"id":50, "dialogueline":"I'm unsure. However, I am suspicious of Frederick G. Donnan.", "eventid":"17", "dialoguetype": 0, "children": [46], "condition":[], "option":"I would like your help. Do you have any more information?", "isroot": false}, 
{"id":26, "dialogueline":"Hello? Do you need something?", "eventid":"-1", "dialoguetype": 0, "children": [27,125], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":125, "dialogueline":"Mildred Allen is know for field. physics", "eventid":"55", "dialoguetype": 0, "children": [26], "condition":[-1], "option":"Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":27, "dialogueline":"I'm not sure I'll be very helpful...", "eventid":"7", "dialoguetype": 0, "children": [28], "condition":[], "option":"Hi, I'm a private-eye following the victim's case. Could I ask you some questions?", "isroot": false}, 
{"id":28, "dialogueline":"I am known as Alfred Alexander.", "eventid":"8", "dialoguetype": 0, "children": [29], "condition":[], "option":"State your name.", "isroot": false}, 
{"id":29, "dialogueline":"Last I thought, the victim was acquaintences with Thurgood Marshall. I would check with them.", "eventid":"9", "dialoguetype": 0, "children": [30,31], "condition":[], "option":"Is there something you recall that might be useful to the investigation?", "isroot": false}, 
{"id":31, "dialogueline":"I am suspicious of Beno Gutenberg. But, I'm not entirely convinced.", "eventid":"10", "dialoguetype": 0, "children": [26], "condition":[], "option":"I need a lead. Can you think of someone who could have done it?", "isroot": false}, 
{"id":30, "dialogueline":"Thurgood Marshall visited Baltimore, Maryland. Maybe that assists you.", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"If you would advise me, where might I meet Thurgood Marshall?", "isroot": false}, 
{"id":4, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [5,115], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":115, "dialogueline":"Frederick G. Donnan is know for field. chemistry", "eventid":"45", "dialoguetype": 0, "children": [4], "condition":[-1], "option":"Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":5, "dialogueline":"Sure.", "eventid":"0", "dialoguetype": 0, "children": [6], "condition":[], "option":"Greetings, I'm a private investigator. Please could you help answer some questions?", "isroot": false}, 
{"id":6, "dialogueline":"I am Heinrich Friedrich Weber.", "eventid":"1", "dialoguetype": 0, "children": [7], "condition":[], "option":"Who are you?", "isroot": false}, 
{"id":7, "dialogueline":"The victim talked about $thingName$.", "eventid":"2", "dialoguetype": 0, "children": [8], "condition":[], "option":"Is there anything you think I should know about?", "isroot": false}, 
{"id":8, "dialogueline":"I am suspicious of Enrico Coen. However, I'm not completely convinced.", "eventid":"3", "dialoguetype": 0, "children": [4], "condition":[], "option":"I could use a lead. Can you think of someone who might be guilty?", "isroot": false}],
"crime":{"suspects":[3,10,15,21,27],"culprit":27,"facts":[{"pid":3,"factoid":"Enrico Coen is know for field. plant development","condition":47},{"pid":3,"factoid":"Enrico Coen has for nationality","condition":51},{"pid":3,"factoid":"Enrico Coen has for deathplace","condition":43},{"pid":3,"factoid":"Enrico Coen is know for subject. category:commanders of the order of the british empire","condition":35},{"pid":10,"factoid":"Beno Gutenberg is know for field. seismology","condition":39},{"pid":10,"factoid":"Beno Gutenberg has for nationality","condition":73},{"pid":10,"factoid":"Beno Gutenberg has for deathplace","condition":53},{"pid":10,"factoid":"Beno Gutenberg is know for subject. american jews","condition":41},{"pid":15,"factoid":"Frederick G. Donnan is know for field. chemistry","condition":45},{"pid":15,"factoid":"Frederick G. Donnan has for nationality","condition":57},{"pid":15,"factoid":"Frederick G. Donnan has for deathplace","condition":61},{"pid":15,"factoid":"Frederick G. Donnan is know for subject. academics of university college london","condition":59},{"pid":21,"factoid":"Paul Kollsman is know for field. engineer","condition":49},{"pid":21,"factoid":"Paul Kollsman has for nationality","condition":69},{"pid":21,"factoid":"Paul Kollsman has for deathplace","condition":63},{"pid":21,"factoid":"Paul Kollsman is know for subject. 1982 deaths","condition":65},{"pid":27,"factoid":"Mildred Allen is know for field. physics","condition":55},{"pid":27,"factoid":"Mildred Allen has for nationality","condition":71},{"pid":27,"factoid":"Mildred Allen has for deathplace","condition":37},{"pid":27,"factoid":"Mildred Allen is know for subject. category:1894 births","condition":67}]}}
