{
"people" : [
{"id":5, "name":"Leon Botstein", "description":"Leon Botstein  is a Jewish-American conductor, scholar, and the President of Bard College.", "drootid": 5, "condition":[], "buildingid":0, "image":"PERSON5.png"}, 
{"id":9, "name":"Upton Sinclair", "description":"Upton Beall Sinclair, Jr.   was an American writer of nearly 100 books and other works across a number of genres.", "drootid": 25, "condition":[], "buildingid":0, "image":"PERSON9.png"}, 
{"id":15, "name":"Patent examiner", "description":"A patent examiner  is an employee, usually a civil servant with a scientific or engineering background, working at a patent office.  Major employers of patent examiners are the European Patent Office , the United States Patent and Trademark Office , the Japan Patent Office , and other patent offices around the world.", "drootid": 38, "condition":[], "buildingid":0, "image":"PERSON15.png"}, 
{"id":20, "name":"Alternating current", "description":"Alternating current , is an electric current in which the flow of electric charge periodically reverses direction, whereas in direct current , the flow of electric charge is only in one direction.  AC is the form in which electric power is delivered to businesses and residences, and it is the form of electric power that consumers typically use when they plug kitchen appliances, televisions and electric lamps into a wall socket.", "drootid": 56, "condition":[], "buildingid":0, "image":"PERSON20.png"}, 
{"id":23, "name":"Josiah Willard Gibbs", "description":"Josiah Willard Gibbs  was an American scientist who made important theoretical contributions to physics, chemistry, and mathematics.  His work on the applications of thermodynamics was instrumental in transforming physical chemistry into a rigorous deductive science.", "drootid": 70, "condition":[], "buildingid":0, "image":"PERSON23.png"}, 
{"id":1, "name":"Baruch Spinoza", "description":"Baruch Spinoza  was a Dutch philosopher of Sephardi/Portuguese origin.  By laying the groundwork for the 18th-century Enlightenment and modern biblical criticism, including modern conceptions of the self and the universe, he came to be considered one of the great rationalists of 17th-century philosophy.", "drootid": 1, "condition":[2], "buildingid":1, "image":"PERSON1.png"}, 
{"id":2, "name":"Mário Ferreira dos Santos", "description":"Mário Ferreira dos Santos  was a Brazilian philosopher.  Born in Tietê, São Paulo, Ferreira dos Santos was raised in Pelotas, Rio Grande do Sul, and graduated in Law and Social Sciences at the Federal University of Rio Grande do Sul.", "drootid": 2, "condition":[4], "buildingid":2, "image":"PERSON2.png"}, 
{"id":3, "name":"Gottfried Wilhelm Leibniz", "description":"Gottfried Wilhelm  Leibniz  was a German polymath and philosopher who occupies a prominent place in the history of mathematics and the history of philosophy, having developed differential and integral calculus independently of Isaac Newton.  Leibniz's notation has been widely used ever since it was published.", "drootid": 3, "condition":[5], "buildingid":3, "image":"PERSON3.png"}, 
{"id":6, "name":"Vincent", "description":"There is no information available for this character.", "drootid": 17, "condition":[5], "buildingid":3, "image":"PERSON6.png"}, 
{"id":4, "name":"Ferdinand Georg Frobenius", "description":"Ferdinand Georg Frobenius  was a German mathematician, best known for his contributions to the theory of elliptic functions, differential equations and to group theory.  He is known for the famous determinantal identities, known as Frobenius–Stickelberger formulae, governing elliptic functions, and for developing the theory of biquadratic forms.", "drootid": 21, "condition":[6], "buildingid":4, "image":"PERSON4.png"}, 
{"id":10, "name":"František Hrubín", "description":"František Hrubín  was a Czech poet and writer.  He was a lifetime member of the Communist Party of Czechoslovakia.", "drootid": 30, "condition":[12], "buildingid":5, "image":"PERSON10.png"}, 
{"id":8, "name":"Jan Tesánek", "description":"Jan Tesánek   was a Bohemian scholar and author of scientific literature.", "drootid": 32, "condition":[13], "buildingid":6, "image":"PERSON8.png"}, 
{"id":12, "name":"Jacob Bronowski", "description":"Jacob Bronowski  was a British mathematician, historian of science, theatre author, poet and inventor.  Of Polish-Jewish origin, he is best remembered as the presenter and writer of the 1973 BBC television documentary series, The Ascent of Man, and the accompanying book.", "drootid": 35, "condition":[18], "buildingid":9, "image":"PERSON12.png"}, 
{"id":16, "name":"Piero Sraffa", "description":"Piero Sraffa  was an influential Italian economist, who served as lecturer of economics at the University of Cambridge.  His book Production of Commodities by Means of Commodities is taken as founding the neo-Ricardian school of economics.", "drootid": 44, "condition":[18], "buildingid":9, "image":"PERSON16.png"}, 
{"id":13, "name":"H. F. Baker", "description":"Henry Frederick Baker FRS FRSE  was a British mathematician, working mainly in algebraic geometry, but also remembered for contributions to partial differential equations , and Lie groups.", "drootid": 36, "condition":[19], "buildingid":10, "image":"PERSON13.png"}, 
{"id":14, "name":"Louis J. Mordell", "description":"Louis Joel Mordell  was an American-born British mathematician, known for pioneering research in number theory.  He was born in Philadelphia, United States, in a Jewish family of Lithuanian extraction.", "drootid": 51, "condition":[20], "buildingid":11, "image":"PERSON14.png"}, 
{"id":18, "name":"Sean M. Carroll", "description":"Sean Michael Carroll  is a cosmologist and Physics professor specializing in dark energy and general relativity.  He is a research professor in the Department of Physics at the California Institute of Technology.", "drootid": 54, "condition":[23], "buildingid":13, "image":"PERSON18.png"}, 
{"id":19, "name":"Muzaffer Atac", "description":"Muzaffer Atac  was a Turkish-American physicist who was one of the founding scientists of Fermilab and performed important work with visible light photon counters and other detectors for particle physics.", "drootid": 66, "condition":[26], "buildingid":14, "image":"PERSON19.png"}, 
{"id":22, "name":"Leopold Ružička", "description":"Leopold Ružička ForMemRS  was a Croatian-Swiss scientist and winner of the 1939 Nobel Prize in Chemistry who worked most of his life in Switzerland.  He received eight honoris causa doctorates in science, medicine, and law; seven prizes and medals; and twenty-four honorary memberships in chemical, biochemical, and other scientific societies.", "drootid": 75, "condition":[31], "buildingid":16, "image":"PERSON22.png"}],
"items":[{"id":0, "name":"Charles University in Prague faculty", "description":"It is a letter about Charles University in Prague faculty. It says: Charles University in Prague faculty.  The following people are mentioned:  Faculty by university in the Czech Republic Charles University in Prague  And the following place: Berlin", "condition": [9], "eventid": 11, "buildingid":7, "itemtype":"letter", "image":"null"}, 
{"id":7, "name":"Flashlight", "description":"A flashlight with batteries", "condition": [], "eventid": -1, "buildingid":3, "itemtype":"flashlight", "image":"null"}, 
{"id":1, "name":"Charles University in Prague", "description":"It is a book about Charles University in Prague. It says: Charles University in Prague.  The following people are mentioned:  Charles University  And the following places: Bohemia and Charles University", "condition": [11], "eventid": 12, "buildingid":8, "itemtype":"book", "image":"null"}, 
{"id":2, "name":"Jewish agnostics", "description":"It is a book about Jewish agnostics. It says: Jewish agnostics.  The following people are mentioned:  Piero Sraffa Jacob Bronowski   And the following places: Łódź and United Kingdom", "condition": [16], "eventid": 18, "buildingid":12, "itemtype":"book", "image":"null"}, 
{"id":5, "name":"Crowbar", "description":"A crowbar. Can be used to break chains", "condition": [], "eventid": -1, "buildingid":12, "itemtype":"crowbar", "image":"null"}, 
{"id":3, "name":"American physicists", "description":"It is a book about American physicists. It says: American physicists.  The following people are mentioned:  Muzaffer Atac Léon Brillouin   And the following place: Kemaliye", "condition": [25], "eventid": 26, "buildingid":15, "itemtype":"book", "image":"null"}, 
{"id":6, "name":"Key", "description":"Keys for a locked door", "condition": [], "eventid": -1, "buildingid":15, "itemtype":"key", "image":"null"}, 
{"id":4, "name":"ETH Zurich faculty", "description":"It is a photograph about ETH Zurich faculty. In a corner, it says:ETH Zurich faculty.  There are things written behind: Leopold Ružička Paul Scherrer   And the following place: Austria-Hungary", "condition": [29], "eventid": 31, "buildingid":17, "itemtype":"photograph", "image":"PHOTO04.png"}],
"buildings":[{"id":0, "name":"House of Albert Einstein", "description":" and Swiss Confederation  Switzerland , officially the Swiss Confederation is a federal republic in Europe", "locktype": "null", "coordx": 109, "coordy": 94, "condition":[], "cityid":0, "peopleid":[5,9,15,20,23], "itemsid":[], "image":"BUILDING0.png"}, 
{"id":7, "name":"University", "description":" While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\"  The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east", "locktype": "null", "coordx": 100, "coordy": 76, "condition":[9], "cityid":0, "peopleid":[], "itemsid":[0], "image":"BUILDING7.png"}, 
{"id":1, "name":"House of Baruch Spinoza", "description":"Amsterdam  is the capital and most populous municipality of the Kingdom of the Netherlands Its status as the capital is mandated by the Constitution of the Netherlands, although it is not the seat of the government, which is The Hague", "locktype": "chain", "coordx": 342, "coordy": 197, "condition":[2], "cityid":1, "peopleid":[1], "itemsid":[], "image":"BUILDING1.png"}, 
{"id":2, "name":"House of Mário Ferreira dos Santos", "description":"Brazil , officially the Federative Republic of Brazil , is the largest country in both South America and Latin America As the world's fifth-largest country by both area and population, it is the largest country to have Portuguese as an official language–and the only one in the Americas", "locktype": "null", "coordx": 317, "coordy": 54, "condition":[4], "cityid":2, "peopleid":[2], "itemsid":[], "image":"BUILDING2.png"}, 
{"id":3, "name":"House of Gottfried Wilhelm Leibniz", "description":"Leipzig  is the largest city in the federal state of Saxony, Germany With a population of 570,087 inhabitants  it is Germany's tenth most populous city", "locktype": "null", "coordx": 179, "coordy": 218, "condition":[5,5], "cityid":3, "peopleid":[3,6], "itemsid":[7], "image":"BUILDING3.png"}, 
{"id":4, "name":"House of Ferdinand Georg Frobenius", "description":"Berlin  is the capital and the largest city of Germany as well as one of its 16 states With a population of approximately 3", "locktype": "null", "coordx": 305, "coordy": 207, "condition":[6], "cityid":4, "peopleid":[4], "itemsid":[], "image":"BUILDING4.png"}, 
{"id":8, "name":"Police Station", "description":"6 million people, Berlin is the second most populous city proper and the seventh most populous urban area in the European Union Located in northeastern Germany on the banks of Rivers Spree and Havel, it is the centre of the Berlin-Brandenburg Metropolitan Region, which has about 6 million residents from more than 180 nations", "locktype": "null", "coordx": 191, "coordy": 146, "condition":[11], "cityid":4, "peopleid":[], "itemsid":[1], "image":"BUILDING8.png"}, 
{"id":12, "name":"Forest", "description":" Due to its location in the European Plain, Berlin is influenced by a temperate seasonal climate Around one-third of the city's area is composed of forests, parks, gardens, rivers and lakes", "locktype": "null", "coordx": 298, "coordy": 138, "condition":[16], "cityid":4, "peopleid":[], "itemsid":[2,5], "image":"BUILDING12.png"}, 
{"id":15, "name":"Library", "description":" First documented in the 13th century and situated at the crossing of two important historic trade routes, Berlin became the capital of the Margraviate of Brandenburg , the Kingdom of Prussia , the German Empire , the Weimar Republic  and the Third Reich  Berlin in the 1920s was the third largest municipality in the world", "locktype": "null", "coordx": 93, "coordy": 63, "condition":[25], "cityid":4, "peopleid":[], "itemsid":[3,6], "image":"BUILDING15.png"}, 
{"id":5, "name":"Charles University", "description":"There is no information available about this", "locktype": "null", "coordx": 133, "coordy": 162, "condition":[12], "cityid":5, "peopleid":[10], "itemsid":[], "image":"BUILDING5.png"}, 
{"id":6, "name":"House of Jan Tesánek", "description":"Bohemia  is the westernmost and largest historical region of the Czech lands in the present-day Czech Republic In a broader meaning, Bohemia sometimes refers to the entire Czech territory, including Moravia and Czech Silesia, especially in a historical context, such as the Lands of the Bohemian Crown ruled by Bohemian kings", "locktype": "null", "coordx": 236, "coordy": 231, "condition":[13], "cityid":6, "peopleid":[8], "itemsid":[], "image":"BUILDING6.png"}, 
{"id":9, "name":"House of Jacob Bronowski", "description":"Łódź  is the third-largest city in Poland Located in the central part of the country, it had a population of 715,360 in 2013", "locktype": "key", "coordx": 99, "coordy": 60, "condition":[18,18], "cityid":7, "peopleid":[12,16], "itemsid":[], "image":"BUILDING9.png"}, 
{"id":10, "name":"House of H. F. Baker", "description":"The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom  or Britain, is a sovereign state in Europe Lying off the north-western coast of the European mainland, it includes the island of Great Britain , the north-eastern part of the island of Ireland, and many smaller islands", "locktype": "null", "coordx": 324, "coordy": 216, "condition":[19], "cityid":8, "peopleid":[13], "itemsid":[], "image":"BUILDING10.png"}, 
{"id":11, "name":"House of Louis J. Mordell", "description":"Philadelphia  is the largest city in the Commonwealth of Pennsylvania and the fifth-most populous in the United States, with an estimated population in 2014 of 1,560,297 In the Northeastern United States, at the confluence of the Delaware and Schuylkill rivers, Philadelphia is the economic and cultural anchor of the Delaware Valley, a metropolitan area home to 7", "locktype": "null", "coordx": 223, "coordy": 261, "condition":[20], "cityid":9, "peopleid":[14], "itemsid":[], "image":"BUILDING11.png"}, 
{"id":13, "name":"House of Sean M. Carroll", "description":" and City of Los Angeles  Los Angeles , officially the City of Los Angeles and often known by its initials L", "locktype": "null", "coordx": 309, "coordy": 115, "condition":[23], "cityid":10, "peopleid":[18], "itemsid":[], "image":"BUILDING13.png"}, 
{"id":14, "name":"House of Muzaffer Atac", "description":"Kemaliye   is both a town in and one of the nine districts of Erzincan Province in the Eastern Anatolia region of Turkey The town is known for its historic architecture, including many Ottoman-era houses", "locktype": "dark", "coordx": 216, "coordy": 67, "condition":[26], "cityid":11, "peopleid":[19], "itemsid":[], "image":"BUILDING14.png"}, 
{"id":17, "name":"Theatre", "description":" It is also notable for its commanding view of the river Karasu  flowing south through a gorge above the Keban dam", "locktype": "null", "coordx": 157, "coordy": 52, "condition":[29], "cityid":11, "peopleid":[], "itemsid":[4], "image":"BUILDING17.png"}, 
{"id":16, "name":"House of Leopold Ružička", "description":"Austria-Hungary , also known by  and often referred to as the Austro-Hungarian Empire in English-language sources, was a constitutional union of the Austrian Empire  and the Kingdom of Hungary  that existed from 1867 to 1918, when it collapsed as a result of defeat in World War I The union was a result of the Austro-Hungarian Compromise of 1867 and came into existence on 30 March 1867, when the compromise was ratified by the Hungarian parliament", "locktype": "null", "coordx": 76, "coordy": 176, "condition":[31], "cityid":12, "peopleid":[22], "itemsid":[], "image":"BUILDING16.png"}],
"cities":[{"id":0, "name":"Switzerland", "description":" and Swiss Confederation . Switzerland , officially the Swiss Confederation is a federal republic in Europe. While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\" . The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2 . While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zürich and Geneva. The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. The country has a history of armed neutrality going back to the Reformation, it has not been in a state of war internationally since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. In addition to being the birthplace of the Red Cross, Switzerland is home to numerous international organisations, including the second largest UN office. On the European level, it is a founding member of the European Free Trade Association, but notably it is not part of the European Union, nor the European Economic Area. However, the country does participate in the Schengen Area and the EU's single market through a number of bilateral treaties. Spanning the intersection of Germanic and Romance Europe, Switzerland comprises four main linguistic and cultural regions: German, French, Italian and Romansh. Although the majority of the population are German speaking, Swiss national identity is rooted in a common historical background, shared values such as federalism and direct democracy, and Alpine symbolism. Due to its linguistic diversity, Switzerland is known by a variety of native names: Schweiz [ˈʃvaɪts] ; Suisse [sɥis] ; Svizzera [ˈzvittsera] ; and Svizra [ˈʒviːtsrɐ] or [ˈʒviːtsʁːɐ] . On coins and stamps, Latin  is used instead of the four living languages. Switzerland is one of the most developed countries in the world, with the highest nominal wealth per adult and the eighth-highest per capita gross domestic product according to the IMF. Switzerland ranks at or near the top globally in several metrics of national performance, including government transparency, civil liberties, quality of life, economic competitiveness, and human development. Zürich and Geneva have each been ranked among the top cities in the world in terms of quality of life, with the former ranked second globally, according to Mercer.", "coordx": 210, "coordy": 124, "condition":[], "buildingid":[0,7], "image":"CITY0.png"}, 
{"id":1, "name":"Amsterdam", "description":"Amsterdam  is the capital and most populous municipality of the Kingdom of the Netherlands. Its status as the capital is mandated by the Constitution of the Netherlands, although it is not the seat of the government, which is The Hague. Amsterdam has a population of 842,343 within the city proper, 1,340,725 in the urban area, and 2,431,000 in the Amsterdam metropolitan area. The city is located in the province of North Holland in the west of the country. The metropolitan area comprises much of the northern part of the Randstad, one of the larger conurbations in Europe, with a population of approximately 7 million. Amsterdam's name derives from Amstelredamme, indicative of the city's origin as a dam of the river Amstel. Originating as a small fishing village in the late 12th century, Amsterdam became one of the most important ports in the world during the Dutch Golden Age , a result of its innovative developments in trade. During that time, the city was the leading centre for finance and diamonds. In the 19th and 20th centuries the city expanded, and many new neighborhoods and suburbs were planned and built. The 17th-century canals of Amsterdam and the 19–20th century Defence Line of Amsterdam are on the UNESCO World Heritage List. As the commercial capital of the Netherlands and one of the top financial centres in Europe, Amsterdam is considered an alpha world city by the Globalization and World Cities  study group. The city is also the cultural capital of the Netherlands. Many large Dutch institutions have their headquarters there, and seven of the world's 500 largest companies, including Philips and ING, are based in the city. In 2012, Amsterdam was ranked the second best city to live in by the Economist Intelligence Unit  and 12th globally on quality of living for environment and infrastructure by Mercer. The city was previously ranked 3rd in innovation by 2thinknow in the Innovation Cities Index 2009. Famous Amsterdam residents included Anne Frank the diarist, the artists Rembrandt van Rijn and Vincent van Gogh, and the philosopher Baruch Spinoza. The Amsterdam Stock Exchange, the oldest stock exchange in the world, is located in the city center. Amsterdam's main attractions, including its historic canals, the Rijksmuseum, the Van Gogh Museum, Stedelijk Museum, Hermitage Amsterdam, Anne Frank House, Amsterdam Museum, its red-light district, and its many cannabis coffee shops draw more than 5 million international visitors annually.", "coordx": 206, "coordy": 112, "condition":[2], "buildingid":[1], "image":"CITY1.png"}, 
{"id":2, "name":"Brazil", "description":"Brazil , officially the Federative Republic of Brazil , is the largest country in both South America and Latin America. As the world's fifth-largest country by both area and population, it is the largest country to have Portuguese as an official language–and the only one in the Americas. Bounded by the Atlantic Ocean on the east, Brazil has a coastline of 7,491 km . It borders all other South American countries except Ecuador and Chile and covers 47.3% of the continent's land area. Its Amazon River basin includes a vast tropical forest, home to diverse wildlife, a variety of ecological systems, and extensive natural resources spanning numerous protected habitats. This unique environmental heritage makes Brazil one of 17 megadiverse countries, and is the subject of significant global interest and debate regarding deforestation and environmental protection. Brazil was inhabited by numerous tribal nations prior to the landing in 1500 of explorer Pedro Álvares Cabral, who claimed the area for the Portuguese Empire. Brazil remained a Portuguese colony until 1808, when the capital of the empire was transferred from Lisbon to Rio de Janeiro. In 1815, the colony was elevated to the rank of kingdom upon the formation of the United Kingdom of Portugal, Brazil and the Algarves. Independence was achieved in 1822 with the creation of the Empire of Brazil, a unitary state governed under a constitutional monarchy and a parliamentary system. The ratification of the first constitution in 1824 led to the formation of a bicameral legislature, now called the National Congress. The country became a presidential republic in 1889 following a military coup d'état. An authoritarian military junta came to power in 1964 and ruled until 1985, after which civilian governance resumed. Brazil's current constitution, formulated in 1988, defines it as a democratic federal republic. The federation is composed of the union of the Federal District, the 26 states, and the 5,570 municipalities. Brazil's economy is the world's ninth-largest by nominal GDP and seventh-largest by GDP  as of 2015. A member of the BRICS group, Brazil until 2010 had one of the world's fastest growing major economies, with its economic reforms giving the country new international recognition and influence. Brazil's national development bank plays an important role for the country's economic growth. Brazil is a founding member of the United Nations, the G20, BRICS, Unasul, Mercosul, Organization of American States, Organization of Ibero-American States, CPLP, and the Latin Union. Brazil is a regional power in Latin America and a middle power in international affairs, with some analysts identifying it as an emerging global power. One of the world's major breadbaskets, Brazil has been the largest producer of coffee for the last 150 years.", "coordx": 131, "coordy": 222, "condition":[4], "buildingid":[2], "image":"CITY2.png"}, 
{"id":3, "name":"Leipzig", "description":"Leipzig  is the largest city in the federal state of Saxony, Germany. With a population of 570,087 inhabitants  it is Germany's tenth most populous city. Leipzig is located about 160 kilometers  southwest of Berlin at the confluence of the White Elster, Pleisse, and Parthe rivers at the southern end of the North German Plain. Leipzig has been a trade city since at least the time of the Holy Roman Empire. The city sits at the intersection of the Via Regia and Via Imperii, two important Medieval trade routes. Leipzig was once one of the major European centers of learning and culture in fields such as music and publishing. Leipzig became a major urban center within the German Democratic Republic  after World War II, but its cultural and economic importance declined despite East Germany being the richest economy in the Soviet Bloc. Leipzig later played a significant role in instigating the fall of communism in Eastern Europe, through events which took place in and around St. Nicholas Church. Since the reunification of Germany, Leipzig has undergone significant change with the restoration of some historical buildings, the demolition of others, and the development of a modern transport infrastructure. Leipzig today is an economic center and the most livable city in Germany, according to the GfK marketing research institution. Oper Leipzig is one of the most prominent opera houses in Germany, and Leipzig Zoological Garden is one of the most modern zoos in Europe and ranks first in Germany and second in Europe according to Anthony Sheridan. Leipzig is currently listed as Gamma World City and Germany's \"Boomtown\". Outside of Leipzig the Neuseenland district forms a huge lake area by approx 116 square miles .", "coordx": 217, "coordy": 114, "condition":[5,5], "buildingid":[3], "image":"CITY3.png"}, 
{"id":4, "name":"Berlin", "description":"Berlin  is the capital and the largest city of Germany as well as one of its 16 states. With a population of approximately 3.6 million people, Berlin is the second most populous city proper and the seventh most populous urban area in the European Union. Located in northeastern Germany on the banks of Rivers Spree and Havel, it is the centre of the Berlin-Brandenburg Metropolitan Region, which has about 6 million residents from more than 180 nations. Due to its location in the European Plain, Berlin is influenced by a temperate seasonal climate. Around one-third of the city's area is composed of forests, parks, gardens, rivers and lakes. First documented in the 13th century and situated at the crossing of two important historic trade routes, Berlin became the capital of the Margraviate of Brandenburg , the Kingdom of Prussia , the German Empire , the Weimar Republic  and the Third Reich . Berlin in the 1920s was the third largest municipality in the world. After World War II, the city was divided; East Berlin became the capital of East Germany while West Berlin became a de facto West German exclave, surrounded by the Berlin Wall  and East Germany territory. Following German reunification in 1990, Berlin was once again designated as the capital of united Germany. Berlin is a world city of culture, politics, media and science. Its economy is based on high-tech firms and the service sector, encompassing a diverse range of creative industries, research facilities, media corporations and convention venues. Berlin serves as a continental hub for air and rail traffic and has a highly complex public transportation network. The metropolis is a popular tourist destination. Significant industries also include IT, pharmaceuticals, biomedical engineering, clean tech, biotechnology, construction and electronics. Modern Berlin is home to world renowned universities, orchestras, museums, entertainment venues and is host to many sporting events. Its urban setting has made it a sought-after location for international film productions. The city is well known for its festivals, diverse architecture, nightlife, contemporary arts and a high quality of living. Over the last decade Berlin has seen the emergence of a cosmopolitan entrepreneurial scene.", "coordx": 219, "coordy": 111, "condition":[6,11,16,25], "buildingid":[4,8,12,15], "image":"CITY4.png"}, 
{"id":5, "name":"Charles University", "description":"There is no information available about this", "coordx": 220, "coordy": 117, "condition":[12], "buildingid":[5], "image":"CITY5.png"}, 
{"id":6, "name":"Bohemia", "description":"Bohemia  is the westernmost and largest historical region of the Czech lands in the present-day Czech Republic. In a broader meaning, Bohemia sometimes refers to the entire Czech territory, including Moravia and Czech Silesia, especially in a historical context, such as the Lands of the Bohemian Crown ruled by Bohemian kings. Bohemia was a duchy of Great Moravia, later an independent principality, a kingdom in the Holy Roman Empire, and subsequently a part of the Habsburg Monarchy and the Austrian Empire. After World War I and the establishment of an independent Czechoslovak state, Bohemia became a part of Czechoslovakia. Between 1938 and 1945, border regions with sizeable German-speaking minorities of all three Czech lands were joined to Nazi Germany as the Sudetenland. The remainder of Czech territory became the Second Czechoslovak Republic and was subsequently occupied as the Protectorate of Bohemia and Moravia, In 1969, the Czech lands  was given autonomy within Czechoslovakia as the Czech Socialist Republic. In 1990, the name was changed to the Czech Republic, which become a separate state in 1993 with the dissolution of Czechoslovakia. Until 1948, Bohemia was an administrative unit of Czechoslovakia as one of its \"lands\" . Since then, administrative reforms have replaced self-governing lands with a modified system of \"regions\"  which do not follow the borders of the historical Czech lands . However, the three lands are mentioned in the preamble of the Constitution of the Czech Republic: \"We, citizens of the Czech Republic in Bohemia, Moravia and Silesia…\" Bohemia has an area of 52,065 km2  and today is home to approximately 6.5 million of the Czech Republic's 10.5 million inhabitants. Bohemia is bordered in the south by Upper and Lower Austria , in the west by Bavaria and in the north by Saxony and Lusatia , in the northeast by Silesia , and in the east by Moravia . Bohemia's borders are mostly marked by mountain ranges such as the Bohemian Forest, the Ore Mountains, and the Krkonoše, a part of the Sudetes range; the Bohemian-Moravian border roughly follows the Elbe-Donau watershed.", "coordx": 221, "coordy": 117, "condition":[13], "buildingid":[6], "image":"CITY6.png"}, 
{"id":7, "name":"Łódź", "description":"Łódź  is the third-largest city in Poland. Located in the central part of the country, it had a population of 715,360 in 2013. It is the capital of Łódź Voivodeship, and is approximately 135 kilometres  south-west of Warsaw. The city's coat of arms is an example of canting: depicting a boat. It alludes to the city's name which translates literally as \"boat.\" Łódź was once a small settlement that first appeared in written records in around 1332. In the early 15th-century it was granted city rights, but remained a rather small and insubstantial town. It was the property of Kuyavian bishops and clergy until the end of the 18th century, when Łódź was annexed by Prussia as a result of the second partition of Poland. Following the collapse of the independent Duchy of Warsaw, the city became part of Congress Poland, a client state of the Russian Empire. It was then that Łódź experienced rapid growth in the cloth industry and in population due the inflow of migrants, most notably Germans and Jews. Ever since the industrialization of the area, the city has struggled with many difficulties such as multinationalism and social inequality, which were vividly documented in the novel The Promised Land written by Polish Nobel Prize-winning author Władysław Reymont. The contrasts greatly reflected on the architecture of the city, where luxurious mansions coexisted with redbrick factories and old tenement houses. After Poland regained its independence in 1918, Łódź grew to be one of the largest Polish cities and one of the most multicultural and industrial centers in Europe. The interbellum period saw rapid development in education and healthcare. After the invasion of Poland in 1939, the German Army captured the city and renamed it Litzmannstadt in honour of the German general Karl Litzmann, who was victorious near the area during World War I. The city's large Jewish population was forced into a walled zone known as the Łódź Ghetto, from which they were sent to German concentration and extermination camps. Following the liberation of the city by the Soviet Army, Łódź, which sustained insignificant damage during the war, became part of the newly established People's Republic of Poland. After years of prosperity during the socialist era, Łódź experienced decline after the fall of communism throughout Central and Eastern Europe. The city, however, is internationally known for its National Film School, a cradle for the most renowned Polish actors and directors, including Andrzej Wajda and Roman Polanski.", "coordx": 227, "coordy": 113, "condition":[18,18], "buildingid":[9], "image":"CITY7.png"}, 
{"id":8, "name":"United Kingdom", "description":"The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom  or Britain, is a sovereign state in Europe. Lying off the north-western coast of the European mainland, it includes the island of Great Britain , the north-eastern part of the island of Ireland, and many smaller islands. Northern Ireland is the only part of the UK that shares a land border with another sovereign state—the Republic of Ireland. Apart from this land border, the UK is surrounded by the Atlantic Ocean, with the North Sea to its east, the English Channel to its south and the Celtic Sea to its south-southwest, giving it the 12th longest coastline in the world. The Irish Sea lies between Great Britain and Ireland. With an area of 242,500 square kilometres , the UK is the 78th-largest sovereign state in the world and the 11th-largest in Europe. It is also the 21st-most populous country, with an estimated 65.1 million inhabitants. Together, this makes it the fourth most densely populated country in the European Union. The United Kingdom is a constitutional monarchy with a parliamentary system of governance. The monarch—since 6 February 1952—is Queen Elizabeth II. The capital of UK and its largest city is London, a global city and financial centre with an urban area population of 10.3 million, the fourth-largest in Europe and second-largest in the European Union. Other major urban areas in the UK include the regions of Manchester, Birmingham, Leeds, Glasgow and Liverpool. The UK consists of four countries, England, Scotland, Wales and Northern Ireland. The latter three have devolved administrations, each with varying powers, based in their capitals, Edinburgh, Cardiff, and Belfast, respectively. The nearby Isle of Man, Bailiwick of Guernsey and Bailiwick of Jersey are not part of the United Kingdom, being Crown dependencies with the British Government responsible for defence and international representation. The relationships among the countries of the United Kingdom have changed over time. Wales was annexed by the Kingdom of England under the Acts of Union of 1536 and 1542. A treaty between England and Scotland resulted in 1707 in a unified Kingdom of Great Britain, which merged in 1801 with the Kingdom of Ireland to form the United Kingdom of Great Britain and Ireland. In 1922, five-sixths of Ireland seceded from the country, leaving the present formulation of the United Kingdom of Great Britain and Northern Ireland. There are fourteen British Overseas Territories. These are the remnants of the British Empire which, at its height in the 1920s, encompassed almost a quarter of the world's land mass and was the largest empire in history. British influence can be observed in the language, culture, and legal systems of many of its former colonies. The United Kingdom is a developed country and has the world's fifth-largest economy by nominal GDP and ninth-largest economy by purchasing power parity. The UK is considered to have a high-income economy and is categorised as very high in the Human Development Index, ranking 14th in the world. It was the world's first industrialised country and the world's foremost power during the 19th and early 20th centuries. The UK remains a great power with considerable economic, cultural, military, scientific, and political influence internationally. It is a recognised nuclear weapons state and its military expenditure ranks fourth or fifth in the world. The UK has been a permanent member of the United Nations Security Council since its first session in 1946. It has been a leading member state of the European Union  and its predecessor, the European Economic Community , since 1973. However, on 23 June 2016, a national referendum on the UK's membership of the EU resulted in a 51.9% vote to exit. The UK is also a member of the Commonwealth of Nations, the Council of Europe, the G7 finance ministers, the G7 forum, the G20, NATO, the Organisation for Economic Co-operation and Development , and the World Trade Organization .", "coordx": 199, "coordy": 114, "condition":[19], "buildingid":[10], "image":"CITY8.png"}, 
{"id":9, "name":"Philadelphia, Pennsylvania", "description":"Philadelphia  is the largest city in the Commonwealth of Pennsylvania and the fifth-most populous in the United States, with an estimated population in 2014 of 1,560,297. In the Northeastern United States, at the confluence of the Delaware and Schuylkill rivers, Philadelphia is the economic and cultural anchor of the Delaware Valley, a metropolitan area home to 7.2 million people and the eighth-largest combined statistical area in the United States. In 1682, William Penn founded the city to serve as capital of the Pennsylvania Colony. Philadelphia played an instrumental role in the American Revolution as a meeting place for the Founding Fathers of the United States, who signed the Declaration of Independence in 1776 and the Constitution in 1787. Philadelphia was one of the nation's capitals in the Revolutionary War, and served as temporary U.S. capital while Washington, D.C., was under construction. In the 19th century, Philadelphia became a major industrial center and railroad hub that grew from an influx of European immigrants. It became a prime destination for African-Americans in the Great Migration and surpassed two million occupants by 1950. Based on the similar shifts underway the nation's economy in the late 1960s Philadelphia experienced a loss of manufacturing companies and jobs to lower taxed regions of the USA and often overseas. As a result, the economic base of Philadelphia, which had historically been manufacturing, declined significantly. In addition, consolidation in several American industries  reduced the number of companies headquartered in Philadelphia. The economic impact of these changes would reduce Philadelphia's tax base and the resources of local government. Philadelphia struggled through a long period of adjustment to these economic changes, coupled with significant demographic change as wealthier residents moved into the nearby suburbs and more immigrants moved into the city. The city in fact approached bankruptcy in the late 1980s. Revitalization began in the late 1990s, with gentrification turning around many neighborhoods and reversing its decades-long trend of population loss. The area's many universities and colleges make Philadelphia a top international study destination, as the city has evolved into an educational and economic hub. With a gross domestic product of $388 billion, Philadelphia ranks ninth among world cities and fourth in the nation. Philadelphia is the center of economic activity in Pennsylvania and is home to seven Fortune 1000 companies. The Philadelphia skyline is growing, with a market of almost 81,900 commercial properties in 2016 including several nationally prominent skyscrapers. The city is known for its arts, culture, and history, attracting over 39 million domestic tourists in 2013. Philadelphia has more outdoor sculptures and murals than any other American city, and Fairmount Park is the largest landscaped urban park in the world. The 67 National Historic Landmarks in the city helped account for the $10 billion generated by tourism. Philadelphia is the birthplace of the United States Marine Corps, and is also the home of many U.S. firsts, including the first library , first hospital  and medical school , first Capitol , first stock exchange , first zoo , and first business school . Philadelphia is the only World Heritage City in the United States.", "coordx": 93, "coordy": 137, "condition":[20], "buildingid":[11], "image":"CITY9.png"}, 
{"id":10, "name":"Los Angeles, California", "description":" and City of Los Angeles . Los Angeles , officially the City of Los Angeles and often known by its initials L.A., is the second-largest city in the United States after New York City, the most populous city in California, and the county seat of Los Angeles County. Situated in Southern California, Los Angeles is known for its mediterranean climate, ethnic diversity, sprawling metropolis, and as a major center of the American entertainment industry. Los Angeles lies in a large coastal basin surrounded on three sides by mountains reaching up to and over 10,000 feet . Historically home to the Chumash and Tongva, Los Angeles was claimed by Juan Rodríguez Cabrillo for Spain in 1542 along with the rest of what would become Alta California. The city was officially founded on September 4, 1781, by Spanish governor Felipe de Neve. It became a part of Mexico in 1821 following the Mexican War of Independence. In 1848, at the end of the Mexican–American War, Los Angeles and the rest of California were purchased as part of the Treaty of Guadalupe Hidalgo, thereby becoming part of the United States. Los Angeles was incorporated as a municipality on April 4, 1850, five months before California achieved statehood. The city experienced rapid growth with the discovery of oil. The city is the focal point of the larger Los Angeles metropolitan area and the Greater Los Angeles Area region, which contain 13 million and over 18 million people, respectively, as of 2010, making it one of the most populous metropolitan areas in the world as well as the second-largest in the United States. Los Angeles is the seat of Los Angeles County, the most populated county in the United States. The city's inhabitants are referred to as Angelenos. Nicknamed the \"City of Angels\", Los Angeles is a global city with a diverse economy in entertainment, culture, media, fashion, science, sports, technology, education, medicine and research. It has been ranked sixth in the Global Cities Index and 9th Global Economic Power Index. The city is home to renowned institutions covering a broad range of professional and cultural fields and is one of the most substantial economic engines within the United States. The Los Angeles combined statistical area  has a gross metropolitan product  of $831 billion , making it the third-largest in the world, after the Greater Tokyo and New York metropolitan areas. Los Angeles includes Hollywood and leads the world in the creation of television productions and recorded music; it is also one of the leaders in motion picture production. L.A. hosted the Summer Olympic Games in 1932 and 1984 and is currently bidding to host the 2024 Summer Olympics.", "coordx": 31, "coordy": 148, "condition":[23], "buildingid":[13], "image":"CITY10.png"}, 
{"id":11, "name":"Kemaliye", "description":"Kemaliye   is both a town in and one of the nine districts of Erzincan Province in the Eastern Anatolia region of Turkey. The town is known for its historic architecture, including many Ottoman-era houses. It is also notable for its commanding view of the river Karasu  flowing south through a gorge above the Keban dam.", "coordx": 254, "coordy": 139, "condition":[26,29], "buildingid":[14,17], "image":"CITY11.png"}, 
{"id":12, "name":"Austria-Hungary", "description":"Austria-Hungary , also known by  and often referred to as the Austro-Hungarian Empire in English-language sources, was a constitutional union of the Austrian Empire  and the Kingdom of Hungary  that existed from 1867 to 1918, when it collapsed as a result of defeat in World War I. The union was a result of the Austro-Hungarian Compromise of 1867 and came into existence on 30 March 1867, when the compromise was ratified by the Hungarian parliament. Austria-Hungary consisted of two monarchies , and one autonomous region: the Kingdom of Croatia-Slavonia under the Hungarian crown, which negotiated the Croatian–Hungarian Settlement  in 1868. It was ruled by the House of Habsburg, and constituted the last phase in the constitutional evolution of the Habsburg Monarchy. Following the 1867 reforms, the Austrian and the Hungarian states were co-equal. The Compromise required regular renewal, as did the customs union between the two components of the union. Foreign affairs and the military came under joint oversight, but all other governmental faculties were divided between respective states. Austria-Hungary was a multinational state and one of the world's great powers at the time. Austria-Hungary was geographically the second-largest country in Europe after the Russian Empire, at 621,538 km2 , and the third-most populous . The Empire built up the fourth-largest machine building industry of the world, after the United States, Germany, and the United Kingdom of Great Britain and Ireland. Austria-Hungary also became the world's third largest manufacturer and exporter of electric home appliances, electric industrial appliances and power generation apparatuses for power plants, after the United States and the German Empire. After 1878, Bosnia and Herzegovina was under Austro-Hungarian military and civilian rule until it was fully annexed in 1908, provoking the Bosnian crisis among the other powers. Sandžak/Raška, de jure northern part of the Ottoman Sanjak of Novi Pazar, was also under de facto joint occupation during that period but the Austro-Hungarian army withdrew as part of their annexation of Bosnia. The annexation of Bosnia also led to Islam being recognized as an official state religion due to Bosnia's Muslim population. Austria-Hungary was one of the Central Powers in World War I. It was already effectively dissolved by the time the military authorities signed the armistice of Villa Giusti on November 3, 1918. The Kingdom of Hungary and the First Austrian Republic were treated as its successors de jure, whereas the independence of the West Slavs and South Slavs of the Empire as the First Czechoslovak Republic, the Second Polish Republic and the Kingdom of Yugoslavia, respectively, and most of the territorial demands of the Kingdom of Romania were also recognized by the victorious powers in 1920.", "coordx": 223, "coordy": 121, "condition":[31], "buildingid":[16], "image":"CITY12.png"}],
"dialoguenodes":[{"id":75, "dialogueline":"I want my lawyer", "eventid":"-1", "dialoguetype": 0, "children": [76,78,90,96,108,109], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":109, "dialogueline":"Louis J. Mordell is know for subject. american jews", "eventid":"64", "dialoguetype": 0, "children": [75], "condition":[-1], "option":"Do you recall any information about one of the suspects?", "isroot": false}, 
{"id":108, "dialogueline":"I am know for subject. category:american physicists", "eventid":"63", "dialoguetype": 0, "children": [], "condition":[62], "option":"I need a lead. Do you know some information about one of the suspects?", "isroot": false}, 
{"id":96, "dialogueline":"I am know for field. physics", "eventid":"51", "dialoguetype": 0, "children": [], "condition":[50], "option":"Do you know any information about one of the suspects?", "isroot": false}, 
{"id":90, "dialogueline":"What, birthplace? I don't know anything about that.", "eventid":"45", "dialoguetype": 0, "children": [], "condition":[44], "option":"I need some cooperation. Do you have some information about one of the suspects?", "isroot": false}, 
{"id":78, "dialogueline":"I am know for doctoraladvisor. hermann staudinger", "eventid":"33", "dialoguetype": 0, "children": [], "condition":[32], "option":"I could use your cooperation. Do you remember any information about one of the suspects?", "isroot": false}, 
{"id":76, "dialogueline":"You'll find nothing.", "eventid":"-1", "dialoguetype": 0, "children": [75], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":66, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 0, "children": [67,98,100,102,116], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":116, "dialogueline":"I am know for doctoraladvisor. hans frauenfelder", "eventid":"71", "dialoguetype": 0, "children": [], "condition":[70], "option":"Do you know any information about one of the suspects?", "isroot": false}, 
{"id":102, "dialogueline":"What, birthplace? I don't know anything about that.", "eventid":"57", "dialoguetype": 0, "children": [], "condition":[56], "option":"Do you know some information about one of the suspects?", "isroot": false}, 
{"id":100, "dialogueline":"I am know for subject. category:american physicists", "eventid":"55", "dialoguetype": 0, "children": [], "condition":[54], "option":"Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":98, "dialogueline":"I am know for field. physics", "eventid":"53", "dialoguetype": 0, "children": [], "condition":[52], "option":"Would you give me some information about one of the suspects?", "isroot": false}, 
{"id":67, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [66], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":54, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [63,65,103], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":103, "dialogueline":"Ferdinand Georg Frobenius is know for field. mathematics", "eventid":"58", "dialoguetype": 0, "children": [105], "condition":[-1], "option":"Do you have any information about one of the suspects?", "isroot": false}, 
{"id":105, "dialogueline":"Jan Tesánek is know for subject. people from brandýs nad labem-stará boleslav", "eventid":"60", "dialoguetype": 0, "children": [107], "condition":[58], "option":"Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":107, "dialogueline":"Leopold Ružička is know for subject. category:eth zurich faculty", "eventid":"62", "dialoguetype": 0, "children": [54], "condition":[60], "option":"Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":65, "dialogueline":"Where I live is not your business!", "eventid":"-1", "dialoguetype": 2, "children": [54], "condition":[], "option":"Where is your current residence? It might be important to the case.", "isroot": false}, 
{"id":63, "dialogueline":"I would look in the Library if I were you. You might find something.", "eventid":"-1", "dialoguetype": 0, "children": [64], "condition":[], "option":"<Ask about American physicists>", "isroot": false}, 
{"id":64, "dialogueline":"It is located in in Berlin. Try there.", "eventid":"25", "dialoguetype": 0, "children": [54], "condition":[], "option":"Where could I see the Library?", "isroot": false}, 
{"id":51, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 0, "children": [52,82,92,99,110,114], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":114, "dialogueline":"I am know for doctoraladvisor. henry frederick baker", "eventid":"69", "dialoguetype": 0, "children": [], "condition":[68], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":110, "dialogueline":"I am know for subject. american jews", "eventid":"65", "dialoguetype": 0, "children": [], "condition":[64], "option":"I need some help. Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":99, "dialogueline":"Muzaffer Atac is know for subject. category:american physicists", "eventid":"54", "dialoguetype": 0, "children": [101], "condition":[-1], "option":"I need some assistance. Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":101, "dialogueline":"Muzaffer Atac has for birthplace", "eventid":"56", "dialoguetype": 0, "children": [51], "condition":[54], "option":"Do you recall some information about one of the suspects?", "isroot": false}, 
{"id":92, "dialogueline":"What, birthplace? I don't know anything about that.", "eventid":"47", "dialoguetype": 0, "children": [], "condition":[46], "option":"I could use some help. Would you tell me some information about one of the suspects?", "isroot": false}, 
{"id":82, "dialogueline":"I am know for field. mathematics", "eventid":"37", "dialoguetype": 0, "children": [], "condition":[36], "option":"I need some cooperation. Do you know any information about one of the suspects?", "isroot": false}, 
{"id":52, "dialogueline":"You have no proof.", "eventid":"-1", "dialoguetype": 0, "children": [51], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":36, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [49,50,97], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":97, "dialogueline":"Muzaffer Atac is know for field. physics", "eventid":"52", "dialoguetype": 0, "children": [36], "condition":[-1], "option":"I could use a lead. Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":50, "dialogueline":"Why do you want to know? Show me your badge!", "eventid":"-1", "dialoguetype": 3, "children": [36], "condition":[], "option":"What can you tell me about yourself?", "isroot": false}, 
{"id":49, "dialogueline":"Hello", "eventid":"20", "dialoguetype": 0, "children": [36], "condition":[], "option":"<Ask about Louis J. Mordell>", "isroot": false}, 
{"id":44, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [45], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":45, "dialogueline":"Get out", "eventid":"-1", "dialoguetype": 0, "children": [44], "condition":[], "option":"I'm looking for Louis J. Mordell?...", "isroot": false}, 
{"id":35, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [46,47,48,93], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":93, "dialogueline":"Jan Tesánek is know for doctoraladvisor. joseph stepling", "eventid":"48", "dialoguetype": 0, "children": [95], "condition":[-1], "option":"Do you have some information about one of the suspects?", "isroot": false}, 
{"id":95, "dialogueline":"Leopold Ružička is know for field. biochemistry", "eventid":"50", "dialoguetype": 0, "children": [35], "condition":[48], "option":"Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":48, "dialogueline":"I'm not going to answer that!", "eventid":"-1", "dialoguetype": 3, "children": [35], "condition":[], "option":"What are you most known for?", "isroot": false}, 
{"id":47, "dialogueline":"I reside at 22-rdf-syntax-ns#langString.", "eventid":"-1", "dialoguetype": 2, "children": [35], "condition":[], "option":"Where do you live? It might provide clues.", "isroot": false}, 
{"id":46, "dialogueline":"Hello", "eventid":"19", "dialoguetype": 0, "children": [35], "condition":[], "option":"<Ask about H. F. Baker>", "isroot": false}, 
{"id":32, "dialogueline":"You can't prove anything!", "eventid":"-1", "dialoguetype": 0, "children": [33,86,87,88,94,106], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":106, "dialogueline":"I am know for subject. people from brandýs nad labem-stará boleslav", "eventid":"61", "dialoguetype": 0, "children": [], "condition":[60], "option":"I could use a lead. Do you know some information about one of the suspects?", "isroot": false}, 
{"id":94, "dialogueline":"I am know for doctoraladvisor. joseph stepling", "eventid":"49", "dialoguetype": 0, "children": [], "condition":[48], "option":"Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":88, "dialogueline":"I am know for field. mathematics", "eventid":"43", "dialoguetype": 0, "children": [], "condition":[42], "option":"I could use your assistance. Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":87, "dialogueline":"Jan Tesánek is know for field. mathematics", "eventid":"42", "dialoguetype": 0, "children": [89], "condition":[-1], "option":"Could you tell me any information about one of the suspects?", "isroot": false}, 
{"id":89, "dialogueline":"Leopold Ružička has for birthplace", "eventid":"44", "dialoguetype": 0, "children": [32], "condition":[42], "option":"I could use a lead. Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":86, "dialogueline":"What, birthplace? I don't know anything about that.", "eventid":"41", "dialoguetype": 0, "children": [], "condition":[40], "option":"Do you know some information about one of the suspects?", "isroot": false}, 
{"id":33, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [32], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":30, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [31], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":31, "dialogueline":"Hi", "eventid":"13", "dialoguetype": 0, "children": [30], "condition":[], "option":"<Ask about Jan Tesánek>", "isroot": false}, 
{"id":21, "dialogueline":"I don't have to speak to you", "eventid":"-1", "dialoguetype": 0, "children": [22,80,81,84,104,112], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":112, "dialogueline":"What, birthplace? I don't know anything about that.", "eventid":"67", "dialoguetype": 0, "children": [], "condition":[66], "option":"I could use some help. Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":104, "dialogueline":"I am know for field. mathematics", "eventid":"59", "dialoguetype": 0, "children": [], "condition":[58], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":84, "dialogueline":"I am know for doctoraladvisor. ernst kummer", "eventid":"39", "dialoguetype": 0, "children": [], "condition":[38], "option":"Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":81, "dialogueline":"Louis J. Mordell is know for field. mathematics", "eventid":"36", "dialoguetype": 0, "children": [21], "condition":[-1], "option":"Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":80, "dialogueline":"I am know for subject. people from berlin", "eventid":"35", "dialoguetype": 0, "children": [], "condition":[34], "option":"I need a lead. Do you have some information about one of the suspects?", "isroot": false}, 
{"id":22, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [21], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":17, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [18], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":18, "dialogueline":"I have no idea what you're talking about", "eventid":"-1", "dialoguetype": 0, "children": [17], "condition":[], "option":"I'm looking for Ferdinand Georg Frobenius?...", "isroot": false}, 
{"id":3, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [19,20,79], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":79, "dialogueline":"Ferdinand Georg Frobenius is know for subject. people from berlin", "eventid":"34", "dialoguetype": 0, "children": [3], "condition":[-1], "option":"Do you remember any information about one of the suspects?", "isroot": false}, 
{"id":20, "dialogueline":"I don't have to answer that...", "eventid":"-1", "dialoguetype": 2, "children": [3], "condition":[], "option":"Do you live anywhere associated with this?", "isroot": false}, 
{"id":19, "dialogueline":"May I help?", "eventid":"6", "dialoguetype": 0, "children": [3], "condition":[], "option":"<Ask about Ferdinand Georg Frobenius>", "isroot": false}, 
{"id":2, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [13,14,15], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":15, "dialogueline":"I'm not going to answer that!", "eventid":"-1", "dialoguetype": 3, "children": [2], "condition":[], "option":"What are you most known for?", "isroot": false}, 
{"id":14, "dialogueline":"I reside at 22-rdf-syntax-ns#langString.", "eventid":"-1", "dialoguetype": 2, "children": [2], "condition":[], "option":"Where is your current residence? It might be important to the case.", "isroot": false}, 
{"id":13, "dialogueline":"Hi", "eventid":"5", "dialoguetype": 0, "children": [2], "condition":[], "option":"<Ask about Gottfried Wilhelm Leibniz>", "isroot": false}, 
{"id":1, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [11,12,77], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":77, "dialogueline":"Leopold Ružička is know for doctoraladvisor. hermann staudinger", "eventid":"32", "dialoguetype": 0, "children": [1], "condition":[-1], "option":"Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":12, "dialogueline":"I live in 22-rdf-syntax-ns#langString.", "eventid":"-1", "dialoguetype": 2, "children": [1], "condition":[], "option":"Do you live anywhere associated with this?", "isroot": false}, 
{"id":11, "dialogueline":"May I help?", "eventid":"4", "dialoguetype": 0, "children": [1], "condition":[], "option":"<Ask about Mário Ferreira dos Santos>", "isroot": false}, 
{"id":70, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [71,111], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":111, "dialogueline":"Ferdinand Georg Frobenius has for birthplace", "eventid":"66", "dialoguetype": 0, "children": [113], "condition":[-1], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":113, "dialogueline":"Louis J. Mordell is know for doctoraladvisor. henry frederick baker", "eventid":"68", "dialoguetype": 0, "children": [115], "condition":[66], "option":"I need some assistance. Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":115, "dialogueline":"Muzaffer Atac is know for doctoraladvisor. hans frauenfelder", "eventid":"70", "dialoguetype": 0, "children": [70], "condition":[68], "option":"Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":71, "dialogueline":"Are you sure you need me?", "eventid":"27", "dialoguetype": 0, "children": [72], "condition":[], "option":"Hello, I'm a private investigator following the victim's case. I'm sorry to disturb, I would appreciate it if you answer some questions for me.", "isroot": false}, 
{"id":72, "dialogueline":"I am called Josiah Willard Gibbs.", "eventid":"28", "dialoguetype": 0, "children": [73], "condition":[], "option":"Please, could you tell me your name?", "isroot": false}, 
{"id":73, "dialogueline":"If I recall correctly, the victim talked about a thing named $placeName$.", "eventid":"29", "dialoguetype": 0, "children": [74], "condition":[], "option":"Is there anything specific you recall that might be valuable to the investigation?", "isroot": false}, 
{"id":74, "dialogueline":"I am suspicious of Leopold Ružička.", "eventid":"30", "dialoguetype": 0, "children": [70], "condition":[], "option":"I would like a lead. Do you have any more information?", "isroot": false}, 
{"id":56, "dialogueline":"Hi. May I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [57], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":57, "dialogueline":"Of course.", "eventid":"21", "dialoguetype": 0, "children": [58], "condition":[], "option":"Hello, I'm a private investigator. Please could you help answer some questions?", "isroot": false}, 
{"id":58, "dialogueline":"I am called Alternating current.", "eventid":"22", "dialoguetype": 0, "children": [59], "condition":[], "option":"Who are you?", "isroot": false}, 
{"id":59, "dialogueline":"Last I thought, the victim was seen with Sean M. Carroll. Perhaps they know something.", "eventid":"23", "dialoguetype": 0, "children": [60,61], "condition":[], "option":"Did the victim remark something specific that you can remember?", "isroot": false}, 
{"id":61, "dialogueline":"I am suspicious of Muzaffer Atac.", "eventid":"24", "dialoguetype": 0, "children": [56], "condition":[], "option":"I could use your help. Do you have any more information?", "isroot": false}, 
{"id":60, "dialogueline":"Someone told me Sean M. Carroll visited Los Angeles, California. I'm afraid that's all I know.", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"If you don't mind, where can I locate Sean M. Carroll? I would appreciate it.", "isroot": false}, 
{"id":38, "dialogueline":"Hi. How may I help you?", "eventid":"-1", "dialoguetype": 0, "children": [39], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":39, "dialogueline":"Okay.", "eventid":"14", "dialoguetype": 0, "children": [40], "condition":[], "option":"Hello, I'm working on the victim's case. Thank you for your time, I have some questions for you.", "isroot": false}, 
{"id":40, "dialogueline":"I am called Patent examiner.", "eventid":"15", "dialoguetype": 0, "children": [41], "condition":[], "option":"Please, will you tell me your name?", "isroot": false}, 
{"id":41, "dialogueline":"I think the victim talked about a thing known as $placeName$.", "eventid":"16", "dialoguetype": 0, "children": [42], "condition":[], "option":"Do you have anything that might be useful to the investigation?", "isroot": false}, 
{"id":42, "dialogueline":"I believe Louis J. Mordell could be guilty.", "eventid":"17", "dialoguetype": 0, "children": [38], "condition":[], "option":"I could use a lead. Do you have any more information?", "isroot": false}, 
{"id":25, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [26,91], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":91, "dialogueline":"Louis J. Mordell has for birthplace", "eventid":"46", "dialoguetype": 0, "children": [25], "condition":[-1], "option":"Do you remember any information about one of the suspects?", "isroot": false}, 
{"id":26, "dialogueline":"Of course.", "eventid":"7", "dialoguetype": 0, "children": [27], "condition":[], "option":"Greetings, I'm a private investigator assigned to the victim's case. If it's not too much trouble, I have some questions for you.", "isroot": false}, 
{"id":27, "dialogueline":"Yes, I'm Upton Sinclair.", "eventid":"8", "dialoguetype": 0, "children": [28], "condition":[], "option":"Please, could you tell me your name?", "isroot": false}, 
{"id":28, "dialogueline":"The victim mentioned a thing called $placeName$.", "eventid":"9", "dialoguetype": 0, "children": [29], "condition":[], "option":"Did the victim suggest something specific that you can recollect?", "isroot": false}, 
{"id":29, "dialogueline":"I am suspicious of Jan Tesánek. However, It is tough to say.", "eventid":"10", "dialoguetype": 0, "children": [25], "condition":[], "option":"I would like your help. Can you think of anybody who has a reason to do this?", "isroot": false}, 
{"id":5, "dialogueline":"Hello?", "eventid":"-1", "dialoguetype": 0, "children": [6,83], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":83, "dialogueline":"Ferdinand Georg Frobenius is know for doctoraladvisor. ernst kummer", "eventid":"38", "dialoguetype": 0, "children": [85], "condition":[-1], "option":"Do you know some information about one of the suspects?", "isroot": false}, 
{"id":85, "dialogueline":"Jan Tesánek has for birthplace", "eventid":"40", "dialoguetype": 0, "children": [5], "condition":[38], "option":"I need a lead. Do you recall any information about one of the suspects?", "isroot": false}, 
{"id":6, "dialogueline":"Are you sure you need me?", "eventid":"0", "dialoguetype": 0, "children": [7], "condition":[], "option":"Greetings, I'm investigating the victim's case. If it's not too much trouble, I have some questions for you.", "isroot": false}, 
{"id":7, "dialogueline":"Okay, I am known as Leon Botstein.", "eventid":"1", "dialoguetype": 0, "children": [8], "condition":[], "option":"Please, tell me your name.", "isroot": false}, 
{"id":8, "dialogueline":"the victim was seen with Baruch Spinoza.", "eventid":"2", "dialoguetype": 0, "children": [9,10], "condition":[], "option":"Did the victim comment on something that you can recollect?", "isroot": false}, 
{"id":10, "dialogueline":"I believe Ferdinand Georg Frobenius could be connected. However, It is hard to say.", "eventid":"3", "dialoguetype": 0, "children": [5], "condition":[], "option":"I would like your help. Do you have any more information?", "isroot": false}, 
{"id":9, "dialogueline":"I believe Baruch Spinoza was travelling to Amsterdam. I hope that helps.", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"If you don't mind helping, where might I find Baruch Spinoza? I would appreciate it.", "isroot": false}],
"crime":{"suspects":[4,8,14,19,22],"culprit":22,"facts":[{"pid":4,"factoid":"Ferdinand Georg Frobenius is know for subject. people from berlin","condition":34},{"pid":4,"factoid":"Ferdinand Georg Frobenius has for birthplace","condition":66},{"pid":4,"factoid":"Ferdinand Georg Frobenius is know for doctoraladvisor. ernst kummer","condition":38},{"pid":4,"factoid":"Ferdinand Georg Frobenius is know for field. mathematics","condition":58},{"pid":8,"factoid":"Jan Tesánek is know for subject. people from brandýs nad labem-stará boleslav","condition":60},{"pid":8,"factoid":"Jan Tesánek has for birthplace","condition":40},{"pid":8,"factoid":"Jan Tesánek is know for doctoraladvisor. joseph stepling","condition":48},{"pid":8,"factoid":"Jan Tesánek is know for field. mathematics","condition":42},{"pid":14,"factoid":"Louis J. Mordell is know for subject. american jews","condition":64},{"pid":14,"factoid":"Louis J. Mordell has for birthplace","condition":46},{"pid":14,"factoid":"Louis J. Mordell is know for doctoraladvisor. henry frederick baker","condition":68},{"pid":14,"factoid":"Louis J. Mordell is know for field. mathematics","condition":36},{"pid":19,"factoid":"Muzaffer Atac is know for subject. category:american physicists","condition":54},{"pid":19,"factoid":"Muzaffer Atac has for birthplace","condition":56},{"pid":19,"factoid":"Muzaffer Atac is know for doctoraladvisor. hans frauenfelder","condition":70},{"pid":19,"factoid":"Muzaffer Atac is know for field. physics","condition":52},{"pid":22,"factoid":"Leopold Ružička is know for subject. category:eth zurich faculty","condition":62},{"pid":22,"factoid":"Leopold Ružička has for birthplace","condition":44},{"pid":22,"factoid":"Leopold Ružička is know for doctoraladvisor. hermann staudinger","condition":32},{"pid":22,"factoid":"Leopold Ružička is know for field. biochemistry","condition":50}]}}
