{
"people" : [
{"id":4, "name":"Chris Shinn", "description":"Chris Shinn is an American singer-songwriter and musician.  In March 2012 he joined the band Live as replacement for Ed Kowalczyk.", "drootid": 4, "condition":[], "buildingid":0, "image":"PERSON4.png"}, 
{"id":9, "name":"George Ellery Hale", "description":"George Ellery Hale  was an American solar astronomer, best known for his discovery of magnetic fields in sunspots, and as the leader or key figure in the planning or construction of several world-leading telescopes; namely, the 40-inch refracting telescope at Yerkes Observatory, 60-inch Hale reflecting telescope at Mount Wilson Observatory, 100-inch Hooker reflecting telescope at Mount Wilson, and the 200-inch Hale reflecting telescope at Palomar Observatory.", "drootid": 23, "condition":[], "buildingid":0, "image":"PERSON9.png"}, 
{"id":15, "name":"Christopher Nolan", "description":"Christopher Edward Nolan  is a British-American film director, screenwriter, producer, cinematographer and editor.  He is one of the highest-grossing directors in history, and among the most successful and acclaimed filmmakers of the 21st century.", "drootid": 40, "condition":[], "buildingid":0, "image":"PERSON15.png"}, 
{"id":20, "name":"Arnold Henry Bergier", "description":"Arnold Henry Bergier was an artist who created bronze sculptures.  He lived in New York.", "drootid": 56, "condition":[], "buildingid":0, "image":"PERSON20.png"}, 
{"id":28, "name":"Vincent", "description":"There is no information available for this character.", "drootid": 77, "condition":[], "buildingid":0, "image":"PERSON28.png"}, 
{"id":1, "name":"University of Illinois", "description":"The University of Illinois at Urbana–Champaign, also known as U of I, University of Illinois, UIUC , or simply Illinois, is a public research-intensive university in the U. S.", "drootid": 1, "condition":[2], "buildingid":1, "image":"PERSON1.png"}, 
{"id":2, "name":"Carl Woese", "description":"Carl Richard Woese  was an American microbiologist and biophysicist.  Woese is famous for defining the Archaea  in 1977 by phylogenetic taxonomy of 16S ribosomal RNA, a technique pioneered by Woese which revolutionized the discipline of microbiology.", "drootid": 2, "condition":[4], "buildingid":2, "image":"PERSON2.png"}, 
{"id":5, "name":"Adam", "description":"There is no information available for this character.", "drootid": 13, "condition":[4], "buildingid":2, "image":"PERSON5.png"}, 
{"id":3, "name":"Norman Joseph Woodland", "description":"Norman Joseph Woodland, also known as N.  Joseph Woodland and N.", "drootid": 18, "condition":[6], "buildingid":3, "image":"PERSON3.png"}, 
{"id":11, "name":"James", "description":"There is no information available for this character.", "drootid": 30, "condition":[12], "buildingid":5, "image":"PERSON11.png"}, 
{"id":10, "name":"Josh", "description":"There is no information available for this character.", "drootid": 24, "condition":[9], "buildingid":8, "image":"PERSON10.png"}, 
{"id":27, "name":"Boris Schreiber", "description":"Boris Schreiber  was a French writer.", "drootid": 98, "condition":[34], "buildingid":19, "image":"PERSON27.png"}, 
{"id":7, "name":"Erich Marcks", "description":"Erich Marcks  was a German general during World War II.  Marcks authored the first draft of the operational plan, Operation Draft East, for the invasion of the Soviet Union, advocating what was later known as A-A line as the goal for the Wehrmacht to achieve, within nine to seventeen weeks.", "drootid": 21, "condition":[11], "buildingid":6, "image":"PERSON7.png"}, 
{"id":8, "name":"Lee Davenport", "description":"Lee L.  Davenport  was an American physicist. He was a member of the MIT Radiation Laboratory during World War II, responsible for the development and deployment of the SCR-584 radar system. ", "drootid": 35, "condition":[13], "buildingid":7, "image":"PERSON8.png"}, 
{"id":13, "name":"Virginia Cherrill", "description":"Virginia Cherrill  was an American actress known for her role as the blind flower girl in Charlie Chaplin's City Lights .", "drootid": 38, "condition":[18], "buildingid":9, "image":"PERSON13.png"}, 
{"id":16, "name":"Florence Lee", "description":"Florence Lee  was an American actress of the silent era, who appeared in 100 films between 1911 and 1931.  She was born in Jamaica, Vermont and died in Hollywood, California at the age of 74.", "drootid": 46, "condition":[18], "buildingid":9, "image":"PERSON16.png"}, 
{"id":14, "name":"John Alwyne Kitching", "description":"John Alwyne Kitching OBE FRS  was a British biologist.  He was educated at Cheltenham College, Trinity College, Cambridge and the University of London.", "drootid": 51, "condition":[20], "buildingid":10, "image":"PERSON14.png"}, 
{"id":18, "name":"Fritz Lang", "description":"Friedrich Christian Anton \"Fritz\" Lang  was an Austrian-German filmmaker, screenwriter, and occasional film producer and actor.  One of the best-known émigrés from Germany's school of Expressionism, he was dubbed the \"Master of Darkness\" by the British Film Institute.", "drootid": 54, "condition":[25], "buildingid":13, "image":"PERSON18.png"}, 
{"id":21, "name":"Alphonse", "description":"There is no information available for this character.", "drootid": 57, "condition":[23], "buildingid":13, "image":"PERSON21.png"}, 
{"id":22, "name":"Mark", "description":"There is no information available for this character.", "drootid": 64, "condition":[25], "buildingid":13, "image":"PERSON22.png"}, 
{"id":24, "name":"Eugene Wigner", "description":" Eugene Paul \"E.  P.\" Wigner , was a Hungarian-American theoretical physicist and mathematician. ", "drootid": 73, "condition":[30], "buildingid":16, "image":"PERSON24.png"}, 
{"id":19, "name":"Arthur Rudolph", "description":"Arthur Louis Hugo Rudolph  was a German rocket engineer who played a key role in the development of the V-2 rocket during World War II.  After the war, he was brought to the United States by the Office of Strategic Services , subsequently becoming a pioneer of the United States space program.", "drootid": 70, "condition":[27], "buildingid":14, "image":"PERSON19.png"}, 
{"id":25, "name":"Frederick Seitz", "description":"Frederick Seitz  was an American physicist and a pioneer of solid state physics.  Seitz was president of Rockefeller University, and president of the United States National Academy of Sciences 1962–1969.", "drootid": 74, "condition":[32], "buildingid":17, "image":"PERSON25.png"}, 
{"id":29, "name":"Raphael", "description":"There is no information available for this character.", "drootid": 88, "condition":[32], "buildingid":17, "image":"PERSON29.png"}, 
{"id":26, "name":"the United States", "description":", US , USA , and United States .  The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.", "drootid": 75, "condition":[33], "buildingid":18, "image":"PERSON26.png"}, 
{"id":30, "name":"John", "description":"There is no information available for this character.", "drootid": 94, "condition":[33], "buildingid":18, "image":"PERSON30.png"}],
"items":[{"id":0, "name":"2012 in science", "description":"It is a list about 2012 in science. It says: The year 2012 involved many significant scientific events and discoveries, including the first orbital rendezvous by a commercial spacecraft, the discovery of a particle highly similar to the long-sought Higgs boson, and the near-eradication of guinea worm disease.  A total of 72 successful orbital spaceflights occurred in 2012, and the year also saw numerous developments in fields such as robotics, 3D printing, stem cell research and genetics.  The following people are mentioned:  Feldspar Norman Joseph Woodland Manhattan Project   And the following places: Switzerland and Atlantic City, New Jersey", "condition": [5], "eventid": 6, "buildingid":4, "image":"null"}, 
{"id":2, "name":"1908 births", "description":"It is a letter about 1908 births. It says: 1908 births.  The following people are mentioned:  Edward Teller John Alwyne Kitching   And the following place: Biblioteca universitaria di Edimburgo", "condition": [19], "eventid": 20, "buildingid":12, "image":"null"}, 
{"id":3, "name":"Woman in the Moon", "description":"It is a book about Woman in the Moon. It says: Woman in the Moon  is a science fiction silent film that premiered 15 October 1929 at the UFA-Palast am Zoo cinema in Berlin to an audience of 2,000.  It is often considered to be one of the first \"serious\" science fiction films.  The following people are mentioned:  Arthur Rudolph Alexa von Porembsky   And the following place: Stepfershausen", "condition": [26], "eventid": 27, "buildingid":15, "image":"null"}, 
{"id":1, "name":"City Lights", "description":"It is a book about City Lights. It says: City Lights is a 1931 American pre-Code silent romantic comedy film written, directed by, and starring Charlie Chaplin.  The story follows the misadventures of Chaplin's Tramp as he falls in love with a blind girl  and develops a turbulent friendship with an alcoholic millionaire .  The following people are mentioned:  Harry Myers Florence Lee Virginia Cherrill   And the following place: State of Illinois", "condition": [16], "eventid": 18, "buildingid":11, "image":"null"}, 
{"id":5, "name":"Flashlight", "description":"", "condition": [], "eventid": -1, "buildingid":10, "image":"null"}, 
{"id":4, "name":"Crowbar", "description":"", "condition": [], "eventid": -1, "buildingid":17, "image":"null"}],
"buildings":[{"id":0, "name":"House of Albert Einstein", "description":" and Swiss Confederation  Switzerland , officially the Swiss Confederation is a federal republic in Europe", "locktype": "null", "coordx": 254, "coordy": 137, "condition":[], "cityid":0, "peopleid":[4,9,15,20,28], "itemsid":[], "image":"BUILDING0.png"}, 
{"id":1, "name":"House of University of Illinois", "description":"East Knoyle is a village and civil parish in Wiltshire, in the south west of England The village lies just west of the A350 road about 9 miles  south of Warminster and 5 miles  north of Shaftesbury, Dorset", "locktype": "null", "coordx": 113, "coordy": 202, "condition":[2], "cityid":1, "peopleid":[1], "itemsid":[], "image":"BUILDING1.png"}, 
{"id":4, "name":"Planetarium", "description":" It is the birthplace of Sir Christopher Wren The parish includes the hamlets of Holloway, Milton, The Green, Underhill and Upton", "locktype": "null", "coordx": 91, "coordy": 271, "condition":[5], "cityid":1, "peopleid":[], "itemsid":[0], "image":"BUILDING4.png"}, 
{"id":12, "name":"University", "description":"East Knoyle is a village and civil parish in Wiltshire, in the south west of England The village lies just west of the A350 road about 9 miles  south of Warminster and 5 miles  north of Shaftesbury, Dorset", "locktype": "null", "coordx": 105, "coordy": 298, "condition":[19], "cityid":1, "peopleid":[], "itemsid":[2], "image":"BUILDING12.png"}, 
{"id":2, "name":"House of Carl Woese", "description":"Urbana /??r?bæn?/ is a city in and the county seat of Champaign County, Illinois, United States The population was 41,250 at the 2010 census", "locktype": "null", "coordx": 64, "coordy": 237, "condition":[4,4], "cityid":2, "peopleid":[2,5], "itemsid":[], "image":"BUILDING2.png"}, 
{"id":3, "name":"House of Norman Joseph Woodland", "description":" Atlantic City is a resort city in Atlantic County, New Jersey, United States, known for its casinos, boardwalk and beach", "locktype": "dark", "coordx": 292, "coordy": 79, "condition":[6], "cityid":3, "peopleid":[3], "itemsid":[], "image":"BUILDING3.png"}, 
{"id":5, "name":"Normandy landings", "description":" In 2010, it had a population of 39,558 Located on Absecon Island, it was incorporated on May 1, 1854, from portions of Egg Harbor Township and Galloway Township", "locktype": "null", "coordx": 81, "coordy": 147, "condition":[12,12], "cityid":3, "peopleid":[11], "itemsid":[], "image":"BUILDING5.png"}, 
{"id":8, "name":"Cottage", "description":"6 million people, Berlin is the second most populous city proper and the seventh most populous urban area in the European Union Located in northeastern Germany on the banks of Rivers Spree and Havel, it is the centre of the Berlin-Brandenburg Metropolitan Region, which has about 6 million residents from more than 180 nations", "locktype": "null", "coordx": 340, "coordy": 185, "condition":[9,9,9], "cityid":4, "peopleid":[10], "itemsid":[], "image":"BUILDING8.png"}, 
{"id":19, "name":"House of Boris Schreiber", "description":" Due to its location in the European Plain, Berlin is influenced by a temperate seasonal climate Around one-third of the city's area is composed of forests, parks, gardens, rivers and lakes", "locktype": "null", "coordx": 263, "coordy": 220, "condition":[34], "cityid":4, "peopleid":[27], "itemsid":[], "image":"BUILDING19.png"}, 
{"id":6, "name":"House of Erich Marcks", "description":"Schöneberg is a locality of Berlin, Germany Until Berlin's 2001 administrative reform it was a separate borough including the locality of Friedenau", "locktype": "null", "coordx": 128, "coordy": 168, "condition":[11], "cityid":5, "peopleid":[7], "itemsid":[], "image":"BUILDING6.png"}, 
{"id":7, "name":"House of Lee Davenport", "description":"Schenectady /sk??n?kt?di/  is a city in Schenectady County, New York, United States, of which it is the county seat As of the 2010 census, the city had a population of 66,135", "locktype": "null", "coordx": 66, "coordy": 235, "condition":[13], "cityid":6, "peopleid":[8], "itemsid":[], "image":"BUILDING7.png"}, 
{"id":15, "name":"Hospital", "description":" The name \"Schenectady\" is derived from a Mohawk word skahnéhtati meaning \"beyond the pines\" The city was founded on the south side of the Mohawk River by Dutch colonists in the 17th century, many from the Albany area", "locktype": "chain", "coordx": 64, "coordy": 169, "condition":[26], "cityid":6, "peopleid":[], "itemsid":[3], "image":"BUILDING15.png"}, 
{"id":9, "name":"House of Virginia Cherrill", "description":"Illinois  is a state in the midwestern region of the United States, achieving statehood in 1818 It is the 5th most populous state and 25th largest state in terms of land area, and is often noted as a microcosm of the entire country", "locktype": "null", "coordx": 71, "coordy": 105, "condition":[18,18], "cityid":7, "peopleid":[13,16], "itemsid":[], "image":"BUILDING9.png"}, 
{"id":11, "name":"Police Station", "description":" With Chicago in the northeast, small industrial cities and great agricultural productivity in central and northern Illinois, and natural resources like coal, timber, and petroleum in the south, Illinois has a diverse economic base and is a major transportation hub The Port of Chicago connects the state to other global ports from the Great Lakes, via the Saint Lawrence Seaway, to the Atlantic Ocean, as well as the Great Lakes to the Mississippi River, via the Illinois River", "locktype": "null", "coordx": 165, "coordy": 241, "condition":[16], "cityid":7, "peopleid":[], "itemsid":[1], "image":"BUILDING11.png"}, 
{"id":10, "name":"House of John Alwyne Kitching", "description":"Edinburgh University Library is one of the most important libraries of Scotland It is located in Edinburgh", "locktype": "null", "coordx": 316, "coordy": 295, "condition":[20], "cityid":8, "peopleid":[14], "itemsid":[5], "image":"BUILDING10.png"}, 
{"id":13, "name":"House of Fritz Lang", "description":"Austria-Hungary , also known by  and often referred to as the Austro-Hungarian Empire in English-language sources, was a constitutional union of the Austrian Empire  and the Kingdom of Hungary  that existed from 1867 to 1918, when it collapsed as a result of defeat in World War I The union was a result of the Austro-Hungarian Compromise of 1867 and came into existence on 30 March 1867, when the compromise was ratified by the Hungarian parliament", "locktype": "null", "coordx": 237, "coordy": 136, "condition":[23,25,23,25], "cityid":9, "peopleid":[18,21,22], "itemsid":[], "image":"BUILDING13.png"}, 
{"id":16, "name":"House of Eugene Wigner", "description":" Austria-Hungary consisted of two monarchies , and one autonomous region: the Kingdom of Croatia-Slavonia under the Hungarian crown, which negotiated the Croatian–Hungarian Settlement  in 1868 It was ruled by the House of Habsburg, and constituted the last phase in the constitutional evolution of the Habsburg Monarchy", "locktype": "null", "coordx": 292, "coordy": 264, "condition":[30], "cityid":9, "peopleid":[24], "itemsid":[], "image":"BUILDING16.png"}, 
{"id":14, "name":"House of Arthur Rudolph", "description":"Stepfershausen is a municipality in the district Schmalkalden-Meiningen, in Thuringia, Germany", "locktype": "null", "coordx": 320, "coordy": 74, "condition":[27], "cityid":11, "peopleid":[19], "itemsid":[], "image":"BUILDING14.png"}, 
{"id":17, "name":"House of Frederick Seitz", "description":", US , USA , and United States  The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions", "locktype": "null", "coordx": 147, "coordy": 200, "condition":[32,32], "cityid":13, "peopleid":[25,29], "itemsid":[4], "image":"BUILDING17.png"}, 
{"id":18, "name":"House of the United States", "description":"The 48 contiguous states and federal district are in central North America between Canada and Mexico, with the state of Alaska in the northwestern part of North America and the state of Hawaii comprising an archipelago in the mid-Pacific The territories are scattered about the Pacific Ocean and the Caribbean Sea", "locktype": "null", "coordx": 279, "coordy": 100, "condition":[33,33], "cityid":13, "peopleid":[26,30], "itemsid":[], "image":"BUILDING18.png"}],
"cities":[{"id":0, "name":"Switzerland", "description":" and Swiss Confederation . Switzerland , officially the Swiss Confederation is a federal republic in Europe. While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\" . The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2 . While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zürich and Geneva. The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. The country has a history of armed neutrality going back to the Reformation, it has not been in a state of war internationally since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. In addition to being the birthplace of the Red Cross, Switzerland is home to numerous international organisations, including the second largest UN office. On the European level, it is a founding member of the European Free Trade Association, but notably it is not part of the European Union, nor the European Economic Area. However, the country does participate in the Schengen Area and the EU's single market through a number of bilateral treaties. Spanning the intersection of Germanic and Romance Europe, Switzerland comprises four main linguistic and cultural regions: German, French, Italian and Romansh. Although the majority of the population are German speaking, Swiss national identity is rooted in a common historical background, shared values such as federalism and direct democracy, and Alpine symbolism. Due to its linguistic diversity, Switzerland is known by a variety of native names: Schweiz [??va?ts] ; Suisse [s?is] ; Svizzera [?zvittsera] ; and Svizra [??vi?tsr?] or [??vi?ts???] . On coins and stamps, Latin  is used instead of the four living languages. Switzerland is one of the most developed countries in the world, with the highest nominal wealth per adult and the eighth-highest per capita gross domestic product according to the IMF. Switzerland ranks at or near the top globally in several metrics of national performance, including government transparency, civil liberties, quality of life, economic competitiveness, and human development. Zürich and Geneva have each been ranked among the top cities in the world in terms of quality of life, with the former ranked second globally, according to Mercer.", "coordx": 210, "coordy": 124, "condition":[], "buildingid":[0], "image":"CITY0.png"}, 
{"id":1, "name":"East Knoyle", "description":"East Knoyle is a village and civil parish in Wiltshire, in the south west of England. The village lies just west of the A350 road about 9 miles  south of Warminster and 5 miles  north of Shaftesbury, Dorset. It is the birthplace of Sir Christopher Wren. The parish includes the hamlets of Holloway, Milton, The Green, Underhill and Upton.", "coordx": 196, "coordy": 115, "condition":[2,5,19], "buildingid":[1,4,12], "image":"CITY1.png"}, 
{"id":2, "name":"Urbana, Illinois", "description":"Urbana /??r?bæn?/ is a city in and the county seat of Champaign County, Illinois, United States. The population was 41,250 at the 2010 census. Urbana is the tenth-most populous city in Illinois outside of the Chicago metropolitan area. Most of the campus of the University of Illinois at Urbana-Champaign is located in Urbana.", "coordx": 74, "coordy": 137, "condition":[4,4], "buildingid":[2], "image":"CITY2.png"}, 
{"id":3, "name":"Atlantic City, New Jersey", "description":". Atlantic City is a resort city in Atlantic County, New Jersey, United States, known for its casinos, boardwalk and beach. In 2010, it had a population of 39,558. Located on Absecon Island, it was incorporated on May 1, 1854, from portions of Egg Harbor Township and Galloway Township. The city borders Absecon, Brigantine, Pleasantville, Ventnor City, West Atlantic City and the Atlantic Ocean. Atlantic City was the inspiration for the American version of the board game Monopoly, especially the street names. Since 1921, Atlantic City has been the location for the Miss America pageant.", "coordx": 94, "coordy": 138, "condition":[6,12,12], "buildingid":[3,5], "image":"CITY3.png"}, 
{"id":4, "name":"Berlin", "description":"Berlin  is the capital and the largest city of Germany as well as one of its 16 states. With a population of approximately 3.6 million people, Berlin is the second most populous city proper and the seventh most populous urban area in the European Union. Located in northeastern Germany on the banks of Rivers Spree and Havel, it is the centre of the Berlin-Brandenburg Metropolitan Region, which has about 6 million residents from more than 180 nations. Due to its location in the European Plain, Berlin is influenced by a temperate seasonal climate. Around one-third of the city's area is composed of forests, parks, gardens, rivers and lakes. First documented in the 13th century and situated at the crossing of two important historic trade routes, Berlin became the capital of the Margraviate of Brandenburg , the Kingdom of Prussia , the German Empire , the Weimar Republic  and the Third Reich . Berlin in the 1920s was the third largest municipality in the world. After World War II, the city was divided; East Berlin became the capital of East Germany while West Berlin became a de facto West German exclave, surrounded by the Berlin Wall  and East Germany territory. Following German reunification in 1990, Berlin was once again designated as the capital of united Germany. Berlin is a world city of culture, politics, media and science. Its economy is based on high-tech firms and the service sector, encompassing a diverse range of creative industries, research facilities, media corporations and convention venues. Berlin serves as a continental hub for air and rail traffic and has a highly complex public transportation network. The metropolis is a popular tourist destination. Significant industries also include IT, pharmaceuticals, biomedical engineering, clean tech, biotechnology, construction and electronics. Modern Berlin is home to world renowned universities, orchestras, museums, entertainment venues and is host to many sporting events. Its urban setting has made it a sought-after location for international film productions. The city is well known for its festivals, diverse architecture, nightlife, contemporary arts and a high quality of living. Over the last decade Berlin has seen the emergence of a cosmopolitan entrepreneurial scene.", "coordx": 219, "coordy": 111, "condition":[9,9,9,9,9,9,34], "buildingid":[8,8,19], "image":"CITY4.png"}, 
{"id":5, "name":"Schöneberg", "description":"Schöneberg is a locality of Berlin, Germany. Until Berlin's 2001 administrative reform it was a separate borough including the locality of Friedenau. Together with the former borough of Tempelhof it is now part of the new borough of Tempelhof-Schöneberg.", "coordx": 219, "coordy": 111, "condition":[11], "buildingid":[6], "image":"CITY5.png"}, 
{"id":6, "name":"Schenectady, New York", "description":"Schenectady /sk??n?kt?di/  is a city in Schenectady County, New York, United States, of which it is the county seat. As of the 2010 census, the city had a population of 66,135. The name \"Schenectady\" is derived from a Mohawk word skahnéhtati meaning \"beyond the pines\". The city was founded on the south side of the Mohawk River by Dutch colonists in the 17th century, many from the Albany area. They were prohibited from the fur trade by the Albany monopoly, which kept its control after the English takeover in 1664. Residents of the new village developed farms on strip plots along the river. Connected to the west via the Mohawk River and Erie Canal, the city developed rapidly in the 19th century as part of the Mohawk Valley trade, manufacturing and transportation corridor. By 1824 more people worked in manufacturing than agriculture or trade, and the city had a cotton mill, processing cotton from the Deep South. Numerous mills in New York had such ties with the South. Through the 19th century, nationally influential companies and industries developed in Schenectady, including General Electric and American Locomotive Company , which were powers into the mid-20th century. The city was part of emerging technologies, with GE collaborating in the production of nuclear-powered submarines and, in the 21st century, working on other forms of renewable energy. The city is in eastern New York, near the confluence of the Mohawk and Hudson rivers. It is in the same metropolitan area as the state capital, Albany, which is about 19 miles  southeast. In December 2014, the state announced that the city was one of three sites selected for development of off-reservation casino gambling, under terms of a 2013 state constitutional amendment. The project would redevelop an ALCO brownfield site in the city along the waterfront, with hotels, housing and a marina in addition to the casino.", "coordx": 94, "coordy": 132, "condition":[13,26], "buildingid":[7,15], "image":"CITY6.png"}, 
{"id":7, "name":"State of Illinois", "description":"Illinois  is a state in the midwestern region of the United States, achieving statehood in 1818. It is the 5th most populous state and 25th largest state in terms of land area, and is often noted as a microcosm of the entire country. With Chicago in the northeast, small industrial cities and great agricultural productivity in central and northern Illinois, and natural resources like coal, timber, and petroleum in the south, Illinois has a diverse economic base and is a major transportation hub. The Port of Chicago connects the state to other global ports from the Great Lakes, via the Saint Lawrence Seaway, to the Atlantic Ocean, as well as the Great Lakes to the Mississippi River, via the Illinois River. For decades, O'Hare International Airport has been ranked as one of the world's busiest airports. Illinois has long had a reputation as a bellwether both in social and cultural terms and politics. Although today the state's largest population center is around Chicago in the northern part of the state, the state's European population grew first in the west, with French Canadians who settled along the Mississippi River, and gave the area the name, Illinois. After the American Revolutionary War established the United States, American settlers began arriving crossing the Appalachians barrier range in the 1810s via the gaps of the Allegheny to boat building centers in Pittsburgh, from Cumberland, Maryland via the Cumberland Narrows pass to outfit in Brownsville, Pennsylvania, from North Carolina and Virginia via the Cumberland Gap to Kentucky and Tennessee, all on the Ohio River. The riverboats built in Pittsburgh, Brownsville and along the lower Ohio Valley were safe and capable so emigrants polling boats northwards from the confluence against the current up the lazy Mississippi  to other destinations on either bank was a common sight for over six decades  and the population of Illinois grew from south to north as immigration from Europe, large families in the burgeoning eastern populous, and the exhausting of the poor farming lands of the East each had an impact. With the War of 1812 Illinois growth slowed as Amerindians and Canadian forces oft raided the American Frontier. After the war's end, the federal government re-established forts such as Fort Dearborn  and army patrols west of the Mississippi diminished the threat from Amerindian raids, so settlers were able to move into all of Illinois from the eastern and southern emigrant trails. Mineral finds and timber stands also had spurred immigration—by the 1810s, the Eastern U.S. had exhausted most timber stands close to the established cities creating a hard felt first energy crisis by the late 1790s, and after 1818 the industrial revolution was being fueled by new canals such as the Lehigh Canal feeding the furnaces of the rapidly industrializing east coast. In the same year of 1818, Illinois achieved statehood and its growth, as yet untroubled by the speed of as yet unrefined railway technology, would be fueled by the new religion of industrialized forward thinking. After construction of the Erie Canal with increasing traffic and trade through the Great Lakes, Chicago was founded in the 1830s on the banks of the Chicago River, at one of the few natural harbors on southern Lake Michigan. John Deere's invention of the self-scouring steel plow turned Illinois' rich prairie into some of the world's most productive and valuable farmlands, attracting new immigrant farmers from Germany and Sweden. Railroads arose and matured in the 1840s, and soon carried immigrants to new homes in Illinois, as well as being a resource to ship their commodity crops out to markets. Railroads freed most of the land of Illinois and other mid-western states from the tyranny of water transport; no longer was a location near a river or canal a need to ship bulk goods. By 1900, the growth of industrial jobs in the northern cities and coal mining in the central and southern areas attracted a new group of immigrants, from Eastern and Southern Europe. Illinois was an important manufacturing center during both world wars. The Great Migration from the South established a large community of African Americans in Chicago, who created the city's famous jazz and blues cultures. Three U.S. presidents have been elected while living in Illinois: Abraham Lincoln, Ulysses S. Grant, and Barack Obama. Additionally, Ronald Reagan, whose political career was based in California, was the only U.S. president born and raised in Illinois. Today, Illinois honors Lincoln with its official state slogan, Land of Lincoln, which has been displayed on its license plates since 1954. The Abraham Lincoln Presidential Library and Museum is located in the state capital of Springfield, and the Barack Obama Presidential Center will be completed in Chicago by 2020.", "coordx": 74, "coordy": 135, "condition":[18,18,16], "buildingid":[9,11], "image":"CITY7.png"}, 
{"id":8, "name":"Biblioteca universitaria di Edimburgo", "description":"Edinburgh University Library is one of the most important libraries of Scotland. It is located in Edinburgh. The University Library was moved in 1827 to William Playfair's Upper Library in the Old College building. The collections in Edinburgh University Old College were moved in 1967 to the purpose-built eight-storey Main Library building at George Square.", "coordx": 195, "coordy": 103, "condition":[20], "buildingid":[10], "image":"CITY8.png"}, 
{"id":9, "name":"Austria-Hungary", "description":"Austria-Hungary , also known by  and often referred to as the Austro-Hungarian Empire in English-language sources, was a constitutional union of the Austrian Empire  and the Kingdom of Hungary  that existed from 1867 to 1918, when it collapsed as a result of defeat in World War I. The union was a result of the Austro-Hungarian Compromise of 1867 and came into existence on 30 March 1867, when the compromise was ratified by the Hungarian parliament. Austria-Hungary consisted of two monarchies , and one autonomous region: the Kingdom of Croatia-Slavonia under the Hungarian crown, which negotiated the Croatian–Hungarian Settlement  in 1868. It was ruled by the House of Habsburg, and constituted the last phase in the constitutional evolution of the Habsburg Monarchy. Following the 1867 reforms, the Austrian and the Hungarian states were co-equal. The Compromise required regular renewal, as did the customs union between the two components of the union. Foreign affairs and the military came under joint oversight, but all other governmental faculties were divided between respective states. Austria-Hungary was a multinational state and one of the world's great powers at the time. Austria-Hungary was geographically the second-largest country in Europe after the Russian Empire, at 621,538 km2 , and the third-most populous . The Empire built up the fourth-largest machine building industry of the world, after the United States, Germany, and the United Kingdom of Great Britain and Ireland. Austria-Hungary also became the world's third largest manufacturer and exporter of electric home appliances, electric industrial appliances and power generation apparatuses for power plants, after the United States and the German Empire. After 1878, Bosnia and Herzegovina was under Austro-Hungarian military and civilian rule until it was fully annexed in 1908, provoking the Bosnian crisis among the other powers. Sandžak/Raška, de jure northern part of the Ottoman Sanjak of Novi Pazar, was also under de facto joint occupation during that period but the Austro-Hungarian army withdrew as part of their annexation of Bosnia. The annexation of Bosnia also led to Islam being recognized as an official state religion due to Bosnia's Muslim population. Austria-Hungary was one of the Central Powers in World War I. It was already effectively dissolved by the time the military authorities signed the armistice of Villa Giusti on November 3, 1918. The Kingdom of Hungary and the First Austrian Republic were treated as its successors de jure, whereas the independence of the West Slavs and South Slavs of the Empire as the First Czechoslovak Republic, the Second Polish Republic and the Kingdom of Yugoslavia, respectively, and most of the territorial demands of the Kingdom of Romania were also recognized by the victorious powers in 1920.", "coordx": 223, "coordy": 121, "condition":[23,25,23,25,30], "buildingid":[13,16], "image":"CITY9.png"}, 
{"id":11, "name":"Stepfershausen", "description":"Stepfershausen is a municipality in the district Schmalkalden-Meiningen, in Thuringia, Germany.", "coordx": 214, "coordy": 116, "condition":[27], "buildingid":[14], "image":"CITY11.png"}, 
{"id":13, "name":"the United States", "description":", US , USA , and United States . The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.The 48 contiguous states and federal district are in central North America between Canada and Mexico, with the state of Alaska in the northwestern part of North America and the state of Hawaii comprising an archipelago in the mid-Pacific. The territories are scattered about the Pacific Ocean and the Caribbean Sea. At 3.8 million square miles  and with over 324 million people, the United States is the world's third-largest country by total area  and the third-most populous. It is one of the world's most ethnically diverse and multicultural nations, the product of large-scale immigration from many other countries. The country's capital is Washington, D.C. and its largest city is New York City; other major metropolitan areas include Los Angeles, Chicago, Dallas, San Francisco, Boston, Philadelphia, Houston, Atlanta, and Miami. The geography, climate and wildlife of the country are extremely diverse. Paleo-Indians migrated from Asia to the North American mainland at least 15,000 years ago, with European colonization beginning in the 16th century. The United States emerged from 13 British colonies along the East Coast. Numerous disputes between Great Britain and the colonies in the aftermath of the Seven Years War led to the American Revolution, which began in 1775. On July 4, 1776, as the colonies were fighting Great Britain in the American Revolutionary War, delegates from the 13 colonies unanimously adopted the Declaration of Independence. The war ended in 1783 with recognition of the independence of the United States by Great Britain, and was the first successful war of independence against a European colonial empire. The current constitution was adopted in 1788, after the Articles of Confederation, adopted in 1781, were felt to have provided inadequate federal powers. The first ten amendments, collectively named the Bill of Rights, were ratified in 1791 and designed to guarantee many fundamental civil liberties. The United States embarked on a vigorous expansion across North America throughout the 19th century, displacing American Indian tribes, acquiring new territories, and gradually admitting new states until it spanned the continent by 1848. During the second half of the 19th century, the American Civil War led to the end of legal slavery in the country. By the end of that century, the United States extended into the Pacific Ocean, and its economy, driven in large part by the Industrial Revolution, began to soar. The Spanish–American War and World War I confirmed the country's status as a global military power. The United States emerged from World War II as a global superpower, the first country to develop nuclear weapons, the only country to use them in warfare, and a permanent member of the United Nations Security Council. The end of the Cold War and the dissolution of the Soviet Union in 1991 left the United States as the world's sole superpower. The United States is a highly developed country, with the world's largest economy by nominal GDP. It ranks highly in several measures of socioeconomic performance, including average wage, human development, per capita GDP, and productivity per person. While the U.S. economy is considered post-industrial, characterized by the dominance of services, the manufacturing sector remains the second-largest in the world. Though its population is only 4.4% of the world total, the United States accounts for nearly a quarter of world GDP and almost a third of global military spending, making it the world's foremost military and economic power. The United States is a prominent political and cultural force internationally, and a leader in scientific research and technological innovations.", "coordx": 90, "coordy": 139, "condition":[32,32,33,33], "buildingid":[17,18], "image":"CITY13.png"}],
"dialoguenodes":[{"id":94, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [95], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":95, "dialogueline":"Don't know.", "eventid":"-1", "dialoguetype": 0, "children": [94], "condition":[], "option":"I'm looking for Boris Schreiber?...", "isroot": false}, 
{"id":75, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [96,97,134], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":134, "dialogueline":"John Alwyne Kitching has for deathyear", "eventid":"69", "dialoguetype": 0, "children": [75], "condition":[-1], "option":"Do you have any information about one of the suspects?", "isroot": false}, 
{"id":97, "dialogueline":"That is none of your business.", "eventid":"-1", "dialoguetype": 2, "children": [75], "condition":[], "option":"Do you live anywhere associated with this?", "isroot": false}, 
{"id":96, "dialogueline":"Hi", "eventid":"34", "dialoguetype": 0, "children": [75], "condition":[], "option":"<Ask about Boris Schreiber>", "isroot": false}, 
{"id":88, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [89], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":89, "dialogueline":"Don't you have anything better to do?", "eventid":"-1", "dialoguetype": 0, "children": [88], "condition":[], "option":"I'm looking for Boris Schreiber?...", "isroot": false}, 
{"id":74, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [90,91,132], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":132, "dialogueline":"Boris Schreiber has for awards", "eventid":"67", "dialoguetype": 0, "children": [74], "condition":[-1], "option":"Do you recall any information about one of the suspects?", "isroot": false}, 
{"id":91, "dialogueline":"Why does it matter where I was born..?", "eventid":"-1", "dialoguetype": 1, "children": [92], "condition":[], "option":"What city were you born in?", "isroot": false}, 
{"id":92, "dialogueline":"I don't have to answer that.", "eventid":"-1", "dialoguetype": 1, "children": [74], "condition":[], "option":"When is your birthday?", "isroot": false}, 
{"id":90, "dialogueline":"Hello", "eventid":"33", "dialoguetype": 0, "children": [74], "condition":[], "option":"<Ask about the United States>", "isroot": false}, 
{"id":70, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 0, "children": [71,101,105,111,115,128], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":128, "dialogueline":"John Alwyne Kitching has for awards", "eventid":"63", "dialoguetype": 0, "children": [70], "condition":[-1], "option":"I need a lead. Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":115, "dialogueline":"I am know for deathplace. hamburg", "eventid":"50", "dialoguetype": 0, "children": [], "condition":[49], "option":"I could use your cooperation. Do you know some information about one of the suspects?", "isroot": false}, 
{"id":111, "dialogueline":"I am know for subject. category:1996 deaths", "eventid":"46", "dialoguetype": 0, "children": [], "condition":[45], "option":"Would you tell me some information about one of the suspects?", "isroot": false}, 
{"id":105, "dialogueline":"What, awards? I don't know anything about that.", "eventid":"40", "dialoguetype": 0, "children": [], "condition":[39], "option":"Do you recall some information about one of the suspects?", "isroot": false}, 
{"id":101, "dialogueline":"I am know for deathyear. 1996", "eventid":"36", "dialoguetype": 0, "children": [], "condition":[35], "option":"I could use some cooperation. Do you have some information about one of the suspects?", "isroot": false}, 
{"id":71, "dialogueline":"You'll find nothing.", "eventid":"-1", "dialoguetype": 0, "children": [70], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":73, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [83,84,85], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":85, "dialogueline":"This is a silly question, and I will not answer you.", "eventid":"-1", "dialoguetype": 1, "children": [86], "condition":[], "option":"What city were you born in?", "isroot": false}, 
{"id":86, "dialogueline":"That is none of your business.", "eventid":"-1", "dialoguetype": 1, "children": [73], "condition":[], "option":"When were you born?", "isroot": false}, 
{"id":84, "dialogueline":"I live in 22-rdf-syntax-ns#langString.", "eventid":"-1", "dialoguetype": 2, "children": [73], "condition":[], "option":"Where is your current residence? It might be important to the case.", "isroot": false}, 
{"id":83, "dialogueline":"May I help?", "eventid":"32", "dialoguetype": 0, "children": [73], "condition":[], "option":"<Ask about Frederick Seitz>", "isroot": false}, 
{"id":64, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [65], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":65, "dialogueline":"Please, leave", "eventid":"-1", "dialoguetype": 0, "children": [64], "condition":[], "option":"I'm looking for Arthur Rudolph?...", "isroot": false}, 
{"id":57, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [62], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":62, "dialogueline":"Hello", "eventid":"25", "dialoguetype": 0, "children": [57], "condition":[], "option":"<Ask about Fritz Lang>", "isroot": false}, 
{"id":54, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [66,67,69,122], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":122, "dialogueline":"Norman Joseph Woodland is know for subject. people from atlantic city, new jersey", "eventid":"57", "dialoguetype": 0, "children": [124], "condition":[-1], "option":"Do you recall any information about one of the suspects?", "isroot": false}, 
{"id":124, "dialogueline":"Boris Schreiber has for deathyear", "eventid":"59", "dialoguetype": 0, "children": [126], "condition":[57], "option":"Do you remember any information about one of the suspects?", "isroot": false}, 
{"id":126, "dialogueline":"Boris Schreiber is know for deathplace. neuilly-sur-seine", "eventid":"61", "dialoguetype": 0, "children": [54], "condition":[59], "option":"Do you remember any information about one of the suspects?", "isroot": false}, 
{"id":69, "dialogueline":"Stop asking me this!", "eventid":"-1", "dialoguetype": 3, "children": [54], "condition":[], "option":"What are you most known for?", "isroot": false}, 
{"id":67, "dialogueline":"Why do you care about where I was born?", "eventid":"-1", "dialoguetype": 1, "children": [68], "condition":[], "option":"What city were you born in?", "isroot": false}, 
{"id":68, "dialogueline":"I don't have to answer that.", "eventid":"-1", "dialoguetype": 1, "children": [54], "condition":[], "option":"What year were you born in?", "isroot": false}, 
{"id":66, "dialogueline":"Hi", "eventid":"26", "dialoguetype": 0, "children": [54], "condition":[], "option":"<Ask about Woman in the Moon>", "isroot": false}, 
{"id":51, "dialogueline":"I don't have to speak to you", "eventid":"-1", "dialoguetype": 0, "children": [52,103,113,118,129,135], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":135, "dialogueline":"What, deathyear? I don't know anything about that.", "eventid":"70", "dialoguetype": 0, "children": [], "condition":[69], "option":"Do you recall some information about one of the suspects?", "isroot": false}, 
{"id":129, "dialogueline":"What, awards? I don't know anything about that.", "eventid":"64", "dialoguetype": 0, "children": [], "condition":[63], "option":"I could use a lead. Do you have some information about one of the suspects?", "isroot": false}, 
{"id":118, "dialogueline":"Boris Schreiber is know for subject. category:french male writers", "eventid":"53", "dialoguetype": 0, "children": [51], "condition":[-1], "option":"I could use some help. Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":113, "dialogueline":"I am know for subject. princeton university faculty", "eventid":"48", "dialoguetype": 0, "children": [], "condition":[47], "option":"Do you know any information about one of the suspects?", "isroot": false}, 
{"id":103, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"38", "dialoguetype": 0, "children": [], "condition":[37], "option":"Do you know any information about one of the suspects?", "isroot": false}, 
{"id":52, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [51], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":46, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [47], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":47, "dialogueline":"Don't know.", "eventid":"-1", "dialoguetype": 0, "children": [46], "condition":[], "option":"I'm looking for John Alwyne Kitching?...", "isroot": false}, 
{"id":38, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [48,49,50,116], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":116, "dialogueline":"Lee Davenport has for awards", "eventid":"51", "dialoguetype": 0, "children": [38], "condition":[-1], "option":"Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":50, "dialogueline":"Why do you want to know? Show me your badge!", "eventid":"-1", "dialoguetype": 3, "children": [38], "condition":[], "option":"What are you most known for?", "isroot": false}, 
{"id":49, "dialogueline":"Where I live is not your business!", "eventid":"-1", "dialoguetype": 2, "children": [38], "condition":[], "option":"Where is your current residence? It might be important to the case.", "isroot": false}, 
{"id":48, "dialogueline":"Hello", "eventid":"19", "dialoguetype": 0, "children": [38], "condition":[], "option":"<Ask about 1908 births>", "isroot": false}, 
{"id":35, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 0, "children": [36,109,117,121,131], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":131, "dialogueline":"I am know for deathplace. greenwich, connecticut", "eventid":"66", "dialoguetype": 0, "children": [], "condition":[65], "option":"Do you have some information about one of the suspects?", "isroot": false}, 
{"id":121, "dialogueline":"I am know for subject. 1915 births", "eventid":"56", "dialoguetype": 0, "children": [], "condition":[55], "option":"I could use your assistance. Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":117, "dialogueline":"What, awards? I don't know anything about that.", "eventid":"52", "dialoguetype": 0, "children": [], "condition":[51], "option":"I need your cooperation. Do you know some information about one of the suspects?", "isroot": false}, 
{"id":109, "dialogueline":"What, deathyear? I don't know anything about that.", "eventid":"44", "dialoguetype": 0, "children": [], "condition":[43], "option":"Do you remember any information about one of the suspects?", "isroot": false}, 
{"id":36, "dialogueline":"Fine.", "eventid":"-1", "dialoguetype": 0, "children": [35], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":21, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [31,33], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":33, "dialogueline":"I'm not going to answer that!", "eventid":"-1", "dialoguetype": 3, "children": [21], "condition":[], "option":"You seem familiar, remind me why?", "isroot": false}, 
{"id":31, "dialogueline":"Hi", "eventid":"-1", "dialoguetype": 0, "children": [32], "condition":[], "option":"<Ask about Normandy landings>", "isroot": false}, 
{"id":32, "dialogueline":"Have you explored in Atlantic City, New Jersey?", "eventid":"12", "dialoguetype": 0, "children": [21], "condition":[], "option":"I am looking for Lee Davenport. Do you know where they could be?", "isroot": false}, 
{"id":98, "dialogueline":"I want my lawyer", "eventid":"-1", "dialoguetype": 0, "children": [99,119,125,127,133,136], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":136, "dialogueline":"Norman Joseph Woodland is know for deathyear. 2012", "eventid":"71", "dialoguetype": 0, "children": [138], "condition":[-1], "option":"Do you have some information about one of the suspects?", "isroot": false}, 
{"id":138, "dialogueline":"Norman Joseph Woodland is know for deathplace. edgewater, new jersey", "eventid":"73", "dialoguetype": 0, "children": [98], "condition":[71], "option":"I need your assistance. Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":133, "dialogueline":"I am know for awards. unknown", "eventid":"68", "dialoguetype": 0, "children": [], "condition":[67], "option":"I could use a lead. Do you know some information about one of the suspects?", "isroot": false}, 
{"id":127, "dialogueline":"I am know for deathplace. neuilly-sur-seine", "eventid":"62", "dialoguetype": 0, "children": [], "condition":[61], "option":"Do you recall any information about one of the suspects?", "isroot": false}, 
{"id":125, "dialogueline":"What, deathyear? I don't know anything about that.", "eventid":"60", "dialoguetype": 0, "children": [], "condition":[59], "option":"Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":119, "dialogueline":"I am know for subject. category:1996 deaths", "eventid":"54", "dialoguetype": 0, "children": [], "condition":[53], "option":"Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":99, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [98], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":24, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [29], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":29, "dialogueline":"May I help?", "eventid":"11", "dialoguetype": 0, "children": [24], "condition":[], "option":"<Ask about Erich Marcks>", "isroot": false}, 
{"id":30, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [34], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":34, "dialogueline":"Hi", "eventid":"13", "dialoguetype": 0, "children": [30], "condition":[], "option":"<Ask about Lee Davenport>", "isroot": false}, 
{"id":18, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 0, "children": [19,106,107,123,137,139], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":139, "dialogueline":"I am know for deathplace. edgewater, new jersey", "eventid":"74", "dialoguetype": 0, "children": [], "condition":[73], "option":"Do you recall some information about one of the suspects?", "isroot": false}, 
{"id":137, "dialogueline":"I am know for deathyear. 2012", "eventid":"72", "dialoguetype": 0, "children": [], "condition":[71], "option":"Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":123, "dialogueline":"I am know for subject. people from atlantic city, new jersey", "eventid":"58", "dialoguetype": 0, "children": [], "condition":[57], "option":"Do you have some information about one of the suspects?", "isroot": false}, 
{"id":107, "dialogueline":"What, awards? I don't know anything about that.", "eventid":"42", "dialoguetype": 0, "children": [], "condition":[41], "option":"I need some assistance. Do you have any information about one of the suspects?", "isroot": false}, 
{"id":106, "dialogueline":"Norman Joseph Woodland has for awards", "eventid":"41", "dialoguetype": 0, "children": [108], "condition":[-1], "option":"Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":108, "dialogueline":"Lee Davenport has for deathyear", "eventid":"43", "dialoguetype": 0, "children": [18], "condition":[41], "option":"Do you have any information about one of the suspects?", "isroot": false}, 
{"id":19, "dialogueline":"You have no proof.", "eventid":"-1", "dialoguetype": 0, "children": [18], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":13, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [14], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":14, "dialogueline":"Don't know. Leave me alone.", "eventid":"-1", "dialoguetype": 0, "children": [13], "condition":[], "option":"I'm looking for Norman Joseph Woodland?...", "isroot": false}, 
{"id":2, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [15,16], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":16, "dialogueline":"Why does it matter where I was born..?", "eventid":"-1", "dialoguetype": 1, "children": [17], "condition":[], "option":"What city were you born in?", "isroot": false}, 
{"id":17, "dialogueline":"Stop questioning me!", "eventid":"-1", "dialoguetype": 1, "children": [2], "condition":[], "option":"What year were you born in?", "isroot": false}, 
{"id":15, "dialogueline":"May I help?", "eventid":"5", "dialoguetype": 0, "children": [2], "condition":[], "option":"<Ask about 2012 in science>", "isroot": false}, 
{"id":1, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [10,11,102], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":102, "dialogueline":"John Alwyne Kitching has for deathplace", "eventid":"37", "dialoguetype": 0, "children": [104], "condition":[-1], "option":"Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":104, "dialogueline":"Arthur Rudolph has for awards", "eventid":"39", "dialoguetype": 0, "children": [1], "condition":[37], "option":"Do you have any information about one of the suspects?", "isroot": false}, 
{"id":11, "dialogueline":"Why do you want to know? Show me your badge!", "eventid":"-1", "dialoguetype": 3, "children": [1], "condition":[], "option":"You seem familiar, remind me why?", "isroot": false}, 
{"id":10, "dialogueline":"Hi", "eventid":"4", "dialoguetype": 0, "children": [1], "condition":[], "option":"<Ask about Carl Woese>", "isroot": false}, 
{"id":77, "dialogueline":"Hi. Do you need something?", "eventid":"-1", "dialoguetype": 0, "children": [78], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":78, "dialogueline":"Okay. Whatever I can do to help.", "eventid":"28", "dialoguetype": 0, "children": [79], "condition":[], "option":"Hi, I'm assigned to the victim's case. Please could you help answer some questions?", "isroot": false}, 
{"id":79, "dialogueline":"You can call me $personName$.", "eventid":"29", "dialoguetype": 0, "children": [80], "condition":[], "option":"Tell me your name.", "isroot": false}, 
{"id":80, "dialogueline":"the victim knew $personObject$.", "eventid":"30", "dialoguetype": 0, "children": [81,82], "condition":[], "option":"Is there anything specific about the victim that you recollect?", "isroot": false}, 
{"id":82, "dialogueline":"I am suspicious of $suspectName$.", "eventid":"31", "dialoguetype": 0, "children": [77], "condition":[], "option":"I could use a lead. Can you think of anyone who could have done it?", "isroot": false}, 
{"id":81, "dialogueline":"Someone told me $personObject$ was seen in $place$.", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"If you would tell me, where can I locate $personObject$? I would appreciate it.", "isroot": false}, 
{"id":56, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [58,130], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":130, "dialogueline":"Lee Davenport is know for deathplace. greenwich, connecticut", "eventid":"65", "dialoguetype": 0, "children": [56], "condition":[-1], "option":"I could use a lead. Do you know some information about one of the suspects?", "isroot": false}, 
{"id":58, "dialogueline":"I'll do my best.", "eventid":"21", "dialoguetype": 0, "children": [59], "condition":[], "option":"Greetings, I'm investigating the victim's case. If you don't mind, would I ask you some questions?", "isroot": false}, 
{"id":59, "dialogueline":"Yes, I am $personName$.", "eventid":"22", "dialoguetype": 0, "children": [60], "condition":[], "option":"Please, state your name.", "isroot": false}, 
{"id":60, "dialogueline":"the victim went to $place$.", "eventid":"23", "dialoguetype": 0, "children": [61], "condition":[], "option":"Is there anything specific about the victim that you remember?", "isroot": false}, 
{"id":61, "dialogueline":"Personally, I am suspicious of $suspectName$.", "eventid":"24", "dialoguetype": 0, "children": [56], "condition":[], "option":"Can you think of someone who has a motive?", "isroot": false}, 
{"id":40, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [41,120], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":120, "dialogueline":"Lee Davenport is know for subject. 1915 births", "eventid":"55", "dialoguetype": 0, "children": [40], "condition":[-1], "option":"I could use a lead. Could you tell me any information about one of the suspects?", "isroot": false}, 
{"id":41, "dialogueline":"If you really need it...", "eventid":"14", "dialoguetype": 0, "children": [42], "condition":[], "option":"Greetings, I'm investigating the victim's case. If you don't mind, I ask that you answer some questions.", "isroot": false}, 
{"id":42, "dialogueline":"Yes, my name is $personName$.", "eventid":"15", "dialoguetype": 0, "children": [43], "condition":[], "option":"Who are you?", "isroot": false}, 
{"id":43, "dialogueline":"The victim mentioned a thing called $thingName$.", "eventid":"16", "dialoguetype": 0, "children": [44], "condition":[], "option":"Do you have something specific that might be valuable to the investigation?", "isroot": false}, 
{"id":44, "dialogueline":"I believe $suspectName$ could be guilty.", "eventid":"17", "dialoguetype": 0, "children": [40], "condition":[], "option":"Do you have any more information?", "isroot": false}, 
{"id":23, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [25,112], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":112, "dialogueline":"John Alwyne Kitching is know for subject. princeton university faculty", "eventid":"47", "dialoguetype": 0, "children": [114], "condition":[-1], "option":"Would you tell me some information about one of the suspects?", "isroot": false}, 
{"id":114, "dialogueline":"Arthur Rudolph is know for deathplace. hamburg", "eventid":"49", "dialoguetype": 0, "children": [23], "condition":[47], "option":"I could use a lead. Do you know some information about one of the suspects?", "isroot": false}, 
{"id":25, "dialogueline":"Whatever I can do to help.", "eventid":"7", "dialoguetype": 0, "children": [26], "condition":[], "option":"Greetings, I'm a super sleuth. Could I ask you some questions?", "isroot": false}, 
{"id":26, "dialogueline":"You can call me $personName$.", "eventid":"8", "dialoguetype": 0, "children": [27], "condition":[], "option":"Could you tell me your name?", "isroot": false}, 
{"id":27, "dialogueline":"Last I was led to believe, the victim was in $place$. That's what I thought at least.", "eventid":"9", "dialoguetype": 0, "children": [28], "condition":[], "option":"Did the victim comment on anything that you can recall?", "isroot": false}, 
{"id":28, "dialogueline":"I believe $suspectName$ might be connected. But, It is difficult to say.", "eventid":"10", "dialoguetype": 0, "children": [23], "condition":[], "option":"Do you have any more information?", "isroot": false}, 
{"id":4, "dialogueline":"Hi. How may I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [5,110], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":110, "dialogueline":"Arthur Rudolph is know for subject. category:1996 deaths", "eventid":"45", "dialoguetype": 0, "children": [4], "condition":[-1], "option":"I could use your cooperation. Do you recall any information about one of the suspects?", "isroot": false}, 
{"id":5, "dialogueline":"Okay.", "eventid":"0", "dialoguetype": 0, "children": [6], "condition":[], "option":"Greetings, I'm a private investigator assigned to the victim's case. Can you answer some questions for me?", "isroot": false}, 
{"id":6, "dialogueline":"My name is $personName$.", "eventid":"1", "dialoguetype": 0, "children": [7], "condition":[], "option":"Tell me your name.", "isroot": false}, 
{"id":7, "dialogueline":"Last I thought, I know the victim was seen with $personObject$. That's what I thought at least.", "eventid":"2", "dialoguetype": 0, "children": [8,9], "condition":[], "option":"Do you have anything that might be of use to the investigation?", "isroot": false}, 
{"id":9, "dialogueline":"I am suspicious of $suspectName$. But, It is tough to say.", "eventid":"3", "dialoguetype": 0, "children": [4], "condition":[], "option":"Do you have any more information?", "isroot": false}, 
{"id":8, "dialogueline":"Last I heard about them, $personObject$ travelled to $place$.", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"If you don't mind assisting, where would I locate $personObject$?", "isroot": false}],
"crime":{"suspects":[3,27,8,14,19],"culprit":27,"facts":[{"pid":3,"factoid":"Norman Joseph Woodland is know for subject. people from atlantic city, new jersey","condition":57},{"pid":3,"factoid":"Norman Joseph Woodland is know for deathyear. 2012","condition":71},{"pid":3,"factoid":"Norman Joseph Woodland has for awards","condition":41},{"pid":3,"factoid":"Norman Joseph Woodland is know for deathplace. edgewater, new jersey","condition":73},{"pid":27,"factoid":"Boris Schreiber is know for subject. category:french male writers","condition":53},{"pid":27,"factoid":"Boris Schreiber has for deathyear","condition":59},{"pid":27,"factoid":"Boris Schreiber has for awards","condition":67},{"pid":27,"factoid":"Boris Schreiber is know for deathplace. neuilly-sur-seine","condition":61},{"pid":8,"factoid":"Lee Davenport is know for subject. 1915 births","condition":55},{"pid":8,"factoid":"Lee Davenport has for deathyear","condition":43},{"pid":8,"factoid":"Lee Davenport has for awards","condition":51},{"pid":8,"factoid":"Lee Davenport is know for deathplace. greenwich, connecticut","condition":65},{"pid":14,"factoid":"John Alwyne Kitching is know for subject. princeton university faculty","condition":47},{"pid":14,"factoid":"John Alwyne Kitching has for deathyear","condition":69},{"pid":14,"factoid":"John Alwyne Kitching has for awards","condition":63},{"pid":14,"factoid":"John Alwyne Kitching has for deathplace","condition":37},{"pid":19,"factoid":"Arthur Rudolph is know for subject. category:1996 deaths","condition":45},{"pid":19,"factoid":"Arthur Rudolph is know for deathyear. 1996","condition":35},{"pid":19,"factoid":"Arthur Rudolph has for awards","condition":39},{"pid":19,"factoid":"Arthur Rudolph is know for deathplace. hamburg","condition":49}]}}
