{
"people" : [
{"id":4, "name":"Walter Kutschera", "description":"Walter Kutschera  is an Austrian physicist.", "drootid": 14, "condition":[5], "buildingid":4, "image":"PERSON4.png"}, 
{"id":3, "name":"Satyendra Nath Bose", "description":"Satyendra Nath Bose , FRS  was a Bengali physicist specialising in mathematical physics.  He is best known for his work on quantum mechanics in the early 1920s, providing the foundation for Bose–Einstein statistics and the theory of the Bose–Einstein condensate.", "drootid": 3, "condition":[], "buildingid":0, "image":"PERSON3.png"}, 
{"id":7, "name":"Elsa Einstein", "description":"Elsa Einstein  was the second wife and double first cousin of Albert Einstein.  Elsa had the surname of Einstein at birth, lost it when she took the name of her first husband Max Löwenthal, and regained it in 1919 when she married her cousin Albert.", "drootid": 22, "condition":[], "buildingid":0, "image":"PERSON7.png"}, 
{"id":13, "name":"Takkō Ishimori", "description":"Takkō Ishimori  was a Japanese voice actor from Nagasaki Prefecture, Japan.  He debuted in 1960, and was attached to the talent agency Arts Vision at the time of his death in 2013.", "drootid": 42, "condition":[], "buildingid":0, "image":"PERSON13.png"}, 
{"id":20, "name":"Maynard", "description":"Maynard, formerly known as Maynard F# Crabbes, is an Australian entertainer, television presenter and radio announcer.  He was a key figure in bringing the ABC's youth-oriented radio station Triple J to national prominence, and he worked at ABC radio and as a video presenter for many years.", "drootid": 65, "condition":[], "buildingid":0, "image":"PERSON20.png"}, 
{"id":24, "name":"Władysław Natanson", "description":"Władysław Natanson  was a Polish physicist.  He was head of Theoretical Physics at Jagiellonian University from 1899 to 1935.", "drootid": 86, "condition":[], "buildingid":0, "image":"PERSON24.png"}, 
{"id":1, "name":"Aurel Stodola", "description":"Aurel Boleslav Stodola  was a Slovak engineer, physicist, and inventor.  He was a pioneer in the area of technical thermodynamics and its applications and published his book Die Dampfturbine  in 1903.", "drootid": 9, "condition":[2], "buildingid":1, "image":"PERSON1.png"}, 
{"id":2, "name":"Efraim Racker", "description":"Efraim Racker  was an Austrian biochemist who was responsible for identifying and purifying Factor 1 , the first part of the ATP synthase enzyme to be characterised.  F1 is only a part of a larger ATP synthase complex known as Complex V.", "drootid": 18, "condition":[6], "buildingid":2, "image":"PERSON2.png"}, 
{"id":8, "name":"Joachim Ziegler", "description":"Joachim Ziegler  was born in Hanau in the Main-Kinzig-Kreis, in Hesse, Germany.  Ziegler rose to the rank of SS-Brigadeführer und Generalmajor in the Waffen-SS during World War II.", "drootid": 28, "condition":[9], "buildingid":7, "image":"PERSON8.png"}, 
{"id":6, "name":"Reinhold Strassmann", "description":"Reinhold Strassmann   was a German mathematician who proved Strassmann's theorem.  His Ph.", "drootid": 37, "condition":[13], "buildingid":5, "image":"PERSON6.png"}, 
{"id":9, "name":"Johann Georg Krünitz", "description":"Johann Georg Krünitz  was a German encyclopedist who started the 242-volume Oekonomische Encyklopädie and during his lifetime managed to complete its first 72 volumes.", "drootid": 33, "condition":[12], "buildingid":5, "image":"PERSON9.png"}, 
{"id":14, "name":"Sophia Charlotte of Hanover", "description":"Sophia Charlotte of Hanover  was the first Queen consort in Prussia as wife of King Frederick I.  She was the only daughter of Elector Ernest Augustus of Brunswick-Lüneburg and his wife Sophia of the Palatinate.", "drootid": 48, "condition":[16], "buildingid":11, "image":"PERSON14.png"}, 
{"id":11, "name":"Bernhard Fernow", "description":"Bernhard Eduard Fernow  was the third chief of the USDA's Division of Forestry of the United States from 1886 to 1898, preceding Gifford Pinchot in that position, and laying much of the groundwork for the establishment of the United States Forest Service in 1905.  Fernow's philosophy toward forest management may be traced to Heinrich Cotta's preface to Anweisung zum Waldbau  or Linnaeus' ideas on the \"economy of nature.", "drootid": 52, "condition":[18], "buildingid":8, "image":"PERSON11.png"}, 
{"id":12, "name":"Carl A. Schenck", "description":"Carl Alwyn Schenck  was a pioneering forestry educator in North America, known for his contributions as the forester for George W.  Vanderbilt's Biltmore Estate, and the founder of the Biltmore Forest School, the first practical forestry school in the United States, in 1898, near Brevard, NC.", "drootid": 59, "condition":[20], "buildingid":9, "image":"PERSON12.png"}, 
{"id":15, "name":"Bernhard Fernow", "description":"Bernhard Eduard Fernow  was the third chief of the USDA's Division of Forestry of the United States from 1886 to 1898, preceding Gifford Pinchot in that position, and laying much of the groundwork for the establishment of the United States Forest Service in 1905.  Fernow's philosophy toward forest management may be traced to Heinrich Cotta's preface to Anweisung zum Waldbau  or Linnaeus' ideas on the \"economy of nature.", "drootid": 57, "condition":[20], "buildingid":9, "image":"PERSON15.png"}, 
{"id":17, "name":"Neil deGrasse Tyson", "description":"Neil deGrasse Tyson  is an American astrophysicist, cosmologist, author, and science communicator.  Since 1996, he has been the Frederick P.", "drootid": 71, "condition":[23], "buildingid":12, "image":"PERSON17.png"}, 
{"id":25, "name":"Robert Bakewell", "description":"Robert Bakewell  was a British agriculturalist, now recognized as one of the most important figures in the British Agricultural Revolution.  In addition to work in agronomy, Bakewell is particularly notable as the first to implement systematic selective breeding of livestock.", "drootid": 93, "condition":[32], "buildingid":16, "image":"PERSON25.png"}, 
{"id":18, "name":"Biochemist", "description":"Biochemists are scientists that are trained in biochemistry.", "drootid": 78, "condition":[26], "buildingid":13, "image":"PERSON18.png"}, 
{"id":21, "name":"Speaker of the United States House of Representatives", "description":"The Speaker of the House is the presiding officer of the United States House of Representatives.  The office was established in 1789 by Article I, Section 2 of the United States Constitution, which states in part, \"The House of Representatives shall choose their Speaker.", "drootid": 76, "condition":[26], "buildingid":13, "image":"PERSON21.png"}, 
{"id":19, "name":"Hedley Marston", "description":"Marston was born in Bordertown, South Australia and educated at Unley District High School, Adelaide, where he met Mark Oliphant.  He attended the University of Adelaide but did not complete a degree due to failing Mathematics.", "drootid": 82, "condition":[27], "buildingid":14, "image":"PERSON19.png"}, 
{"id":26, "name":"David King", "description":"Sir David Anthony King, FRS HonFREng  is an Emeritus Professor in Physical Chemistry at the University of Cambridge, Director of the Collegio Carlo Alberto, Chancellor of the University of Liverpool and a senior scientific adviser to UBS.  He currently serves as the Foreign Secretary's Special Representative for Climate Change and Chairman of the Future Cities Catapult.", "drootid": 92, "condition":[33], "buildingid":17, "image":"PERSON26.png"}, 
{"id":27, "name":"David Holbrook", "description":"David Kenneth Holbrook  was a British writer, poet and academic.  From 1989 he was an Emeritus Fellow of Downing College, Cambridge.", "drootid": 97, "condition":[], "buildingid":17, "image":"PERSON27.png"}, 
{"id":23, "name":"Alexander Watt", "description":"Alexander Stuart Watt FRS was a Scottish botanist and plant ecologist.", "drootid": 101, "condition":[34], "buildingid":18, "image":"PERSON23.png"}],
"items":[{"id":2, "name":"Forestry", "description":"It is a letter about Forestry. It says: Forestry is the science and craft of creating, managing, using, conserving, and repairing forests and associated resources to meet desired goals, needs, and values for human and environment benefits.  Forestry is practiced in plantations and natural stands.  The following people are mentioned:  Bernhard Fernow Carl A. Schenck   And the following place: Asheville, North Carolina", "condition": [19], "eventid": 20, "buildingid":10, "itemtype":"letter", "image":"null"}, 
{"id":1, "name":"Prussian State Council", "description":"It is a book about Prussian State Council. It says: The Prussian State Council  was the upper chamber of the bicameral legislature of the Free State of Prussia between 1920 and 1933.  The lower chamber was the Prussian Landtag .  The following people are mentioned:  Berlin Leipziger Straße Preußischer Landtag German federal election, March 1933", "condition": [11], "eventid": 12, "buildingid":6, "itemtype":"book", "image":"null"}, 
{"id":0, "name":"'''Slovaks", "description":"It is a book about '''Slovaks. It says: The Slovaks or Slovak people  are a nation and West Slavic ethnic group native to Slovakia who speak the Slovak language.  Most Slovaks today live within the borders of the independent Slovakia, circa 4.  The following people are mentioned:  Austria Romania", "condition": [4], "eventid": 5, "buildingid":3, "itemtype":"book", "image":"null"}, 
{"id":3, "name":"List of Harvard University people", "description":"It is a book about List of Harvard University people. It says: This is a list of Harvard University people.  The following people are mentioned:  Speaker of the United States House of Representatives Biochemist   And the following place: Necochea", "condition": [25], "eventid": 26, "buildingid":15, "itemtype":"book", "image":"null"}, 
{"id":4, "name":"The Evolution of Physics: The Growth of Ideas From Early Concepts to Relativity and Quanta", "description":"It is a book about The Evolution of Physics: The Growth of Ideas From Early Concepts to Relativity and Quanta. It says: The Evolution of Physics: The Growth of Ideas From Early Concepts to Relativity and Quanta is a science book for the lay reader, by Albert Einstein and Leopold Infeld, tracing the development of ideas in physics.  It was originally published in 1938 by Cambridge University Press.  The following people are mentioned:  Cambridge University Press Leopold Infeld Institute for Advanced Study The Principles of Quantum Mechanics Physics  And the following places: Manhattan and هونغن", "condition": [30], "eventid": 32, "buildingid":19, "itemtype":"book", "image":"null"}, 
{"id":5, "name":"Crowbar", "description":"A crowbar. Can be used to break chains", "condition": [], "eventid": -1, "buildingid":17, "itemtype":"crowbar", "image":"null"}],
"buildings":[{"id":4, "name":"Villa", "description":"Austria , officially the Republic of Austria , is a federal republic and a landlocked country of over 866 million people in Central Europe", "locktype": "null", "coordx": 196, "coordy": 262, "condition":[5], "cityid":0, "peopleid":[4], "itemsid":[], "image":"BUILDING4.png"}, 
{"id":10, "name":"Hotel", "description":" It is bordered by the Czech Republic and Germany to the north, Hungary and Slovakia to the east, Slovenia and Italy to the south, and Switzerland and Liechtenstein to the west The territory of Austria covers 83,879 square kilometres ", "locktype": "null", "coordx": 199, "coordy": 231, "condition":[19], "cityid":0, "peopleid":[], "itemsid":[2], "image":"BUILDING10.png"}, 
{"id":0, "name":"House of Albert Einstein", "description":" and Swiss Confederation  Switzerland , officially the Swiss Confederation is a federal republic in Europe", "locktype": "null", "coordx": 239, "coordy": 254, "condition":[], "cityid":1, "peopleid":[3,7,13,20,24], "itemsid":[], "image":"BUILDING0.png"}, 
{"id":1, "name":"House of Aurel Stodola", "description":" While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\"  The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east", "locktype": "null", "coordx": 290, "coordy": 78, "condition":[2], "cityid":1, "peopleid":[1], "itemsid":[], "image":"BUILDING1.png"}, 
{"id":6, "name":"Villa", "description":" Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2  While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zürich and Geneva", "locktype": "null", "coordx": 312, "coordy": 154, "condition":[11], "cityid":1, "peopleid":[], "itemsid":[1], "image":"BUILDING6.png"}, 
{"id":2, "name":"House of Efraim Racker", "description":"The Kingdom of Poland, informally known as Congress Poland or Russian Poland, was created in 1815 by the Congress of Vienna as a sovereign state of the Russian part of Poland connected by personal union with the Russian Empire under the Constitution of the Kingdom of Poland until 1832 Then, it was gradually politically integrated into Russia over the course of the 19th century, made an official part of the Russian Empire in 1867, and finally replaced during the Great War by the Central Powers in 1915 with the theoretically existing Regency Kingdom of Poland", "locktype": "null", "coordx": 178, "coordy": 267, "condition":[6], "cityid":3, "peopleid":[2], "itemsid":[], "image":"BUILDING2.png"}, 
{"id":3, "name":"Bar", "description":" Though officially the Kingdom of Poland was a state with considerable political autonomy guaranteed by a liberal constitution, its rulers, the Russian Emperors, generally disregarded any restrictions on their power Thus effectively it was little more than a puppet state of the Russian Empire", "locktype": "null", "coordx": 105, "coordy": 58, "condition":[4], "cityid":3, "peopleid":[], "itemsid":[0], "image":"BUILDING3.png"}, 
{"id":7, "name":"Hospital", "description":" Free state is another German term for republic that was coined in contrast to the Latin word, which was associated with the enemy France in the minds of many Germans of that time The democratic Free State of Prussia was rendered incapacitated when it was taken over by the Preußenschlag  of 1932–33 and Otto Braun was forced from office", "locktype": "null", "coordx": 86, "coordy": 299, "condition":[9,9,9], "cityid":4, "peopleid":[8], "itemsid":[], "image":"BUILDING7.png"}, 
{"id":5, "name":"House of Reinhold Strassmann", "description":"Berlin  is the capital and the largest city of Germany as well as one of its 16 states With a population of approximately 3", "locktype": "null", "coordx": 105, "coordy": 247, "condition":[13,12], "cityid":5, "peopleid":[6,9], "itemsid":[], "image":"BUILDING5.png"}, 
{"id":11, "name":"Planetarium", "description":" Although it took its name from the region called Prussia, it was based in the Margraviate of Brandenburg, where its capital was Berlin The kings of Prussia were from the House of Hohenzollern", "locktype": "null", "coordx": 248, "coordy": 93, "condition":[16,16,16], "cityid":7, "peopleid":[14], "itemsid":[], "image":"BUILDING11.png"}, 
{"id":8, "name":"House of Bernhard Fernow", "description":"Ithaca /ˈɪθəkə/ is a city in the Southern Tier-Finger Lakes region of New York It is seat of Tompkins County, as well as the largest community in the Ithaca-Tompkins County metropolitan area", "locktype": "null", "coordx": 89, "coordy": 289, "condition":[18], "cityid":8, "peopleid":[11], "itemsid":[], "image":"BUILDING8.png"}, 
{"id":9, "name":"House of Carl A. Schenck", "description":"Asheville is a city in and the county seat of Buncombe County, North Carolina, United States It is the largest city in Western North Carolina, and the 11th largest city in North Carolina", "locktype": "null", "coordx": 270, "coordy": 103, "condition":[20,20], "cityid":9, "peopleid":[12,15], "itemsid":[], "image":"BUILDING9.png"}, 
{"id":12, "name":"House of Neil deGrasse Tyson", "description":"Manhattan  is the most densely populated borough of New York City, its economic and administrative center, and the city's historical birthplace The borough is coterminous with New York County, founded on November 1, 1683, as one of the original counties of the U", "locktype": "null", "coordx": 309, "coordy": 213, "condition":[23], "cityid":10, "peopleid":[17], "itemsid":[], "image":"BUILDING12.png"}, 
{"id":15, "name":"Planetarium", "description":"S state of New York", "locktype": "null", "coordx": 138, "coordy": 154, "condition":[25], "cityid":10, "peopleid":[], "itemsid":[3], "image":"BUILDING15.png"}, 
{"id":16, "name":"Cambridge University Press", "description":" The borough consists mostly of Manhattan Island, bounded by the East, Hudson, and Harlem Rivers, and also includes several small adjacent islands and Marble Hill, a small neighborhood on the US", "locktype": "null", "coordx": 145, "coordy": 117, "condition":[32], "cityid":10, "peopleid":[25], "itemsid":[], "image":"BUILDING16.png"}, 
{"id":13, "name":"House of Biochemist", "description":"Necochea is a port and beach city in the southwest of Buenos Aires Province, Argentina The city is located on the Atlantic coast, along the mouth of the Quequén Grande River, 528 km  from Buenos Aires and 120 km  southwest of Mar del Plata", "locktype": "null", "coordx": 272, "coordy": 293, "condition":[26,26], "cityid":11, "peopleid":[18,21], "itemsid":[], "image":"BUILDING13.png"}, 
{"id":14, "name":"House of Hedley Marston", "description":"Bordertown is a small South Australian town near the Victorian border It is where the Dukes Highway and the railway line, the two main routes between Adelaide and Melbourne, cross Tatiara Creek", "locktype": "null", "coordx": 235, "coordy": 248, "condition":[27], "cityid":12, "peopleid":[19], "itemsid":[], "image":"BUILDING14.png"}, 
{"id":19, "name":"Castle", "description":" Bordertown is the commercial and administrative centre of the Tatiara District Council Tatiara is the local Aboriginal word for \"Good Country\"", "locktype": "null", "coordx": 83, "coordy": 252, "condition":[30], "cityid":12, "peopleid":[], "itemsid":[4], "image":"BUILDING19.png"}, 
{"id":17, "name":"University of Cambridge", "description":"There is no information available about this", "locktype": "null", "coordx": 286, "coordy": 121, "condition":[], "cityid":13, "peopleid":[26,27], "itemsid":[5], "image":"BUILDING17.png"}, 
{"id":18, "name":"House of Alexander Watt", "description":"Hungen is a town in the district of Gießen, in Hesse, Germany It is situated 20 km southeast of Gießen, and 18 km northeast of Friedberg", "locktype": "null", "coordx": 198, "coordy": 65, "condition":[34], "cityid":14, "peopleid":[23], "itemsid":[], "image":"BUILDING18.png"}],
"cities":[{"id":0, "name":"Austria", "description":"Austria , officially the Republic of Austria , is a federal republic and a landlocked country of over 8.66 million people in Central Europe. It is bordered by the Czech Republic and Germany to the north, Hungary and Slovakia to the east, Slovenia and Italy to the south, and Switzerland and Liechtenstein to the west. The territory of Austria covers 83,879 square kilometres . The terrain is highly mountainous, lying within the Alps; only 32% of the country is below 500 metres , and its highest point is 3,798 metres . The majority of the population speak local Bavarian dialects of German language as their native language, and Austrian German in its standard form is the country's official language. Other local official languages are Hungarian, Burgenland Croatian, and Slovene. The origins of modern-day Austria date back to the time of the Habsburg dynasty when the vast majority of the country was a part of the Holy Roman Empire. From the time of the Reformation, many Northern German princes, resenting the authority of the Emperor, used Protestantism as a flag of rebellion. The Thirty Years War, the influence of the Kingdom of Sweden and Kingdom of France, the rise of the Kingdom of Prussia, and the Napoleonic invasions all weakened the power of the Emperor in the North of Germany, but in the South, and in non-German areas of the Empire, the Emperor and Catholicism maintained control. During the 17th and 18th centuries, Austria was able to retain its position as one of the great powers of Europe and, in response to the coronation of Napoleon as the Emperor of the French, the Austrian Empire was officially proclaimed in 1804. Following Napoleon's defeat, Prussia emerged as Austria's chief competitor for rule of a larger Germany. Austria's defeat by Prussia at the Battle of Königgrätz, during the Austro-Prussian War of 1866, cleared the way for Prussia to assert control over the rest of Germany. In 1867, the empire was reformed into Austria-Hungary. After the defeat of France in the 1870 Franco-Prussian War, Austria was left out of the formation of a new German Empire, although in the following decades its politics, and its foreign policy, increasingly converged with those of the Prussian-led Empire. During the 1914 July Crisis that followed the assassination of Archduke Franz Ferdinand of Austria, Germany guided Austria in issuing the ultimatum to Serbia that led to the declaration of World War I. After the collapse of the Habsburg  Empire in 1918 at the end of World War I, Austria adopted and used the name the Republic of German-Austria  in an attempt for union with Germany, but was forbidden due to the Treaty of Saint-Germain-en-Laye . The First Austrian Republic was established in 1919. In the 1938 Anschluss, Austria was occupied and annexed by Nazi Germany. This lasted until the end of World War II in 1945, after which Germany was occupied by the Allies and Austria's former democratic constitution was restored. In 1955, the Austrian State Treaty re-established Austria as a sovereign state, ending the occupation. In the same year, the Austrian Parliament created the Declaration of Neutrality which declared that the Second Austrian Republic would become permanently neutral. Today, Austria is a parliamentary representative democracy comprising nine federal states. The capital and largest city, with a population exceeding 1.7 million, is Vienna. Austria is one of the richest countries in the world, with a nominal per capita GDP of $43,546. The country has developed a high standard of living and in 2014 was ranked 21st in the world for its Human Development Index. Austria has been a member of the United Nations since 1955, joined the European Union in 1995, and is a founder of the OECD. Austria also signed the Schengen Agreement in 1995, and adopted the euro currency in 1999.", "coordx": 218, "coordy": 123, "condition":[5,19], "buildingid":[4,10], "image":"CITY0.png"}, 
{"id":1, "name":"Switzerland", "description":" and Swiss Confederation . Switzerland , officially the Swiss Confederation is a federal republic in Europe. While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\" . The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2 . While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zürich and Geneva. The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. The country has a history of armed neutrality going back to the Reformation, it has not been in a state of war internationally since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. In addition to being the birthplace of the Red Cross, Switzerland is home to numerous international organisations, including the second largest UN office. On the European level, it is a founding member of the European Free Trade Association, but notably it is not part of the European Union, nor the European Economic Area. However, the country does participate in the Schengen Area and the EU's single market through a number of bilateral treaties. Spanning the intersection of Germanic and Romance Europe, Switzerland comprises four main linguistic and cultural regions: German, French, Italian and Romansh. Although the majority of the population are German speaking, Swiss national identity is rooted in a common historical background, shared values such as federalism and direct democracy, and Alpine symbolism. Due to its linguistic diversity, Switzerland is known by a variety of native names: Schweiz [ˈʃvaɪts] ; Suisse [sɥis] ; Svizzera [ˈzvittsera] ; and Svizra [ˈʒviːtsrɐ] or [ˈʒviːtsʁːɐ] . On coins and stamps, Latin  is used instead of the four living languages. Switzerland is one of the most developed countries in the world, with the highest nominal wealth per adult and the eighth-highest per capita gross domestic product according to the IMF. Switzerland ranks at or near the top globally in several metrics of national performance, including government transparency, civil liberties, quality of life, economic competitiveness, and human development. Zürich and Geneva have each been ranked among the top cities in the world in terms of quality of life, with the former ranked second globally, according to Mercer.", "coordx": 210, "coordy": 124, "condition":[], "buildingid":[0,1,6], "image":"CITY1.png"}, 
{"id":3, "name":"Poland", "description":"The Kingdom of Poland, informally known as Congress Poland or Russian Poland, was created in 1815 by the Congress of Vienna as a sovereign state of the Russian part of Poland connected by personal union with the Russian Empire under the Constitution of the Kingdom of Poland until 1832. Then, it was gradually politically integrated into Russia over the course of the 19th century, made an official part of the Russian Empire in 1867, and finally replaced during the Great War by the Central Powers in 1915 with the theoretically existing Regency Kingdom of Poland. Though officially the Kingdom of Poland was a state with considerable political autonomy guaranteed by a liberal constitution, its rulers, the Russian Emperors, generally disregarded any restrictions on their power. Thus effectively it was little more than a puppet state of the Russian Empire. The autonomy was severely curtailed following uprisings in 1830–31 and 1863, as the country became governed by namestniks, and later divided into guberniya . Thus from the start, Polish autonomy remained little more than fiction. The territory of the Kingdom of Poland roughly corresponds to the Kalisz Region and the Lublin, Łódź, Masovia, Podlasia and Świętokrzyskie voivodeships of Poland.", "coordx": 229, "coordy": 112, "condition":[6,4], "buildingid":[2,3], "image":"CITY3.png"}, 
{"id":4, "name":"Prussia", "description":"The Free State of Prussia  was a German state formed after the abolition of the Kingdom of Prussia in the aftermath of the First World War. It was the major state of the German Reich during the time of the Weimar Republic, comprising almost  5⁄8  of its territory and population. Free state is another German term for republic that was coined in contrast to the Latin word, which was associated with the enemy France in the minds of many Germans of that time. The democratic Free State of Prussia was rendered incapacitated when it was taken over by the Preußenschlag  of 1932–33 and Otto Braun was forced from office. His government went to court over this ouster, but in 1933 the Nazi regime seized control of the Prussian government. From 1933, the Free State was deprived of parliamentary democracy and ruled exclusively under the leadership of the National Socialist German Workers Party . Initially, Prussia was administered by high-ranking Nazi Hermann Göring who was appointed Minister-President of Prussia. In 1935, the Free State's territory was dismantled into regional Gaue, some of which incorporated both Prussian and non-Prussian territory, thus effectively ending Prussia as a single territorial unit of Germany. Although the Free State of Prussia continued to exist in name under the premiership of Hermann Göring throughout the Nazi era, by 1935 the Prussian government had been effectively absorbed by the government of the German Reich and Göring's position as Minister-President had been relegated to a titular role in comparison to his more prominent duties in the government of the Third Reich. After the end of World War II Otto Braun approached US officials to reinstate the legal Prussian government. They and the other Allied Occupation forces, who had occupied all of Germany, were opposed to the idea and declared Prussia abolished in 1947.", "coordx": 219, "coordy": 111, "condition":[9,9,9,9,9,9], "buildingid":[7,7], "image":"CITY4.png"}, 
{"id":5, "name":"Berlin", "description":"Berlin  is the capital and the largest city of Germany as well as one of its 16 states. With a population of approximately 3.6 million people, Berlin is the second most populous city proper and the seventh most populous urban area in the European Union. Located in northeastern Germany on the banks of Rivers Spree and Havel, it is the centre of the Berlin-Brandenburg Metropolitan Region, which has about 6 million residents from more than 180 nations. Due to its location in the European Plain, Berlin is influenced by a temperate seasonal climate. Around one-third of the city's area is composed of forests, parks, gardens, rivers and lakes. First documented in the 13th century and situated at the crossing of two important historic trade routes, Berlin became the capital of the Margraviate of Brandenburg , the Kingdom of Prussia , the German Empire , the Weimar Republic  and the Third Reich . Berlin in the 1920s was the third largest municipality in the world. After World War II, the city was divided; East Berlin became the capital of East Germany while West Berlin became a de facto West German exclave, surrounded by the Berlin Wall  and East Germany territory. Following German reunification in 1990, Berlin was once again designated as the capital of united Germany. Berlin is a world city of culture, politics, media and science. Its economy is based on high-tech firms and the service sector, encompassing a diverse range of creative industries, research facilities, media corporations and convention venues. Berlin serves as a continental hub for air and rail traffic and has a highly complex public transportation network. The metropolis is a popular tourist destination. Significant industries also include IT, pharmaceuticals, biomedical engineering, clean tech, biotechnology, construction and electronics. Modern Berlin is home to world renowned universities, orchestras, museums, entertainment venues and is host to many sporting events. Its urban setting has made it a sought-after location for international film productions. The city is well known for its festivals, diverse architecture, nightlife, contemporary arts and a high quality of living. Over the last decade Berlin has seen the emergence of a cosmopolitan entrepreneurial scene.", "coordx": 219, "coordy": 111, "condition":[13,12], "buildingid":[5], "image":"CITY5.png"}, 
{"id":7, "name":"Kingdom of Prussia", "description":"The Kingdom of Prussia  was a German kingdom that constituted the state of Prussia between 1701 and 1918 and included parts of present-day Germany, Poland, Russia, Lithuania, Denmark, Belgium and the Czech Republic. It was the driving force behind the unification of Germany in 1871 and was the leading state of the German Empire until its dissolution in 1918. Although it took its name from the region called Prussia, it was based in the Margraviate of Brandenburg, where its capital was Berlin. The kings of Prussia were from the House of Hohenzollern. Prussia was a great power from the time it became a kingdom, through its predecessor, Brandenburg-Prussia, which became a military power under Frederick William, known as \"The Great Elector\". Prussia continued its rise to power under the guidance of Frederick II, more commonly known as Frederick the Great, the third son of Frederick William I. Frederick the Great was instrumental in starting the Seven Years' War, holding his own against Austria, Russia, France and Sweden and establishing Prussia’s role in the German states, as well as establishing the country as a European great power. After the might of Prussia was revealed it became a major power among the German states. Throughout the next hundred years Prussia went on to win many battles. It was because of its power that Prussia continuously tried to unify all the German states under its rule. After the Napoleonic Wars the issue of unifying Germany into one country caused revolution throughout the German states, with each wanting their own constitution. Initial attempts to unite Germany were unsuccessful, until the time of the North German Confederation which lasted from 1867–1871. It was seen as more of an alliance of military strength in the aftermath of the Austro-Prussian War but many of its laws were later used in the German Empire. The German Empire lasted from 1871–1918 with the successful unification of all the German states under Prussian hegemony. This was due to the defeat of Napoleon III in the Franco-Prussian War of 1870–71. The war united all the German states against a common enemy, and with the victory came an overwhelming wave of patriotism which changed the opinions of some of those who had been against unification. In 1871, Germany unified into a single country, minus Austria and Switzerland, with Prussia the dominant power. Prussia is considered the legal predecessor of the unified German Reich  and as such a direct ancestor of today's Federal Republic of Germany. The formal abolition of Prussia, carried out on 25 February 1947 by the fiat of the Allied Control Council referred to an alleged tradition of the kingdom as a bearer of militarism and reaction, and made way for the current setup of the German states. However, the Free State of Prussia , which followed the abolition of the Kingdom of Prussia in the aftermath of World War I, was a major democratic force in Weimar Germany until the nationalist coup of 1932 known as the Preußenschlag. The Kingdom left a significant cultural legacy, today notably promoted by the Prussian Cultural Heritage Foundation , which has become one of the largest cultural organisations in the world.", "coordx": 219, "coordy": 111, "condition":[16,16,16,16,16,16], "buildingid":[11,11], "image":"CITY7.png"}, 
{"id":8, "name":"Ithaca", "description":"Ithaca /ˈɪθəkə/ is a city in the Southern Tier-Finger Lakes region of New York. It is seat of Tompkins County, as well as the largest community in the Ithaca-Tompkins County metropolitan area. This area contains the municipalities of the Town of Ithaca, the village of Cayuga Heights, and other towns and villages in Tompkins County. The city of Ithaca is located on the southern shore of Cayuga Lake, in Central New York. It is named for the Greek island of Ithaca. Ithaca is home to Cornell University, an Ivy League school of over 20,000 students, most of whom study at its local campus. Ithaca College is located just south of the city in the Town of Ithaca, adding to the area's \"college town\" atmosphere. Nearby is Tompkins Cortland Community College . These three colleges bring tens of thousands of students who increase Ithaca's seasonal population during the school year. Some students settle in the area after graduation. The city's voters are notably more liberal than those in the remainder of Tompkins County or in upstate New York, generally voting for Democratic Party candidates. In 2010, the city's population was 30,014. Namgyal Monastery in Ithaca is the North American seat of Tenzin Gyatso, the 14th Dalai Lama.", "coordx": 91, "coordy": 133, "condition":[18], "buildingid":[8], "image":"CITY8.png"}, 
{"id":9, "name":"Asheville, North Carolina", "description":"Asheville is a city in and the county seat of Buncombe County, North Carolina, United States. It is the largest city in Western North Carolina, and the 11th largest city in North Carolina. The city's population was 83,393 according to the 2010 United States census. It is the principal city in the four-county Asheville metropolitan area, with a population of 424,858 in 2010. Asheville is home to the United States National Climatic Data Center , the world's largest active archive of weather data.", "coordx": 82, "coordy": 145, "condition":[20,20], "buildingid":[9], "image":"CITY9.png"}, 
{"id":10, "name":"Manhattan", "description":"Manhattan  is the most densely populated borough of New York City, its economic and administrative center, and the city's historical birthplace. The borough is coterminous with New York County, founded on November 1, 1683, as one of the original counties of the U.S. state of New York. The borough consists mostly of Manhattan Island, bounded by the East, Hudson, and Harlem Rivers, and also includes several small adjacent islands and Marble Hill, a small neighborhood on the U.S. mainland. Manhattan is often described as the cultural and financial capital of the world and hosts the United Nations Headquarters. Anchored by Wall Street in the Financial District of Lower Manhattan, New York City has been called both the most economically powerful city and the leading financial center of the world, and Manhattan is home to the world's two largest stock exchanges by total market capitalization: the New York Stock Exchange and NASDAQ. Many multinational media conglomerates are based in the borough. It is historically documented to have been purchased by Dutch colonists from Native Americans in 1626, for 60 guilders or about $24 in 1626 and US$1050 today. Manhattan real estate has since become among the most expensive in the world, with the value of Manhattan Island, including real estate, estimated to exceed US$3 trillion in 2013; residential property sale prices in Manhattan typically exceeded US$1,400 per square foot  as of 2016. New York County is the United States' second-smallest county by land area , and is also the most densely populated U.S. county. It is also one of the most densely populated areas in the world, with a census-estimated 2015 population of 1,644,518 living in a land area of 22.83 square miles , or 72,033 residents per square mile , higher than the density of any individual American city. On business days, the influx of commuters increases that number to over 3.9 million, or more than 170,000 people per square mile . Manhattan has the third-largest population of New York City's five boroughs, after Brooklyn and Queens, and is the smallest borough in terms of land area. Many districts and landmarks in Manhattan have become well known, as New York City received a record of nearly 60 million tourists in 2015, and Manhattan hosts three of the world's 10 most-visited tourist attractions in 2013: Times Square, Central Park, and Grand Central Terminal. The borough hosts many world-renowned bridges, such as the Brooklyn Bridge; skyscrapers such as the Empire State Building, one of the tallest skyscrapers in the world; and parks, such as Central Park. There are many historically significant places in Manhattan: Chinatown incorporates the highest concentration of Chinese people in the Western Hemisphere, and the Stonewall Inn in Greenwich Village is considered the birthplace of the modern gay rights movement. The City of New York was founded at the southern tip of Manhattan, and the borough houses New York City Hall, the seat of the City's Government. Numerous colleges and universities are located in Manhattan, including Columbia University, New York University, Weill Cornell Medical College, and Rockefeller University, which have been ranked among the top 35 in the world.", "coordx": 94, "coordy": 136, "condition":[23,25,32], "buildingid":[12,15,16], "image":"CITY10.png"}, 
{"id":11, "name":"Necochea", "description":"Necochea is a port and beach city in the southwest of Buenos Aires Province, Argentina. The city is located on the Atlantic coast, along the mouth of the Quequén Grande River, 528 km  from Buenos Aires and 120 km  southwest of Mar del Plata. The city proper has 65,459 inhabitants per the 2001 census [INDEC] and is the seat of government for Necochea Partido. The neighboring Port of Quequén, located on the eastern bank of the Quequén Grande River, is one of the most important ports in Argentina, and the gateway for the agricultural production of the southeast of the Province of Buenos Aires.", "coordx": 116, "coordy": 259, "condition":[26,26], "buildingid":[13], "image":"CITY11.png"}, 
{"id":12, "name":"Bordertown", "description":"Bordertown is a small South Australian town near the Victorian border. It is where the Dukes Highway and the railway line, the two main routes between Adelaide and Melbourne, cross Tatiara Creek. Bordertown is the commercial and administrative centre of the Tatiara District Council. Tatiara is the local Aboriginal word for \"Good Country\". Bordertown was established in 1852 when a direct route across the 90-mile desert was being planned for gold escorts from the Victorian goldfields to Adelaide. Police Inspector Alexander Tolmer was instructed to create a town as close as practical to the border. Tolmer was upset when the town was not named after him, but that was made up for by naming several sites around Bordertown after him, such as Tolmer Park and Tolmer Takeaway. Bordertown is also the birthplace of former Prime Minister of Australia, Bob Hawke.", "coordx": 390, "coordy": 144, "condition":[27,30], "buildingid":[14,19], "image":"CITY12.png"}, 
{"id":13, "name":"University of Cambridge", "description":"There is no information available about this", "coordx": 200, "coordy": 112, "condition":[], "buildingid":[17], "image":"CITY13.png"}, 
{"id":14, "name":"هونغن", "description":"Hungen is a town in the district of Gießen, in Hesse, Germany. It is situated 20 km southeast of Gießen, and 18 km northeast of Friedberg. Surrounding towns are Laubach to the north, Nidda to the east, Wölfersheim to the south, and Münzenberg and Lich to the west. The history of Hungen dates back to 782. In 1806 it came under the sovereignty of the Grand Duchy of Hesse. Buildings of interest include the Hungen Castle, the Evangelical Church, parts of the medieval city wall and Hungen station.", "coordx": 212, "coordy": 116, "condition":[34], "buildingid":[18], "image":"CITY14.png"}],
"dialoguenodes":[{"id":101, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 100, "children": [102,112,120,132,134,135,137,139], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":139, "dialogueline":"Hedley Marston has for deathyear", "eventid":"71", "dialoguetype": 616, "children": [101], "condition":[-1], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":137, "dialogueline":"Carl A. Schenck is known for field. forestry", "eventid":"69", "dialoguetype": 616, "children": [101], "condition":[-1], "option":"Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":135, "dialogueline":"Efraim Racker has for deathplace", "eventid":"67", "dialoguetype": 616, "children": [101], "condition":[-1], "option":"I could use a lead. Do you remember any information about one of the suspects?", "isroot": false}, 
{"id":134, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"66", "dialoguetype": 0, "children": [101], "condition":[65], "option":"Tell me about yourself.", "isroot": false}, 
{"id":132, "dialogueline":"I am known for subject. category:fellows of the royal society", "eventid":"64", "dialoguetype": 0, "children": [101], "condition":[63], "option":"Tell me about yourself.", "isroot": false}, 
{"id":120, "dialogueline":"I am know for field. ecology", "eventid":"52", "dialoguetype": 0, "children": [101], "condition":[51], "option":"Tell me about yourself.", "isroot": false}, 
{"id":112, "dialogueline":"I am know for deathyear. unknown", "eventid":"44", "dialoguetype": 0, "children": [101], "condition":[43], "option":"Tell me about yourself.", "isroot": false}, 
{"id":102, "dialogueline":"You'll find nothing.", "eventid":"-1", "dialoguetype": 0, "children": [101], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":97, "dialogueline":"Hello? How can I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [98], "condition":[], "option":"", "isroot": true}, 
{"id":98, "dialogueline":"Ask away.", "eventid":"-1", "dialoguetype": 100, "children": [99], "condition":[], "option":"Greetings, I'm a super sleuth assigned to the victim's case. Please could you help answer some questions?", "isroot": false}, 
{"id":99, "dialogueline":"I'm not sure. Maybe, I think Alexander Watt might know.", "eventid":"-1", "dialoguetype": 0, "children": [100], "condition":[], "option":"I am seeking Alexander Watt. Any idea where they could be?", "isroot": false}, 
{"id":100, "dialogueline":"I suggest you check out هونغن.", "eventid":"34", "dialoguetype": 0, "children": [98], "condition":[], "option":"Where could I go to meet Alexander Watt?", "isroot": false}, 
{"id":92, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"", "isroot": true}, 
{"id":82, "dialogueline":"I want my lawyer", "eventid":"-1", "dialoguetype": 100, "children": [83,114,118,131,140,142], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":142, "dialogueline":"I am know for subject. category:fellows of the royal society", "eventid":"74", "dialoguetype": 0, "children": [82], "condition":[73], "option":"Tell me about yourself.", "isroot": false}, 
{"id":140, "dialogueline":"What, deathyear? I don't know anything about that.", "eventid":"72", "dialoguetype": 0, "children": [82], "condition":[71], "option":"Tell me about yourself.", "isroot": false}, 
{"id":131, "dialogueline":"Alexander Watt is known for subject. category:1892 births", "eventid":"63", "dialoguetype": 616, "children": [82], "condition":[-1], "option":"Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":118, "dialogueline":"I am know for field. biochemistry", "eventid":"50", "dialoguetype": 0, "children": [82], "condition":[49], "option":"Tell me about yourself.", "isroot": false}, 
{"id":114, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"46", "dialoguetype": 0, "children": [82], "condition":[45], "option":"Tell me about yourself.", "isroot": false}, 
{"id":83, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [82], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":76, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 100, "children": [77], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":77, "dialogueline":"Go away", "eventid":"-1", "dialoguetype": 0, "children": [76], "condition":[], "option":"I'm looking for Hedley Marston?...", "isroot": false}, 
{"id":78, "dialogueline":"Hello?", "eventid":"-1", "dialoguetype": 0, "children": [79], "condition":[], "option":"", "isroot": true}, 
{"id":79, "dialogueline":"Okay. Ask away.", "eventid":"-1", "dialoguetype": 100, "children": [80,129], "condition":[], "option":"Greetings, I'm a super sleuth. Thank you for your time, please would you help answer some questions?", "isroot": false}, 
{"id":129, "dialogueline":"Reinhold Strassmann is known for subject. number theorists", "eventid":"61", "dialoguetype": 616, "children": [79], "condition":[-1], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":80, "dialogueline":"I'm not certain. However, Hedley Marston could know.", "eventid":"-1", "dialoguetype": 0, "children": [81], "condition":[], "option":"A friend hinted to me to look for Hedley Marston. Any idea where they could be?", "isroot": false}, 
{"id":81, "dialogueline":"I would go to Bordertown.", "eventid":"27", "dialoguetype": 0, "children": [79], "condition":[], "option":"Where would I see Hedley Marston?", "isroot": false}, 
{"id":93, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [94], "condition":[], "option":"", "isroot": true}, 
{"id":94, "dialogueline":"I'm not sure I'll be very helpful...", "eventid":"-1", "dialoguetype": 100, "children": [95], "condition":[], "option":"Hello, I'm a detective. Could I ask you some questions?", "isroot": false}, 
{"id":95, "dialogueline":"It is is in in University of Cambridge.", "eventid":"33", "dialoguetype": 0, "children": [94], "condition":[], "option":"I am seeking Alexander Watt. Have you know of them?", "isroot": false}, 
{"id":71, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [72], "condition":[], "option":"", "isroot": true}, 
{"id":72, "dialogueline":"Of course.", "eventid":"-1", "dialoguetype": 100, "children": [73], "condition":[], "option":"Greetings, I'm a private investigator investigating the victim's case. Please could you help answer some questions?", "isroot": false}, 
{"id":73, "dialogueline":"I would look in the Planetarium if I were you. You could find something.", "eventid":"-1", "dialoguetype": 0, "children": [74], "condition":[], "option":"I am searching for Hedley Marston. Have you know of them?", "isroot": false}, 
{"id":74, "dialogueline":"It is is in in Manhattan. Try there.", "eventid":"25", "dialoguetype": 0, "children": [72], "condition":[], "option":"Where might I go to see the Planetarium?", "isroot": false}, 
{"id":57, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 100, "children": [58], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":58, "dialogueline":"Go away", "eventid":"-1", "dialoguetype": 0, "children": [57], "condition":[], "option":"I'm looking for Carl A. Schenck?...", "isroot": false}, 
{"id":59, "dialogueline":"I want my lawyer", "eventid":"-1", "dialoguetype": 100, "children": [60,106,110,124,125,127,138], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":138, "dialogueline":"I am know for field. forestry", "eventid":"70", "dialoguetype": 0, "children": [59], "condition":[69], "option":"Tell me about yourself.", "isroot": false}, 
{"id":127, "dialogueline":"Reinhold Strassmann is known for field. mathematics", "eventid":"59", "dialoguetype": 616, "children": [59], "condition":[-1], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":125, "dialogueline":"Reinhold Strassmann has for deathplace", "eventid":"57", "dialoguetype": 616, "children": [59], "condition":[-1], "option":"Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":124, "dialogueline":"I am know for subject. history of forestry education", "eventid":"56", "dialoguetype": 0, "children": [59], "condition":[55], "option":"Tell me about yourself.", "isroot": false}, 
{"id":110, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"42", "dialoguetype": 0, "children": [59], "condition":[41], "option":"Tell me about yourself.", "isroot": false}, 
{"id":106, "dialogueline":"What, deathyear? I don't know anything about that.", "eventid":"38", "dialoguetype": 0, "children": [59], "condition":[37], "option":"Tell me about yourself.", "isroot": false}, 
{"id":60, "dialogueline":"You have no proof.", "eventid":"-1", "dialoguetype": 0, "children": [59], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":52, "dialogueline":"Hello? Do you want something?", "eventid":"-1", "dialoguetype": 0, "children": [53], "condition":[], "option":"", "isroot": true}, 
{"id":53, "dialogueline":"I'm not sure I'll be very helpful...", "eventid":"-1", "dialoguetype": 100, "children": [54,121,123], "condition":[], "option":"Greetings, I'm a super sleuth. Please can you help answer some questions?", "isroot": false}, 
{"id":123, "dialogueline":"Carl A. Schenck is known for subject. history of forestry education", "eventid":"55", "dialoguetype": 616, "children": [53], "condition":[-1], "option":"I need a lead. Could you tell me any information about one of the suspects?", "isroot": false}, 
{"id":121, "dialogueline":"Efraim Racker has for deathyear", "eventid":"53", "dialoguetype": 616, "children": [53], "condition":[-1], "option":"I need your help. Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":54, "dialogueline":"I would check out the Hotel if I were you. You could find something.", "eventid":"-1", "dialoguetype": 0, "children": [55], "condition":[], "option":"I am seeking Carl A. Schenck. Do you know where they are?", "isroot": false}, 
{"id":55, "dialogueline":"I would check out Austria. Try travelling there.", "eventid":"19", "dialoguetype": 0, "children": [53], "condition":[], "option":"Where would I go to find the Hotel?", "isroot": false}, 
{"id":48, "dialogueline":"Hi. How may I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [49], "condition":[], "option":"", "isroot": true}, 
{"id":49, "dialogueline":"Sure.", "eventid":"-1", "dialoguetype": 100, "children": [50], "condition":[], "option":"Hi, I'm a private investigator investigating the victim's case. Thank you for your time, can you answer some questions for me?", "isroot": false}, 
{"id":50, "dialogueline":"Bernhard Fernow could know.", "eventid":"-1", "dialoguetype": 0, "children": [51], "condition":[], "option":"A friend directed me to look for Carl A. Schenck. Have you heard of them?", "isroot": false}, 
{"id":51, "dialogueline":"They were rumored to be in Ithaca. They might still be there.", "eventid":"18", "dialoguetype": 0, "children": [49], "condition":[], "option":"Where could I go to find Bernhard Fernow?", "isroot": false}, 
{"id":33, "dialogueline":"Hi. Can I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [34], "condition":[], "option":"", "isroot": true}, 
{"id":34, "dialogueline":"I'll do my best.", "eventid":"-1", "dialoguetype": 100, "children": [35], "condition":[], "option":"Greetings, I'm working on the victim's case. If you don't mind, please could you help answer some questions?", "isroot": false}, 
{"id":35, "dialogueline":"I would seek out Reinhold Strassmann if I were you. They might know something.", "eventid":"-1", "dialoguetype": 0, "children": [36], "condition":[], "option":"A friend hinted to me to find Reinhold Strassmann. Do you know where they could be?", "isroot": false}, 
{"id":36, "dialogueline":"Last I had heard they were seen in Berlin.", "eventid":"13", "dialoguetype": 0, "children": [34], "condition":[], "option":"Where could I see Reinhold Strassmann?", "isroot": false}, 
{"id":37, "dialogueline":"You can't prove anything!", "eventid":"-1", "dialoguetype": 100, "children": [38,108,115,117,126,128,130], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":130, "dialogueline":"I am know for subject. number theorists", "eventid":"62", "dialoguetype": 0, "children": [37], "condition":[61], "option":"Tell me about yourself.", "isroot": false}, 
{"id":128, "dialogueline":"I am know for field. mathematics", "eventid":"60", "dialoguetype": 0, "children": [37], "condition":[59], "option":"Tell me about yourself.", "isroot": false}, 
{"id":126, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"58", "dialoguetype": 0, "children": [37], "condition":[57], "option":"Tell me about yourself.", "isroot": false}, 
{"id":117, "dialogueline":"Hedley Marston is known for field. biochemistry", "eventid":"49", "dialoguetype": 616, "children": [37], "condition":[-1], "option":"I need your help. Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":115, "dialogueline":"Efraim Racker is known for field. biochemistry", "eventid":"47", "dialoguetype": 616, "children": [37], "condition":[-1], "option":"I need some assistance. Do you know some information about one of the suspects?", "isroot": false}, 
{"id":108, "dialogueline":"What, deathyear? I don't know anything about that.", "eventid":"40", "dialoguetype": 0, "children": [37], "condition":[39], "option":"Tell me about yourself.", "isroot": false}, 
{"id":38, "dialogueline":"You'll find nothing.", "eventid":"-1", "dialoguetype": 0, "children": [37], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":28, "dialogueline":"Greetings. May I help you?", "eventid":"-1", "dialoguetype": 0, "children": [29], "condition":[], "option":"", "isroot": true}, 
{"id":29, "dialogueline":"I'm not sure I'll be very helpful...", "eventid":"-1", "dialoguetype": 100, "children": [30], "condition":[], "option":"Hi, I'm working on the victim's case. If it's not too much trouble, please could you help answer some questions?", "isroot": false}, 
{"id":30, "dialogueline":"I'm not quite certain. However, I would explore the Villa if I were you. You could find something.", "eventid":"-1", "dialoguetype": 0, "children": [31], "condition":[], "option":"Someone directed me to find Reinhold Strassmann. Do you know where they could be?", "isroot": false}, 
{"id":31, "dialogueline":"I recommend you travel to Switzerland.", "eventid":"11", "dialoguetype": 0, "children": [29], "condition":[], "option":"Where would I find the Villa?", "isroot": false}, 
{"id":18, "dialogueline":"I don't have to speak to you", "eventid":"-1", "dialoguetype": 100, "children": [19,104,107,109,111,113,116,122,136], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":136, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"68", "dialoguetype": 0, "children": [18], "condition":[67], "option":"Tell me about yourself.", "isroot": false}, 
{"id":122, "dialogueline":"What, deathyear? I don't know anything about that.", "eventid":"54", "dialoguetype": 0, "children": [18], "condition":[53], "option":"Tell me about yourself.", "isroot": false}, 
{"id":116, "dialogueline":"I am know for field. biochemistry", "eventid":"48", "dialoguetype": 0, "children": [18], "condition":[47], "option":"Tell me about yourself.", "isroot": false}, 
{"id":113, "dialogueline":"Hedley Marston has for deathplace", "eventid":"45", "dialoguetype": 616, "children": [18], "condition":[-1], "option":"I could use a lead. Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":111, "dialogueline":"Alexander Watt has for deathyear", "eventid":"43", "dialoguetype": 616, "children": [18], "condition":[-1], "option":"I need a lead. Do you have any information about one of the suspects?", "isroot": false}, 
{"id":109, "dialogueline":"Carl A. Schenck has for deathplace", "eventid":"41", "dialoguetype": 616, "children": [18], "condition":[-1], "option":"Could you tell me any information about one of the suspects?", "isroot": false}, 
{"id":107, "dialogueline":"Reinhold Strassmann has for deathyear", "eventid":"39", "dialoguetype": 616, "children": [18], "condition":[-1], "option":"I need your cooperation. Do you have any information about one of the suspects?", "isroot": false}, 
{"id":104, "dialogueline":"I am know for subject. members of the united states national academy of sciences", "eventid":"36", "dialoguetype": 0, "children": [18], "condition":[35], "option":"Tell me about yourself.", "isroot": false}, 
{"id":19, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [18], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":9, "dialogueline":"Greetings. Can I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [10], "condition":[], "option":"", "isroot": true}, 
{"id":10, "dialogueline":"I'll do my best.", "eventid":"-1", "dialoguetype": 100, "children": [11,105], "condition":[], "option":"Greetings, I'm a detective following the victim's case. Would I ask you some questions?", "isroot": false}, 
{"id":105, "dialogueline":"Carl A. Schenck has for deathyear", "eventid":"37", "dialoguetype": 616, "children": [10], "condition":[-1], "option":"I could use a lead. Would you tell me any information about one of the suspects?", "isroot": false}, 
{"id":11, "dialogueline":"The Bar might reveal something.", "eventid":"-1", "dialoguetype": 0, "children": [12], "condition":[], "option":"Someone encouraged me to look for Efraim Racker. Any idea where they could be?", "isroot": false}, 
{"id":12, "dialogueline":"Have you gone to in Poland? Try travelling there.", "eventid":"4", "dialoguetype": 0, "children": [10], "condition":[], "option":"Where is the Bar?", "isroot": false}, 
{"id":86, "dialogueline":"Hi. How may I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [87], "condition":[], "option":"", "isroot": true}, 
{"id":87, "dialogueline":"Sure.", "eventid":"28", "dialoguetype": 100, "children": [88,141], "condition":[], "option":"Greetings, I'm investigating the victim's case. If you don't mind, could you answer some questions for me?", "isroot": false}, 
{"id":141, "dialogueline":"Hedley Marston is known for subject. category:fellows of the royal society", "eventid":"73", "dialoguetype": 616, "children": [87], "condition":[28], "option":"Do you have any information about one of the suspects?", "isroot": false}, 
{"id":88, "dialogueline":"I am Władysław Natanson.", "eventid":"29", "dialoguetype": 0, "children": [89], "condition":[], "option":"Please, state your name.", "isroot": false}, 
{"id":89, "dialogueline":"If I remember correctly, the victim mentioned a thing named Bordertown.", "eventid":"30", "dialoguetype": 0, "children": [90], "condition":[], "option":"Is there anything you recall that might be useful to the investigation?", "isroot": false}, 
{"id":90, "dialogueline":"I am suspicious of Alexander Watt. However, It is hard to say.", "eventid":"31", "dialoguetype": 0, "children": [87], "condition":[], "option":"I would like your help. Do you have any more information?", "isroot": false}, 
{"id":65, "dialogueline":"Hello? How may I help you?", "eventid":"-1", "dialoguetype": 0, "children": [66], "condition":[], "option":"", "isroot": true}, 
{"id":66, "dialogueline":"Are you sure you need me?", "eventid":"21", "dialoguetype": 100, "children": [67,133], "condition":[], "option":"Greetings, I'm a super sleuth. If you don't mind, I would appreciate it if you answer some questions.", "isroot": false}, 
{"id":133, "dialogueline":"Alexander Watt has for deathplace", "eventid":"65", "dialoguetype": 616, "children": [66], "condition":[21], "option":"Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":67, "dialogueline":"I am called Maynard.", "eventid":"22", "dialoguetype": 0, "children": [69], "condition":[], "option":"Can you tell me who you are?", "isroot": false}, 
{"id":69, "dialogueline":"Neil deGrasse Tyson travelled to Manhattan.", "eventid":"23", "dialoguetype": 0, "children": [70], "condition":[], "option":"Is there anything about the victim that you remember?", "isroot": false}, 
{"id":70, "dialogueline":"Personally, I believe Hedley Marston could have a motive.", "eventid":"24", "dialoguetype": 0, "children": [66], "condition":[], "option":"Do you have any more information?", "isroot": false}, 
{"id":42, "dialogueline":"Greetings.", "eventid":"-1", "dialoguetype": 0, "children": [44], "condition":[], "option":"", "isroot": true}, 
{"id":44, "dialogueline":"Yeah.", "eventid":"14", "dialoguetype": 100, "children": [45], "condition":[], "option":"Hi, I'm investigating the victim's case. If it's not too much trouble, can I ask you some questions?", "isroot": false}, 
{"id":45, "dialogueline":"You can call me Takkō Ishimori.", "eventid":"15", "dialoguetype": 0, "children": [46], "condition":[], "option":"State your name.", "isroot": false}, 
{"id":46, "dialogueline":"Last I thought, the victim travelled to Kingdom of Prussia. I thought the victim enjoyed it there.", "eventid":"16", "dialoguetype": 0, "children": [47], "condition":[], "option":"Is there anything specific you remember that might be useful to the investigation?", "isroot": false}, 
{"id":47, "dialogueline":"I am suspicious of Carl A. Schenck.", "eventid":"17", "dialoguetype": 0, "children": [44], "condition":[], "option":"I need a lead. Do you have any more information?", "isroot": false}, 
{"id":22, "dialogueline":"Hello? How may I help you?", "eventid":"-1", "dialoguetype": 0, "children": [24], "condition":[], "option":"", "isroot": true}, 
{"id":24, "dialogueline":"Certainly. Whatever I can do to help.", "eventid":"7", "dialoguetype": 100, "children": [25,119], "condition":[], "option":"Hello, I'm investigating the victim's case. Thank you for your time, I have some questions for you.", "isroot": false}, 
{"id":119, "dialogueline":"Alexander Watt is known for field. ecology", "eventid":"51", "dialoguetype": 616, "children": [24], "condition":[7], "option":"Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":25, "dialogueline":"I am named Elsa Einstein.", "eventid":"8", "dialoguetype": 0, "children": [26], "condition":[], "option":"Who are you?", "isroot": false}, 
{"id":26, "dialogueline":"I believe the victim travelled to Prussia.  That's what I heard at least.", "eventid":"9", "dialoguetype": 0, "children": [27], "condition":[], "option":"Is there something specific you remember that might be of use to the investigation?", "isroot": false}, 
{"id":27, "dialogueline":"I believe Reinhold Strassmann could be connected.", "eventid":"10", "dialoguetype": 0, "children": [24], "condition":[], "option":"I would like a lead. Can you think of someone who might know something?", "isroot": false}, 
{"id":3, "dialogueline":"Hello?", "eventid":"-1", "dialoguetype": 0, "children": [4], "condition":[], "option":"", "isroot": true}, 
{"id":4, "dialogueline":"Yes.", "eventid":"0", "dialoguetype": 100, "children": [5], "condition":[], "option":"Hello, I'm a detective. I'm sorry to disturb, can I ask you some questions?", "isroot": false}, 
{"id":5, "dialogueline":"Okay, I am Satyendra Nath Bose.", "eventid":"1", "dialoguetype": 0, "children": [7], "condition":[], "option":"Would you tell me your name?", "isroot": false}, 
{"id":7, "dialogueline":"I think Aurel Stodola visited Switzerland. Hopefully that helps you.", "eventid":"2", "dialoguetype": 0, "children": [8], "condition":[], "option":"Did the victim mention anything specific that you can recollect?", "isroot": false}, 
{"id":8, "dialogueline":"I believe Efraim Racker might be guilty. However, It is hard to say.", "eventid":"3", "dialoguetype": 0, "children": [4], "condition":[], "option":"Do you have any more information?", "isroot": false}, 
{"id":14, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [15], "condition":[], "option":"", "isroot": true}, 
{"id":15, "dialogueline":"Anything to help.", "eventid":"-1", "dialoguetype": 100, "children": [16], "condition":[], "option":"Hello, I'm a private investigator following the victim's case. If it's not too much trouble, please would you help answer some questions?", "isroot": false}, 
{"id":16, "dialogueline":"Efraim Racker might know.", "eventid":"-1", "dialoguetype": 0, "children": [17], "condition":[], "option":"I am searching for Efraim Racker. Any idea where they could have gone?", "isroot": false}, 
{"id":17, "dialogueline":"Last I had heard they were seen in Poland.", "eventid":"6", "dialoguetype": 0, "children": [15], "condition":[], "option":"Where is Efraim Racker?", "isroot": false}],
"crime":{"suspects":[2,6,12,23,19],"culprit":23,"facts":[{"pid":2,"factoid":"Efraim Racker is known for subject. members of the united states national academy of sciences","condition":35},{"pid":2,"factoid":"Efraim Racker has for deathplace","condition":67},{"pid":2,"factoid":"Efraim Racker is known for field. biochemistry","condition":47},{"pid":2,"factoid":"Efraim Racker has for deathyear","condition":53},{"pid":6,"factoid":"Reinhold Strassmann is known for subject. number theorists","condition":61},{"pid":6,"factoid":"Reinhold Strassmann has for deathplace","condition":57},{"pid":6,"factoid":"Reinhold Strassmann is known for field. mathematics","condition":59},{"pid":6,"factoid":"Reinhold Strassmann has for deathyear","condition":39},{"pid":12,"factoid":"Carl A. Schenck is known for subject. history of forestry education","condition":55},{"pid":12,"factoid":"Carl A. Schenck has for deathplace","condition":41},{"pid":12,"factoid":"Carl A. Schenck is known for field. forestry","condition":69},{"pid":12,"factoid":"Carl A. Schenck has for deathyear","condition":37},{"pid":23,"factoid":"Alexander Watt is known for subject. category:1892 births","condition":63},{"pid":23,"factoid":"Alexander Watt has for deathplace","condition":65},{"pid":23,"factoid":"Alexander Watt is known for field. ecology","condition":51},{"pid":23,"factoid":"Alexander Watt has for deathyear","condition":43},{"pid":19,"factoid":"Hedley Marston is known for subject. category:fellows of the royal society","condition":73},{"pid":19,"factoid":"Hedley Marston has for deathplace","condition":45},{"pid":19,"factoid":"Hedley Marston is known for field. biochemistry","condition":49},{"pid":19,"factoid":"Hedley Marston has for deathyear","condition":71}]}}
