{
"people" : [
{"id":3, "name":"Adolf Hitler", "description":"Adolf Hitler  was a German politician who was the leader of the Nazi Party , Chancellor of Germany from 1933 to 1945, and Führer  of Nazi Germany from 1934 to 1945.  As dictator of the German Reich, he initiated World War II in Europe with the invasion of Poland in September 1939 and was a central figure of the Holocaust.", "drootid": 3, "condition":[], "buildingid":0, "image":"PERSON3.png"}, 
{"id":6, "name":"Arthur Kaufmann", "description":"Arthur Kaufmann  was an Austrian attorney, philosopher and chess master.", "drootid": 16, "condition":[], "buildingid":0, "image":"PERSON6.png"}, 
{"id":15, "name":"Thomas Young", "description":"Thomas Young  was an English polymath and physician.  Young made notable scientific contributions to the fields of vision, light, solid mechanics, energy, physiology, language, musical harmony, and Egyptology.", "drootid": 40, "condition":[], "buildingid":0, "image":"PERSON15.png"}, 
{"id":22, "name":"William Thomson, Baron Kelvin", "description":"William Thomson, 1st Baron Kelvin OM GCVO PC FRS FRSE  was a Scotch-Irish mathematical physicist and engineer who was born in Belfast in 1824.  At the University of Glasgow he did important work in the mathematical analysis of electricity and formulation of the first and second laws of thermodynamics, and did much to unify the emerging discipline of physics in its modern form.", "drootid": 75, "condition":[], "buildingid":0, "image":"PERSON22.png"}, 
{"id":26, "name":"Alphonse", "description":"There is no information available for this character.", "drootid": 98, "condition":[], "buildingid":0, "image":"PERSON26.png"}, 
{"id":1, "name":"John Avise", "description":"John Charles Avise  is an American evolutionary geneticist, conservationist, ecologist and natural historian.  He is a Distinguished Professor, Ecology & Evolutionary Biology, University of California, Irvine, and was previously a professor in the Department of Genetics at the University of Georgia.", "drootid": 1, "condition":[5], "buildingid":1, "image":"PERSON1.png"}, 
{"id":2, "name":"Francisco J. Ayala", "description":" Francisco José Ayala Pereda  is a Spanish-American evolutionary biologist and philosopher at the University of California, Irvine.  He is a former Dominican priest, ordained in 1960, but left the priesthood that same year.", "drootid": 12, "condition":[6], "buildingid":2, "image":"PERSON2.png"}, 
{"id":7, "name":"Raphael", "description":"There is no information available for this character.", "drootid": 17, "condition":[9], "buildingid":6, "image":"PERSON7.png"}, 
{"id":20, "name":"Goebbels (famiglia)", "description":"The Goebbels children were the five daughters and one son born to Nazi propaganda minister Joseph Goebbels and his wife Magda Goebbels.  The children, born between 1932 and 1940, were murdered by their parents in Berlin on 1 May 1945, the day both parents committed suicide.", "drootid": 73, "condition":[25], "buildingid":14, "image":"PERSON20.png"}, 
{"id":8, "name":"Edward", "description":"There is no information available for this character.", "drootid": 22, "condition":[11], "buildingid":7, "image":"PERSON8.png"}, 
{"id":9, "name":"Vlad", "description":"There is no information available for this character.", "drootid": 26, "condition":[12], "buildingid":8, "image":"PERSON9.png"}, 
{"id":5, "name":"Otto Wallach", "description":"Otto Wallach  was a German chemist and recipient of the 1910 Nobel Prize in Chemistry for his work on alicyclic compounds.", "drootid": 33, "condition":[13], "buildingid":5, "image":"PERSON5.png"}, 
{"id":11, "name":"Thurgood Marshall", "description":"Thurgood Marshall  was an Associate Justice of the Supreme Court of the United States, serving from October 1967 until October 1991.  Marshall was the Court's 96th justice and its first African-American justice.", "drootid": 36, "condition":[16], "buildingid":9, "image":"PERSON11.png"}, 
{"id":12, "name":"Tom C. Clark", "description":"Thomas Campbell Clark   was a Texas lawyer who served in the United States Department of Justice beginning in 1937, as United States Attorney General from 1945 to 1949, and an Associate Justice of the Supreme Court of the United States from 1949 to 1967.", "drootid": 37, "condition":[18], "buildingid":10, "image":"PERSON12.png"}, 
{"id":16, "name":"Peter", "description":"There is no information available for this character.", "drootid": 53, "condition":[18], "buildingid":10, "image":"PERSON16.png"}, 
{"id":13, "name":"the United States", "description":", US , USA , and United States .  The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.", "drootid": 38, "condition":[19], "buildingid":11, "image":"PERSON13.png"}, 
{"id":17, "name":"Vlad", "description":"There is no information available for this character.", "drootid": 62, "condition":[19], "buildingid":11, "image":"PERSON17.png"}, 
{"id":14, "name":"Paco Axel Lagerstrom", "description":"Paco Axel Lagerstrom  was an applied mathematician and aeronautical engineer.  He was trained formally in mathematics, but worked for much of his career in aeronautical applications.", "drootid": 69, "condition":[20], "buildingid":12, "image":"PERSON14.png"}, 
{"id":19, "name":"Joseph Goebbels", "description":"Paul Joseph Goebbels  was a German politician and Reich Minister of Propaganda in Nazi Germany from 1933 to 1945.  One of Adolf Hitler's close associates and most devoted followers, he was known for his skills in public speaking and his deep and virulent antisemitism, which led to his supporting the extermination of the Jews in the Holocaust.", "drootid": 72, "condition":[23], "buildingid":13, "image":"PERSON19.png"}, 
{"id":21, "name":"Jacob Palis", "description":"Jacob Palis, Jr.   is a Brazilian mathematician and professor.", "drootid": 94, "condition":[27], "buildingid":15, "image":"PERSON21.png"}, 
{"id":23, "name":"Thomas Lewis", "description":"Thomas Lewis  was an artist and peace activist, primarily noted for his participation with the Baltimore Four and the Catonsville Nine.", "drootid": 92, "condition":[27], "buildingid":15, "image":"PERSON23.png"}, 
{"id":27, "name":"Edward", "description":"There is no information available for this character.", "drootid": 103, "condition":[32], "buildingid":19, "image":"PERSON27.png"}, 
{"id":25, "name":"Michael Sternberg", "description":"Sternberg was educated at Hendon County Grammar School and Gonville and Caius College, Cambridge where he was awarded a Bachelor of Arts degree in Natural Sciences  in 1972.  He went on to do a Master of Science degree in Computing at Imperial College London followed by a DPhil degree from the University of Oxford  in 1978 for research supervised by David Chilton Phillips.", "drootid": 110, "condition":[34], "buildingid":17, "image":"PERSON25.png"}, 
{"id":28, "name":"Dirk Schuebel", "description":"Dirk Steffen Schuebel  is a diplomat and economist from Germany.  He has been the Head of the Delegation of the European Union to Moldova since November 2009.", "drootid": 108, "condition":[34], "buildingid":17, "image":"PERSON28.png"}],
"items":[{"id":5, "name":"Flashlight", "description":"", "condition": [], "eventid": -1, "buildingid":0, "image":"null"}, 
{"id":1, "name":"American Scientist", "description":"It is a book about American Scientist. It says: American Scientist  is an American bimonthly science and technology magazine published since 1913 by Sigma Xi, The Scientific Research Society.  Each issue includes four to five feature articles written by prominent scientists and engineers who review research in fields from molecular biology to computer engineering.  The following people are mentioned:  John Avise Sigma Xi   And the following place: Atomic bombings of Hiroshima and Nagasaki", "condition": [4], "eventid": 5, "buildingid":4, "image":"null"}, 
{"id":3, "name":"Germans", "description":"It is a book about Germans. It says: Germans  are a Germanic ethnic group native to Central Europe, who share a common German ancestry, culture and history.  German is the shared mother tongue of a substantial majority of ethnic Germans.  The following people are mentioned:  Hungary E.T.A. Hoffmann Albert Einstein", "condition": [30], "eventid": 32, "buildingid":18, "image":"null"}, 
{"id":6, "name":"Crowbar", "description":"", "condition": [], "eventid": -1, "buildingid":2, "image":"null"}, 
{"id":0, "name":"Scientific American", "description":"It is a photograph about Scientific American. In a corner, it says:Scientific American  is an American popular science magazine.  Many famous scientists, including Albert Einstein, have contributed articles in the past 170 years.  There are things written behind: 14145 Sciam American Scientist  And the following places: Switzerland and Atomic bombings of Hiroshima and Nagasaki", "condition": [2], "eventid": 4, "buildingid":3, "image":"null"}, 
{"id":2, "name":"1940 births", "description":"It is a letter about 1940 births. It says: 1940 births.  The following people are mentioned:  Thomas Lewis (activist) Jacob Palis   And the following place: Brazil", "condition": [26], "eventid": 27, "buildingid":16, "image":"null"}, 
{"id":4, "name":"List of Ambassadors to Moldova", "description":"It is a book about List of Ambassadors to Moldova. It says: This is a list of ambassadors to Moldova.  Note that some ambassadors are responsible for more than one country while others are directly accredited to Chi?in?u.  The following people are mentioned:  Dirk Schuebel Michael Sternberg Greece   And the following place: Germany", "condition": [33], "eventid": 34, "buildingid":19, "image":"null"}],
"buildings":[{"id":0, "name":"House of Albert Einstein", "description":" and Swiss Confederation  Switzerland , officially the Swiss Confederation is a federal republic in Europe", "locktype": "null", "coordx": 239, "coordy": 186, "condition":[], "cityid":0, "peopleid":[3,6,15,22,26], "itemsid":[5], "image":"BUILDING0.png"}, 
{"id":4, "name":"Villa", "description":" While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\"  The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east", "locktype": "null", "coordx": 287, "coordy": 268, "condition":[4], "cityid":0, "peopleid":[], "itemsid":[1], "image":"BUILDING4.png"}, 
{"id":18, "name":"School", "description":" Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2  While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zürich and Geneva", "locktype": "null", "coordx": 171, "coordy": 92, "condition":[30], "cityid":0, "peopleid":[], "itemsid":[3], "image":"BUILDING18.png"}, 
{"id":1, "name":"House of John Avise", "description":"The United States, with the consent of the United Kingdom as laid down in the Quebec Agreement, dropped nuclear weapons on the Japanese cities of Hiroshima and Nagasaki on August 6 and 9 1945, respectively, during the final stage of World War II The two bombings, which killed at least 129,000 people, remain the only use of nuclear weapons for warfare in history", "locktype": "null", "coordx": 338, "coordy": 201, "condition":[5], "cityid":1, "peopleid":[1], "itemsid":[], "image":"BUILDING1.png"}, 
{"id":2, "name":"House of Francisco J. Ayala", "description":"Madrid  is the capital of Spain, and the largest municipality of the Community of Madrid The population of the city is almost 3", "locktype": "null", "coordx": 142, "coordy": 284, "condition":[6], "cityid":2, "peopleid":[2], "itemsid":[6], "image":"BUILDING2.png"}, 
{"id":3, "name":"Stadium", "description":"2 million with a metropolitan area population of approximately 65 million", "locktype": "dark", "coordx": 93, "coordy": 225, "condition":[2], "cityid":2, "peopleid":[], "itemsid":[0], "image":"BUILDING3.png"}, 
{"id":6, "name":"Bar", "description":"6 million people, Berlin is the second most populous city proper and the seventh most populous urban area in the European Union Located in northeastern Germany on the banks of Rivers Spree and Havel, it is the centre of the Berlin-Brandenburg Metropolitan Region, which has about 6 million residents from more than 180 nations", "locktype": "null", "coordx": 223, "coordy": 140, "condition":[9,9,9], "cityid":3, "peopleid":[7], "itemsid":[], "image":"BUILDING6.png"}, 
{"id":14, "name":"House of Goebbels (famiglia)", "description":" Due to its location in the European Plain, Berlin is influenced by a temperate seasonal climate Around one-third of the city's area is composed of forests, parks, gardens, rivers and lakes", "locktype": "null", "coordx": 309, "coordy": 86, "condition":[25], "cityid":3, "peopleid":[20], "itemsid":[], "image":"BUILDING14.png"}, 
{"id":16, "name":"Stadium", "description":" First documented in the 13th century and situated at the crossing of two important historic trade routes, Berlin became the capital of the Margraviate of Brandenburg , the Kingdom of Prussia , the German Empire , the Weimar Republic  and the Third Reich  Berlin in the 1920s was the third largest municipality in the world", "locktype": "null", "coordx": 154, "coordy": 212, "condition":[26], "cityid":3, "peopleid":[], "itemsid":[2], "image":"BUILDING16.png"}, 
{"id":7, "name":"Police Station", "description":"Brandenburg  is one of the sixteen federated states of Germany It lies in the northeast of the country covering an area of 29,478 square kilometers and has 2", "locktype": "null", "coordx": 200, "coordy": 258, "condition":[11], "cityid":4, "peopleid":[8], "itemsid":[], "image":"BUILDING7.png"}, 
{"id":8, "name":"Stadium", "description":"Potsdam , is the capital and largest city of the German federal state of Brandenburg It directly borders the German capital Berlin and is part of the Berlin/Brandenburg Metropolitan Region", "locktype": "null", "coordx": 239, "coordy": 162, "condition":[12], "cityid":5, "peopleid":[9], "itemsid":[], "image":"BUILDING8.png"}, 
{"id":5, "name":"House of Otto Wallach", "description":"The Kingdom of Prussia  was a German kingdom that constituted the state of Prussia between 1701 and 1918 and included parts of present-day Germany, Poland, Russia, Lithuania, Denmark, Belgium and the Czech Republic It was the driving force behind the unification of Germany in 1871 and was the leading state of the German Empire until its dissolution in 1918", "locktype": "null", "coordx": 52, "coordy": 105, "condition":[13], "cityid":6, "peopleid":[5], "itemsid":[], "image":"BUILDING5.png"}, 
{"id":9, "name":"House of Thurgood Marshall", "description":"Baltimore  is the largest city in the US", "locktype": "null", "coordx": 299, "coordy": 152, "condition":[16], "cityid":7, "peopleid":[11], "itemsid":[], "image":"BUILDING9.png"}, 
{"id":10, "name":"House of Tom C. Clark", "description":", US , USA , and United States  The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions", "locktype": "null", "coordx": 250, "coordy": 117, "condition":[18,18], "cityid":8, "peopleid":[12,16], "itemsid":[], "image":"BUILDING10.png"}, 
{"id":11, "name":"House of the United States", "description":"The 48 contiguous states and federal district are in central North America between Canada and Mexico, with the state of Alaska in the northwestern part of North America and the state of Hawaii comprising an archipelago in the mid-Pacific The territories are scattered about the Pacific Ocean and the Caribbean Sea", "locktype": "null", "coordx": 165, "coordy": 116, "condition":[19,19], "cityid":8, "peopleid":[13,17], "itemsid":[], "image":"BUILDING11.png"}, 
{"id":12, "name":"House of Paco Axel Lagerstrom", "description":" At 38 million square miles  and with over 324 million people, the United States is the world's third-largest country by total area  and the third-most populous", "locktype": "chain", "coordx": 322, "coordy": 73, "condition":[20], "cityid":8, "peopleid":[14], "itemsid":[], "image":"BUILDING12.png"}, 
{"id":13, "name":"House of Joseph Goebbels", "description":"The German Empire  was the historical German nation state that existed from the unification of Germany in 1871 to the abdication of Kaiser Wilhelm II in November 1918, when Germany became a federal republic The German Empire consisted of 26 constituent territories, with most being ruled by royal families", "locktype": "null", "coordx": 77, "coordy": 128, "condition":[23], "cityid":11, "peopleid":[19], "itemsid":[], "image":"BUILDING13.png"}, 
{"id":15, "name":"House of Jacob Palis", "description":"Brazil , officially the Federative Republic of Brazil , is the largest country in both South America and Latin America As the world's fifth-largest country by both area and population, it is the largest country to have Portuguese as an official language–and the only one in the Americas", "locktype": "null", "coordx": 346, "coordy": 247, "condition":[27,27], "cityid":13, "peopleid":[21,23], "itemsid":[], "image":"BUILDING15.png"}, 
{"id":19, "name":"Museum", "description":"Hungary  is a parliamentary constitutional republic in Central Europe It is situated in the Carpathian Basin and is bordered by Slovakia to the north, Romania to the east, Serbia to the south, Croatia to the southwest, Slovenia to the west, Austria to the northwest, and Ukraine to the northeast", "locktype": "null", "coordx": 240, "coordy": 139, "condition":[32,33], "cityid":14, "peopleid":[27], "itemsid":[4], "image":"BUILDING19.png"}, 
{"id":17, "name":"House of Michael Sternberg", "description":"Germany , officially the Federal Republic of Germany , is a federal parliamentary republic in central-western Europe It includes 16 constituent states, covers an area of 357,021 square kilometres , and has a largely temperate seasonal climate", "locktype": "null", "coordx": 68, "coordy": 217, "condition":[34,34], "cityid":15, "peopleid":[25,28], "itemsid":[], "image":"BUILDING17.png"}],
"cities":[{"id":0, "name":"Switzerland", "description":" and Swiss Confederation . Switzerland , officially the Swiss Confederation is a federal republic in Europe. While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\" . The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2 . While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zürich and Geneva. The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. The country has a history of armed neutrality going back to the Reformation, it has not been in a state of war internationally since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. In addition to being the birthplace of the Red Cross, Switzerland is home to numerous international organisations, including the second largest UN office. On the European level, it is a founding member of the European Free Trade Association, but notably it is not part of the European Union, nor the European Economic Area. However, the country does participate in the Schengen Area and the EU's single market through a number of bilateral treaties. Spanning the intersection of Germanic and Romance Europe, Switzerland comprises four main linguistic and cultural regions: German, French, Italian and Romansh. Although the majority of the population are German speaking, Swiss national identity is rooted in a common historical background, shared values such as federalism and direct democracy, and Alpine symbolism. Due to its linguistic diversity, Switzerland is known by a variety of native names: Schweiz [??va?ts] ; Suisse [s?is] ; Svizzera [?zvittsera] ; and Svizra [??vi?tsr?] or [??vi?ts???] . On coins and stamps, Latin  is used instead of the four living languages. Switzerland is one of the most developed countries in the world, with the highest nominal wealth per adult and the eighth-highest per capita gross domestic product according to the IMF. Switzerland ranks at or near the top globally in several metrics of national performance, including government transparency, civil liberties, quality of life, economic competitiveness, and human development. Zürich and Geneva have each been ranked among the top cities in the world in terms of quality of life, with the former ranked second globally, according to Mercer.", "coordx": 210, "coordy": 124, "condition":[], "buildingid":[0,4,18], "image":"CITY0.png"}, 
{"id":1, "name":"Atomic bombings of Hiroshima and Nagasaki", "description":"The United States, with the consent of the United Kingdom as laid down in the Quebec Agreement, dropped nuclear weapons on the Japanese cities of Hiroshima and Nagasaki on August 6 and 9 1945, respectively, during the final stage of World War II. The two bombings, which killed at least 129,000 people, remain the only use of nuclear weapons for warfare in history. In the final year of the war, the Allies prepared for what was anticipated to be a very costly invasion of the Japanese mainland. This was preceded by a U.S. firebombing campaign that destroyed 67 Japanese cities. The war in Europe had concluded when Nazi Germany signed its instrument of surrender on May 8, 1945. The Japanese, facing the same fate, refused to accept the Allies' demands for unconditional surrender and the Pacific War continued. Together with the United Kingdom and China, the United States called for the unconditional surrender of the Japanese armed forces in the Potsdam Declaration on July 26, 1945—the alternative being \"prompt and utter destruction\". The Japanese response to this ultimatum was to ignore it. On July 16, 1945, the Allied Manhattan Project successfully detonated an atomic bomb in the New Mexico desert and by August had produced atomic weapons based on two alternate designs. The 509th Composite Group of the United States Army Air Forces  was equipped with the specialized Silverplate version of the Boeing B-29 Superfortress, that could deliver them from Tinian in the Mariana Islands. On August 6, the U.S. dropped a uranium gun-type atomic bomb  on Hiroshima. American President Harry S. Truman called for Japan's surrender 16 hours later, warning them to \"expect a rain of ruin from the air, the like of which has never been seen on this earth.\" Three days later, on August 9, the U.S. dropped a plutonium implosion-type bomb  on Nagasaki. Within the first two to four months of the bombings, the acute effects of the atomic bombings killed 90,000–146,000 people in Hiroshima and 39,000–80,000 in Nagasaki; roughly half of the deaths in each city occurred on the first day. During the following months, large numbers died from the effect of burns, radiation sickness, and other injuries, compounded by illness and malnutrition. In both cities, most of the dead were civilians, although Hiroshima had a sizable military garrison. On August 15, six days after the bombing of Nagasaki and the Soviet Union's declaration of war, Japan announced its surrender to the Allies. On September 2, it signed the instrument of surrender, effectively ending World War II. The bombings' role in Japan's surrender and their ethical justification are still debated.", "coordx": 388, "coordy": 147, "condition":[5], "buildingid":[1], "image":"CITY1.png"}, 
{"id":2, "name":"Madrid", "description":"Madrid  is the capital of Spain, and the largest municipality of the Community of Madrid. The population of the city is almost 3.2 million with a metropolitan area population of approximately 6.5 million. It is the third-largest city in the European Union, after London and Berlin, and its metropolitan area is the third-largest in the European Union after London and Paris. Located in south-western Europe, the city spans a total of 604.3 km2 . The city is located on the Manzanares in the centre of both the country and the Community of Madrid ; this community is bordered by the autonomous communities of Castile and León and Castile-La Mancha. As the capital city of Spain, seat of government, and residence of the Spanish monarch, Madrid is also the political, economic and cultural centre of Spain. The current mayor is Manuela Carmena from Ahora Madrid. The Madrid urban agglomeration has the third-largest GDP in the European Union and its influences in politics, education, entertainment, environment, media, fashion, science, culture, and the arts all contribute to its status as one of the world's major global cities. Madrid is home to two world-famous football clubs, Real Madrid and Atlético de Madrid. Due to its economic output, high standard of living, and market size, Madrid is considered the major financial centre of Southern Europe and the Iberian Peninsula; it hosts the head offices of the vast majority of major Spanish companies, such as Telefónica, Iberia, and Repsol. Madrid is the 17th most livable city in the world according to Monocle magazine, in its 2014 index. Madrid houses the headquarters of the World Tourism Organization , belonging to the United Nations Organization , the SEGIB, the Organization of Ibero-American States , and the Public Interest Oversight Board . It also hosts major international regulators of Spanish: the Standing Committee of the Association of Spanish Language Academies, headquarters of the Royal Spanish Academy , the Cervantes Institute and the Foundation of Urgent Spanish . Madrid organizes fairs such as FITUR, ARCO, SIMO TCI and the Cibeles Madrid Fashion Week. While Madrid possesses modern infrastructure, it has preserved the look and feel of many of its historic neighbourhoods and streets. Its landmarks include the Royal Palace of Madrid; the Royal Theatre with its restored 1850 Opera House; the Buen Retiro Park, founded in 1631; the 19th-century National Library building  containing some of Spain's historical archives; a large number of national museums, and the Golden Triangle of Art, located along the Paseo del Prado and comprising three art museums: Prado Museum, the Reina Sofía Museum, a museum of modern art, and the Thyssen-Bornemisza Museum, which completes the shortcomings of the other two museums. Cibeles Palace and Fountain have become one of the monument symbols of the city.", "coordx": 194, "coordy": 137, "condition":[6,2], "buildingid":[2,3], "image":"CITY2.png"}, 
{"id":3, "name":"Berlin", "description":"Berlin  is the capital and the largest city of Germany as well as one of its 16 states. With a population of approximately 3.6 million people, Berlin is the second most populous city proper and the seventh most populous urban area in the European Union. Located in northeastern Germany on the banks of Rivers Spree and Havel, it is the centre of the Berlin-Brandenburg Metropolitan Region, which has about 6 million residents from more than 180 nations. Due to its location in the European Plain, Berlin is influenced by a temperate seasonal climate. Around one-third of the city's area is composed of forests, parks, gardens, rivers and lakes. First documented in the 13th century and situated at the crossing of two important historic trade routes, Berlin became the capital of the Margraviate of Brandenburg , the Kingdom of Prussia , the German Empire , the Weimar Republic  and the Third Reich . Berlin in the 1920s was the third largest municipality in the world. After World War II, the city was divided; East Berlin became the capital of East Germany while West Berlin became a de facto West German exclave, surrounded by the Berlin Wall  and East Germany territory. Following German reunification in 1990, Berlin was once again designated as the capital of united Germany. Berlin is a world city of culture, politics, media and science. Its economy is based on high-tech firms and the service sector, encompassing a diverse range of creative industries, research facilities, media corporations and convention venues. Berlin serves as a continental hub for air and rail traffic and has a highly complex public transportation network. The metropolis is a popular tourist destination. Significant industries also include IT, pharmaceuticals, biomedical engineering, clean tech, biotechnology, construction and electronics. Modern Berlin is home to world renowned universities, orchestras, museums, entertainment venues and is host to many sporting events. Its urban setting has made it a sought-after location for international film productions. The city is well known for its festivals, diverse architecture, nightlife, contemporary arts and a high quality of living. Over the last decade Berlin has seen the emergence of a cosmopolitan entrepreneurial scene.", "coordx": 219, "coordy": 111, "condition":[9,9,9,9,9,9,25,26], "buildingid":[6,6,14,16], "image":"CITY3.png"}, 
{"id":4, "name":"Brandenburg", "description":"Brandenburg  is one of the sixteen federated states of Germany. It lies in the northeast of the country covering an area of 29,478 square kilometers and has 2.45 million inhabitants. The capital and largest city is Potsdam. Brandenburg surrounds but does not include the national capital and city-state Berlin forming a metropolitan area. Originating in the medieval Northern March, the Margraviate of Brandenburg grew to become the core of the Kingdom of Prussia, which would later become the Free State of Prussia with part being the province of Brandenburg. Brandenburg is one of the federal states that was re-created in 1990 upon the reunification of the former East Germany and West Germany.", "coordx": 218, "coordy": 112, "condition":[11], "buildingid":[7], "image":"CITY4.png"}, 
{"id":5, "name":"Potsdam", "description":"Potsdam , is the capital and largest city of the German federal state of Brandenburg. It directly borders the German capital Berlin and is part of the Berlin/Brandenburg Metropolitan Region. It is situated on the River Havel, 24 kilometres  southwest of Berlin's city center. Potsdam was a residence of the Prussian kings and the German Kaiser, until 1918. Its planning embodied ideas of The Age of Enlightenment: through a careful balance of architecture and landscape Potsdam was intended as \"a picturesque, pastoral dream\" which reminded its residents of their relationship with Nature and Reason. Around the city there are a series of interconnected lakes and cultural landmarks, in particular the parks and palaces of Sanssouci, the largest World Heritage Site in Germany. The Potsdam Conference, the major post-World War II conference between the victorious Allies, was held at another palace in the area, the Cecilienhof. Babelsberg, in the south-eastern part of Potsdam, was a major film production studio before the war and has enjoyed success as a major center of European film production since the fall of the Berlin Wall. The Filmstudio Babelsberg is the oldest large-scale film studio in the world. Potsdam developed into a centre of science in Germany in the 19th century. Today, there are three public colleges, the University of Potsdam and more than 30 research institutes in the city.", "coordx": 218, "coordy": 112, "condition":[12], "buildingid":[8], "image":"CITY5.png"}, 
{"id":6, "name":"Kingdom of Prussia", "description":"The Kingdom of Prussia  was a German kingdom that constituted the state of Prussia between 1701 and 1918 and included parts of present-day Germany, Poland, Russia, Lithuania, Denmark, Belgium and the Czech Republic. It was the driving force behind the unification of Germany in 1871 and was the leading state of the German Empire until its dissolution in 1918. Although it took its name from the region called Prussia, it was based in the Margraviate of Brandenburg, where its capital was Berlin. The kings of Prussia were from the House of Hohenzollern. Prussia was a great power from the time it became a kingdom, through its predecessor, Brandenburg-Prussia, which became a military power under Frederick William, known as \"The Great Elector\". Prussia continued its rise to power under the guidance of Frederick II, more commonly known as Frederick the Great, the third son of Frederick William I. Frederick the Great was instrumental in starting the Seven Years' War, holding his own against Austria, Russia, France and Sweden and establishing Prussia’s role in the German states, as well as establishing the country as a European great power. After the might of Prussia was revealed it became a major power among the German states. Throughout the next hundred years Prussia went on to win many battles. It was because of its power that Prussia continuously tried to unify all the German states under its rule. After the Napoleonic Wars the issue of unifying Germany into one country caused revolution throughout the German states, with each wanting their own constitution. Initial attempts to unite Germany were unsuccessful, until the time of the North German Confederation which lasted from 1867–1871. It was seen as more of an alliance of military strength in the aftermath of the Austro-Prussian War but many of its laws were later used in the German Empire. The German Empire lasted from 1871–1918 with the successful unification of all the German states under Prussian hegemony. This was due to the defeat of Napoleon III in the Franco-Prussian War of 1870–71. The war united all the German states against a common enemy, and with the victory came an overwhelming wave of patriotism which changed the opinions of some of those who had been against unification. In 1871, Germany unified into a single country, minus Austria and Switzerland, with Prussia the dominant power. Prussia is considered the legal predecessor of the unified German Reich  and as such a direct ancestor of today's Federal Republic of Germany. The formal abolition of Prussia, carried out on 25 February 1947 by the fiat of the Allied Control Council referred to an alleged tradition of the kingdom as a bearer of militarism and reaction, and made way for the current setup of the German states. However, the Free State of Prussia , which followed the abolition of the Kingdom of Prussia in the aftermath of World War I, was a major democratic force in Weimar Germany until the nationalist coup of 1932 known as the Preußenschlag. The Kingdom left a significant cultural legacy, today notably promoted by the Prussian Cultural Heritage Foundation , which has become one of the largest cultural organisations in the world.", "coordx": 219, "coordy": 111, "condition":[13], "buildingid":[5], "image":"CITY6.png"}, 
{"id":7, "name":"Baltimore, Maryland", "description":"Baltimore  is the largest city in the U.S. state of Maryland, and the 29th-most populous city in the country. It was established by the Constitution of Maryland and is not part of any county; thus, it is the largest independent city in the United States. Baltimore has more public monuments per capita than any other city in the country and is home to some of the earliest National Register historic districts in the nation, including Fell's Point , Federal Hill  and Mount Vernon Place . More than 65,000 properties, or roughly one in three buildings in the city, are listed on the National Register, more than any other city in the nation. Founded in 1729, Baltimore is the second largest seaport in the Mid-Atlantic. Baltimore's Inner Harbor was once the second leading port of entry for immigrants to the United States and a major manufacturing center. After a decline in major manufacturing, industrialization and rail transportation, Baltimore shifted to a service-oriented economy, with the Johns Hopkins Hospital , and Johns Hopkins University , now the city's top two employers. Baltimore had a population of 621,849 in 2015; in 2010, that of Baltimore Metropolitan Area was 2.7 million, the 21st largest in the country. With hundreds of identified districts, Baltimore has been dubbed \"a city of neighborhoods\". Famous residents have included the writers Edgar Allan Poe, Edith Hamilton, Frederick Douglass, and H.L. Mencken; jazz musician James \"Eubie\" Blake; singer Billie Holiday; actor and filmmaker John Waters; and baseball player Babe Ruth. In the War of 1812, Francis Scott Key wrote The Star-Spangled Banner, later the American national anthem, in the city.", "coordx": 91, "coordy": 139, "condition":[16], "buildingid":[9], "image":"CITY7.png"}, 
{"id":8, "name":"the United States", "description":", US , USA , and United States . The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.The 48 contiguous states and federal district are in central North America between Canada and Mexico, with the state of Alaska in the northwestern part of North America and the state of Hawaii comprising an archipelago in the mid-Pacific. The territories are scattered about the Pacific Ocean and the Caribbean Sea. At 3.8 million square miles  and with over 324 million people, the United States is the world's third-largest country by total area  and the third-most populous. It is one of the world's most ethnically diverse and multicultural nations, the product of large-scale immigration from many other countries. The country's capital is Washington, D.C. and its largest city is New York City; other major metropolitan areas include Los Angeles, Chicago, Dallas, San Francisco, Boston, Philadelphia, Houston, Atlanta, and Miami. The geography, climate and wildlife of the country are extremely diverse. Paleo-Indians migrated from Asia to the North American mainland at least 15,000 years ago, with European colonization beginning in the 16th century. The United States emerged from 13 British colonies along the East Coast. Numerous disputes between Great Britain and the colonies in the aftermath of the Seven Years War led to the American Revolution, which began in 1775. On July 4, 1776, as the colonies were fighting Great Britain in the American Revolutionary War, delegates from the 13 colonies unanimously adopted the Declaration of Independence. The war ended in 1783 with recognition of the independence of the United States by Great Britain, and was the first successful war of independence against a European colonial empire. The current constitution was adopted in 1788, after the Articles of Confederation, adopted in 1781, were felt to have provided inadequate federal powers. The first ten amendments, collectively named the Bill of Rights, were ratified in 1791 and designed to guarantee many fundamental civil liberties. The United States embarked on a vigorous expansion across North America throughout the 19th century, displacing American Indian tribes, acquiring new territories, and gradually admitting new states until it spanned the continent by 1848. During the second half of the 19th century, the American Civil War led to the end of legal slavery in the country. By the end of that century, the United States extended into the Pacific Ocean, and its economy, driven in large part by the Industrial Revolution, began to soar. The Spanish–American War and World War I confirmed the country's status as a global military power. The United States emerged from World War II as a global superpower, the first country to develop nuclear weapons, the only country to use them in warfare, and a permanent member of the United Nations Security Council. The end of the Cold War and the dissolution of the Soviet Union in 1991 left the United States as the world's sole superpower. The United States is a highly developed country, with the world's largest economy by nominal GDP. It ranks highly in several measures of socioeconomic performance, including average wage, human development, per capita GDP, and productivity per person. While the U.S. economy is considered post-industrial, characterized by the dominance of services, the manufacturing sector remains the second-largest in the world. Though its population is only 4.4% of the world total, the United States accounts for nearly a quarter of world GDP and almost a third of global military spending, making it the world's foremost military and economic power. The United States is a prominent political and cultural force internationally, and a leader in scientific research and technological innovations.", "coordx": 90, "coordy": 139, "condition":[18,18,19,19,20], "buildingid":[10,11,12], "image":"CITY8.png"}, 
{"id":11, "name":"German Empire", "description":"The German Empire  was the historical German nation state that existed from the unification of Germany in 1871 to the abdication of Kaiser Wilhelm II in November 1918, when Germany became a federal republic. The German Empire consisted of 26 constituent territories, with most being ruled by royal families. This included four kingdoms, six grand duchies, five duchies , seven principalities, three free Hanseatic cities, and one imperial territory. Although the Kingdom of Prussia contained most of the Empire's population and territory, it played a lesser role. As Dwyer  points out, Prussia's \"political and cultural influence had diminished considerably\" by the 1890s. After 1850, the states of Germany had rapidly become industrialized, with particular strengths in coal, iron , chemicals, and railways. In 1871 it had a population of 41 million people, and by 1913 this had increased to 68 million. A heavily rural collection of states in 1815, the united Germany became predominantly urban. During its 47 years of existence, the German Empire operated as an industrial, technological, and scientific giant, gaining more Nobel Prizes in science than any other country. Germany became a great power, boasting a rapidly growing rail network, the world's strongest army, and a fast-growing industrial base. In less than a decade, its navy became second only to Britain's Royal Navy. When the great crisis of 1914 arrived, the German Empire had only one ally – Austria-Hungary. They were later joined by the Ottoman Empire and Bulgaria to form the Central Powers or Quadruple Alliance. In the First World War, German plans to capture Paris quickly in autumn 1914 failed, and the war on the Western Front became a stalemate. The Allied naval blockade caused severe shortages of food. Germany was repeatedly forced to send troops to bolster Austria and Turkey on other fronts. However, Germany had great success on the Eastern Front; it occupied large Eastern territories following the Treaty of Brest-Litovsk. German declaration of unrestricted submarine warfare in early 1917 was designed to strangle the British; it failed, because of the use of a trans-Atlantic convoy system. But the declaration—along with the Zimmermann Telegram—did bring the United States into the war. Meanwhile, German civilians and soldiers had become war-weary and radicalised by the Russian Revolution. The high command under Paul von Hindenburg and Erich Ludendorff increasingly controlled the country, as they gambled on one last offensive in spring 1918 before the Americans could arrive in force, using large numbers of troops, aeroplanes and artillery withdrawn from the Eastern Front. This failed, and by October the armies were in retreat, the Austro-Hungarian Empire and the Ottoman Empire had collapsed, and the German people had lost faith in their political system. The Empire collapsed in the November 1918 Revolution as the Emperor and all the ruling monarchs abdicated, and a republic took over.", "coordx": 219, "coordy": 111, "condition":[23], "buildingid":[13], "image":"CITY11.png"}, 
{"id":13, "name":"Brazil", "description":"Brazil , officially the Federative Republic of Brazil , is the largest country in both South America and Latin America. As the world's fifth-largest country by both area and population, it is the largest country to have Portuguese as an official language–and the only one in the Americas. Bounded by the Atlantic Ocean on the east, Brazil has a coastline of 7,491 km . It borders all other South American countries except Ecuador and Chile and covers 47.3% of the continent's land area. Its Amazon River basin includes a vast tropical forest, home to diverse wildlife, a variety of ecological systems, and extensive natural resources spanning numerous protected habitats. This unique environmental heritage makes Brazil one of 17 megadiverse countries, and is the subject of significant global interest and debate regarding deforestation and environmental protection. Brazil was inhabited by numerous tribal nations prior to the landing in 1500 of explorer Pedro Álvares Cabral, who claimed the area for the Portuguese Empire. Brazil remained a Portuguese colony until 1808, when the capital of the empire was transferred from Lisbon to Rio de Janeiro. In 1815, the colony was elevated to the rank of kingdom upon the formation of the United Kingdom of Portugal, Brazil and the Algarves. Independence was achieved in 1822 with the creation of the Empire of Brazil, a unitary state governed under a constitutional monarchy and a parliamentary system. The ratification of the first constitution in 1824 led to the formation of a bicameral legislature, now called the National Congress. The country became a presidential republic in 1889 following a military coup d'état. An authoritarian military junta came to power in 1964 and ruled until 1985, after which civilian governance resumed. Brazil's current constitution, formulated in 1988, defines it as a democratic federal republic. The federation is composed of the union of the Federal District, the 26 states, and the 5,570 municipalities. Brazil's economy is the world's ninth-largest by nominal GDP and seventh-largest by GDP  as of 2015. A member of the BRICS group, Brazil until 2010 had one of the world's fastest growing major economies, with its economic reforms giving the country new international recognition and influence. Brazil's national development bank plays an important role for the country's economic growth. Brazil is a founding member of the United Nations, the G20, BRICS, Unasul, Mercosul, Organization of American States, Organization of Ibero-American States, CPLP, and the Latin Union. Brazil is a regional power in Latin America and a middle power in international affairs, with some analysts identifying it as an emerging global power. One of the world's major breadbaskets, Brazil has been the largest producer of coffee for the last 150 years.", "coordx": 131, "coordy": 222, "condition":[27,27], "buildingid":[15], "image":"CITY13.png"}, 
{"id":14, "name":"Hungary", "description":"Hungary  is a parliamentary constitutional republic in Central Europe. It is situated in the Carpathian Basin and is bordered by Slovakia to the north, Romania to the east, Serbia to the south, Croatia to the southwest, Slovenia to the west, Austria to the northwest, and Ukraine to the northeast. The country's capital and largest city is Budapest. Hungary is a member of the European Union, NATO, the OECD, the Visegrád Group, and the Schengen Area. The official language is Hungarian, which is the most widely spoken non-Indo-European language in Europe. Following centuries of successive habitation by Celts, Romans, Huns, Slavs, Gepids and Avars, the foundation of Hungary was laid in the late 9th century by the Hungarian grand prince Árpád in the Honfoglalás . His great-grandson Stephen I ascended to the throne in 1000 CE, converting the country to a Christian kingdom. By the 12th century, Hungary became a middle power within the Western world, reaching a golden age by the 15th century. Following the Battle of Mohács in 1526 and about 150 years of partial Ottoman occupation , Hungary came under Habsburg rule, and later formed a significant part of the Austro–Hungarian Empire . Hungary's current borders were first established by the Treaty of Trianon  after World War I, when the country lost 71% of its territory, 58% of its population, and 32% of ethnic Hungarians. Following the interwar period, Hungary joined the Axis Powers in World War II, suffering significant damage and casualties. Hungary became a satellite state of the Soviet Union, which contributed to the establishment of a four-decade-long communist dictatorship . The country gained widespread international attention regarding the Revolution of 1956 and the seminal opening of its previously-restricted border with Austria in 1989, which accelerated the collapse of the Eastern Bloc. On 23 October 1989, Hungary again became a democratic parliamentary republic, and today has a high-income economy with a very high Human Development Index. Hungary is a popular tourist destination attracting 10.675 million tourists a year . It is home to the largest thermal water cave system, the second-largest thermal lake in the world , the largest lake in Central Europe , and the largest natural grasslands in Europe .", "coordx": 227, "coordy": 123, "condition":[32,33], "buildingid":[19], "image":"CITY14.png"}, 
{"id":15, "name":"Germany", "description":"Germany , officially the Federal Republic of Germany , is a federal parliamentary republic in central-western Europe. It includes 16 constituent states, covers an area of 357,021 square kilometres , and has a largely temperate seasonal climate. With about 82 million inhabitants, Germany is the most populous member state of the European Union. After the United States, it is the second most popular immigration destination in the world. Germany's capital and largest metropolis is Berlin. Major urban areas include Ruhr, Hamburg, Munich, Cologne, Frankfurt and Stuttgart. Various Germanic tribes have occupied the northern parts of modern Germany since classical antiquity. A region named Germania was documented before 100 AD. During the Migration Period the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. In 1871, Germany became a nation state when most of the German states unified into the Prussian-dominated German Empire. After World War I and the German Revolution of 1918–1919, the Empire was replaced by the parliamentary Weimar Republic. The establishment of the national socialist dictatorship in 1933 led to World War II and a genocide. After a period of Allied occupation, two German states were founded: the Federal Republic of Germany and the German Democratic Republic. In 1990, the country was reunified. In the 21st century, Germany is a great power and has the world's fourth-largest economy by nominal GDP, as well as the fifth-largest by PPP. As a global leader in several industrial and technological sectors, it is both the world's third-largest exporter and importer of goods. Germany is a developed country with a very high standard of living sustained by a skilled and productive society. It upholds a social security and universal health care system, environmental protection and a tuition-free university education. Germany was a founding member of the European Union in 1993. It is part of the Schengen Area, and became a co-founder of the Eurozone in 1999. Germany is a member of the United Nations, NATO, the G8, the G20, and the OECD. The national military expenditure is the 9th highest in the world. Known for its rich cultural history, Germany has been continuously the home of influential artists, philosophers, musicians, sportspeople and entrepreneurs. It is a global leader in science and technology.", "coordx": 219, "coordy": 111, "condition":[34,34], "buildingid":[17], "image":"CITY15.png"}],
"dialoguenodes":[{"id":108, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [109], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":109, "dialogueline":"Stop bothering me!", "eventid":"-1", "dialoguetype": 0, "children": [108], "condition":[], "option":"I'm looking for Michael Sternberg?...", "isroot": false}, 
{"id":110, "dialogueline":"I want my lawyer", "eventid":"-1", "dialoguetype": 0, "children": [111,123,137,141,143,150], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":150, "dialogueline":"Otto Wallach is know for field. organic chemistry", "eventid":"73", "dialoguetype": 0, "children": [110], "condition":[-1], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
{"id":143, "dialogueline":"I am know for subject. members of the french academy of sciences", "eventid":"66", "dialoguetype": 0, "children": [], "condition":[65], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
{"id":141, "dialogueline":"What, almamater? I don't know anything about that.", "eventid":"64", "dialoguetype": 0, "children": [], "condition":[63], "option":"Is there someone you suspect?", "isroot": false}, 
{"id":137, "dialogueline":"I am know for field. mathematics", "eventid":"60", "dialoguetype": 0, "children": [], "condition":[59], "option":"Is there someone you suspect?", "isroot": false}, 
{"id":123, "dialogueline":"I am know for doctoraladvisor. unknown", "eventid":"46", "dialoguetype": 0, "children": [], "condition":[45], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
{"id":111, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [110], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":103, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [104], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":104, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [105], "condition":[], "option":"<Ask about List of Ambassadors to Moldova>", "isroot": false}, 
{"id":105, "dialogueline":"No, but I think I saw something in Museum", "eventid":"-1", "dialoguetype": 0, "children": [106], "condition":[], "option":"Has Michael Sternberg been here?", "isroot": false}, 
{"id":106, "dialogueline":"Well, Hungary of course", "eventid":"33", "dialoguetype": 0, "children": [103], "condition":[], "option":"Where is Museum?", "isroot": false}, 
{"id":92, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [93], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":93, "dialogueline":"Stop bothering me!", "eventid":"-1", "dialoguetype": 0, "children": [92], "condition":[], "option":"I'm looking for Jacob Palis?...", "isroot": false}, 
{"id":94, "dialogueline":"I don't have to speak to you", "eventid":"-1", "dialoguetype": 0, "children": [95,119,133,139,144,145], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":145, "dialogueline":"I am know for field. mathematics", "eventid":"68", "dialoguetype": 0, "children": [], "condition":[67], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
{"id":144, "dialogueline":"Jacob Palis is know for field. mathematics", "eventid":"67", "dialoguetype": 0, "children": [94], "condition":[-1], "option":"Have you seen someone suspicious?", "isroot": false}, 
{"id":139, "dialogueline":"What, doctoraladvisor? I don't know anything about that.", "eventid":"62", "dialoguetype": 0, "children": [], "condition":[61], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
{"id":133, "dialogueline":"I am know for subject. members of the french academy of sciences", "eventid":"56", "dialoguetype": 0, "children": [], "condition":[55], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
{"id":119, "dialogueline":"What, almamater? I don't know anything about that.", "eventid":"42", "dialoguetype": 0, "children": [], "condition":[41], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
{"id":95, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [94], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":72, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [81,84,85,134], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":134, "dialogueline":"Francisco J. Ayala is know for subject. members of the united states national academy of sciences", "eventid":"57", "dialoguetype": 0, "children": [136], "condition":[-1], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
{"id":136, "dialogueline":"Michael Sternberg is know for field. systems biology", "eventid":"59", "dialoguetype": 0, "children": [72], "condition":[57], "option":"Have you seen someone suspicious?", "isroot": false}, 
{"id":85, "dialogueline":"What is this, an interrogation?!", "eventid":"-1", "dialoguetype": 2, "children": [72], "condition":[], "option":"Do you live anywhere associated with this?", "isroot": false}, 
{"id":84, "dialogueline":"Why do you want to know? Show me your badge!", "eventid":"-1", "dialoguetype": 3, "children": [72], "condition":[], "option":"What are you most known for?", "isroot": false}, 
{"id":81, "dialogueline":"May I help?", "eventid":"-1", "dialoguetype": 0, "children": [82], "condition":[], "option":"<Ask about Goebbels (famiglia)>", "isroot": false}, 
{"id":82, "dialogueline":"Goebbels (famiglia) might know him.", "eventid":"-1", "dialoguetype": 0, "children": [83], "condition":[], "option":"Where is Jacob Palis?", "isroot": false}, 
{"id":83, "dialogueline":"Go to Berlin", "eventid":"25", "dialoguetype": 0, "children": [72], "condition":[], "option":"Where is this person?", "isroot": false}, 
{"id":69, "dialogueline":"You can't prove anything!", "eventid":"-1", "dialoguetype": 0, "children": [70,117,127,131,149], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":149, "dialogueline":"I am know for field. asymptotic expansion", "eventid":"72", "dialoguetype": 0, "children": [], "condition":[71], "option":"Have you seen someone suspicious?", "isroot": false}, 
{"id":131, "dialogueline":"I am know for subject. swedish mathematicians", "eventid":"54", "dialoguetype": 0, "children": [], "condition":[53], "option":"Have you seen someone suspicious?", "isroot": false}, 
{"id":127, "dialogueline":"What, doctoraladvisor? I don't know anything about that.", "eventid":"50", "dialoguetype": 0, "children": [], "condition":[49], "option":"Is there someone you suspect?", "isroot": false}, 
{"id":117, "dialogueline":"What, almamater? I don't know anything about that.", "eventid":"40", "dialoguetype": 0, "children": [], "condition":[39], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
{"id":70, "dialogueline":"Fine.", "eventid":"-1", "dialoguetype": 0, "children": [69], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":62, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [63], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":63, "dialogueline":"Don't know. Leave me alone.", "eventid":"-1", "dialoguetype": 0, "children": [62], "condition":[], "option":"I'm looking for Paco Axel Lagerstrom?...", "isroot": false}, 
{"id":38, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [64,67,68], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":68, "dialogueline":"That is none of your business.", "eventid":"-1", "dialoguetype": 2, "children": [38], "condition":[], "option":"Where is your current residence? It might be important to the case.", "isroot": false}, 
{"id":67, "dialogueline":"What is this, an interrogation?!", "eventid":"-1", "dialoguetype": 2, "children": [38], "condition":[], "option":"Where do you live? It might provide clues.", "isroot": false}, 
{"id":64, "dialogueline":"Hi", "eventid":"-1", "dialoguetype": 0, "children": [65], "condition":[], "option":"<Ask about Paco Axel Lagerstrom>", "isroot": false}, 
{"id":65, "dialogueline":"Did you try asking Paco Axel Lagerstrom?", "eventid":"-1", "dialoguetype": 0, "children": [66], "condition":[], "option":"Has Paco Axel Lagerstrom been here?", "isroot": false}, 
{"id":66, "dialogueline":"Try the United States", "eventid":"20", "dialoguetype": 0, "children": [38], "condition":[], "option":"Where is Paco Axel Lagerstrom?", "isroot": false}, 
{"id":53, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 0, "children": [54], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":54, "dialogueline":"Go away", "eventid":"-1", "dialoguetype": 0, "children": [53], "condition":[], "option":"I'm looking for Paco Axel Lagerstrom?...", "isroot": false}, 
{"id":37, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [55,58,60,130], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":130, "dialogueline":"Paco Axel Lagerstrom is know for subject. swedish mathematicians", "eventid":"53", "dialoguetype": 0, "children": [37], "condition":[-1], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
{"id":60, "dialogueline":"I'm not going to answer that!", "eventid":"-1", "dialoguetype": 3, "children": [37], "condition":[], "option":"You seem familiar, remind me why?", "isroot": false}, 
{"id":58, "dialogueline":"I don't have to answer that.", "eventid":"-1", "dialoguetype": 1, "children": [59], "condition":[], "option":"What city were you born in?", "isroot": false}, 
{"id":59, "dialogueline":"Stop questioning me!", "eventid":"-1", "dialoguetype": 1, "children": [37], "condition":[], "option":"What year were you born in?", "isroot": false}, 
{"id":55, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [56], "condition":[], "option":"<Ask about the United States>", "isroot": false}, 
{"id":56, "dialogueline":"I've seen Paco Axel Lagerstrom with the United States", "eventid":"-1", "dialoguetype": 0, "children": [57], "condition":[], "option":"Did you see Paco Axel Lagerstrom?", "isroot": false}, 
{"id":57, "dialogueline":"In the United States", "eventid":"19", "dialoguetype": 0, "children": [37], "condition":[], "option":"Where should I go?", "isroot": false}, 
{"id":36, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [46,49,50,128], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":128, "dialogueline":"Otto Wallach has for almamater", "eventid":"51", "dialoguetype": 0, "children": [36], "condition":[-1], "option":"Is there someone you suspect?", "isroot": false}, 
{"id":50, "dialogueline":"Why does it matter where I was born..?", "eventid":"-1", "dialoguetype": 1, "children": [51], "condition":[], "option":"Where were you born?", "isroot": false}, 
{"id":51, "dialogueline":"I don't have to answer that.", "eventid":"-1", "dialoguetype": 1, "children": [36], "condition":[], "option":"When were you born?", "isroot": false}, 
{"id":49, "dialogueline":"Why do you want to know? Show me your badge!", "eventid":"-1", "dialoguetype": 3, "children": [36], "condition":[], "option":"What are you most known for?", "isroot": false}, 
{"id":46, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [47], "condition":[], "option":"<Ask about Tom C. Clark>", "isroot": false}, 
{"id":47, "dialogueline":"Go talk to Tom C. Clark", "eventid":"-1", "dialoguetype": 0, "children": [48], "condition":[], "option":"I'm looking for a person. Paco Axel Lagerstrom. Know him?", "isroot": false}, 
{"id":48, "dialogueline":"Somewhere in the United States", "eventid":"18", "dialoguetype": 0, "children": [36], "condition":[], "option":"Where is Tom C. Clark?", "isroot": false}, 
{"id":33, "dialogueline":"You can't prove anything!", "eventid":"-1", "dialoguetype": 0, "children": [34,121,125,126,129,151], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":151, "dialogueline":"I am know for field. organic chemistry", "eventid":"74", "dialoguetype": 0, "children": [], "condition":[73], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
{"id":129, "dialogueline":"What, almamater? I don't know anything about that.", "eventid":"52", "dialoguetype": 0, "children": [], "condition":[51], "option":"Is there someone you suspect?", "isroot": false}, 
{"id":126, "dialogueline":"Paco Axel Lagerstrom has for doctoraladvisor", "eventid":"49", "dialoguetype": 0, "children": [33], "condition":[-1], "option":"Is there someone you suspect?", "isroot": false}, 
{"id":125, "dialogueline":"I am know for subject. category:german jews", "eventid":"48", "dialoguetype": 0, "children": [], "condition":[47], "option":"Have you seen someone suspicious?", "isroot": false}, 
{"id":121, "dialogueline":"What, doctoraladvisor? I don't know anything about that.", "eventid":"44", "dialoguetype": 0, "children": [], "condition":[43], "option":"Have you seen someone suspicious?", "isroot": false}, 
{"id":34, "dialogueline":"Fine.", "eventid":"-1", "dialoguetype": 0, "children": [33], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":26, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [30], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":30, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [31], "condition":[], "option":"<Ask about Otto Wallach>", "isroot": false}, 
{"id":31, "dialogueline":"Try asking Otto Wallach", "eventid":"-1", "dialoguetype": 0, "children": [32], "condition":[], "option":"I'm looking for Otto Wallach.", "isroot": false}, 
{"id":32, "dialogueline":"Kingdom of Prussia.", "eventid":"13", "dialoguetype": 0, "children": [26], "condition":[], "option":"Where should I go?", "isroot": false}, 
{"id":22, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [27], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":27, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [28], "condition":[], "option":"<Ask about Potsdam>", "isroot": false}, 
{"id":28, "dialogueline":"The name is familiar. Try searching in Stadium", "eventid":"-1", "dialoguetype": 0, "children": [29], "condition":[], "option":"Do you know Otto Wallach?", "isroot": false}, 
{"id":29, "dialogueline":"Well, Potsdam of course", "eventid":"12", "dialoguetype": 0, "children": [22], "condition":[], "option":"Where is Stadium?", "isroot": false}, 
{"id":73, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [86,89,138], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":138, "dialogueline":"Jacob Palis has for doctoraladvisor", "eventid":"61", "dialoguetype": 0, "children": [140], "condition":[-1], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
{"id":140, "dialogueline":"Michael Sternberg has for almamater", "eventid":"63", "dialoguetype": 0, "children": [142], "condition":[61], "option":"Is there someone you suspect?", "isroot": false}, 
{"id":142, "dialogueline":"Michael Sternberg is know for subject. category:living people", "eventid":"65", "dialoguetype": 0, "children": [73], "condition":[63], "option":"Have you seen someone suspicious?", "isroot": false}, 
{"id":89, "dialogueline":"Why does it matter where I was born..?", "eventid":"-1", "dialoguetype": 1, "children": [90], "condition":[], "option":"What city were you born in?", "isroot": false}, 
{"id":90, "dialogueline":"I don't have to answer that.", "eventid":"-1", "dialoguetype": 1, "children": [73], "condition":[], "option":"When were you born?", "isroot": false}, 
{"id":86, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [87], "condition":[], "option":"<Ask about 1940 births>", "isroot": false}, 
{"id":87, "dialogueline":"No, but I think I saw something in Stadium", "eventid":"-1", "dialoguetype": 0, "children": [88], "condition":[], "option":"Has Jacob Palis been here?", "isroot": false}, 
{"id":88, "dialogueline":"In Berlin", "eventid":"26", "dialoguetype": 0, "children": [73], "condition":[], "option":"Where is Stadium?", "isroot": false}, 
{"id":17, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [23], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":23, "dialogueline":"May I help?", "eventid":"-1", "dialoguetype": 0, "children": [24], "condition":[], "option":"<Ask about Brandenburg>", "isroot": false}, 
{"id":24, "dialogueline":"The name is familiar. Try searching in Police Station", "eventid":"-1", "dialoguetype": 0, "children": [25], "condition":[], "option":"Has Otto Wallach been here?", "isroot": false}, 
{"id":25, "dialogueline":"Somewhere in Brandenburg", "eventid":"11", "dialoguetype": 0, "children": [17], "condition":[], "option":"Which is where?", "isroot": false}, 
{"id":12, "dialogueline":"I want my lawyer", "eventid":"-1", "dialoguetype": 0, "children": [13,113,115,120,135,147], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":147, "dialogueline":"What, doctoraladvisor? I don't know anything about that.", "eventid":"70", "dialoguetype": 0, "children": [], "condition":[69], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
{"id":135, "dialogueline":"I am know for subject. members of the united states national academy of sciences", "eventid":"58", "dialoguetype": 0, "children": [], "condition":[57], "option":"Have you seen someone suspicious?", "isroot": false}, 
{"id":120, "dialogueline":"Otto Wallach has for doctoraladvisor", "eventid":"43", "dialoguetype": 0, "children": [122], "condition":[-1], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
{"id":122, "dialogueline":"Michael Sternberg has for doctoraladvisor", "eventid":"45", "dialoguetype": 0, "children": [12], "condition":[43], "option":"Have you seen someone suspicious?", "isroot": false}, 
{"id":115, "dialogueline":"I am know for field. biology", "eventid":"38", "dialoguetype": 0, "children": [], "condition":[37], "option":"Have you seen someone suspicious?", "isroot": false}, 
{"id":113, "dialogueline":"What, almamater? I don't know anything about that.", "eventid":"36", "dialoguetype": 0, "children": [], "condition":[35], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
{"id":13, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [12], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":1, "dialogueline":"Hello", "eventid":"-1", "dialoguetype": 0, "children": [8,11,114], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":114, "dialogueline":"Francisco J. Ayala is know for field. biology", "eventid":"37", "dialoguetype": 0, "children": [116], "condition":[-1], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
{"id":116, "dialogueline":"Paco Axel Lagerstrom has for almamater", "eventid":"39", "dialoguetype": 0, "children": [118], "condition":[37], "option":"Was the victim meeting with someone you suspect?", "isroot": false}, 
{"id":118, "dialogueline":"Jacob Palis has for almamater", "eventid":"41", "dialoguetype": 0, "children": [1], "condition":[39], "option":"Do you have any information that would help in the investigation?", "isroot": false}, 
{"id":11, "dialogueline":"That is none of your business.", "eventid":"-1", "dialoguetype": 2, "children": [1], "condition":[], "option":"Where is your current residence? It might be important to the case.", "isroot": false}, 
{"id":8, "dialogueline":"Hi", "eventid":"-1", "dialoguetype": 0, "children": [9], "condition":[], "option":"<Ask about Francisco J. Ayala>", "isroot": false}, 
{"id":9, "dialogueline":"No, but Francisco J. Ayala might know him.", "eventid":"-1", "dialoguetype": 0, "children": [10], "condition":[], "option":"Can you point me towards Francisco J. Ayala?", "isroot": false}, 
{"id":10, "dialogueline":"Somewhere in Madrid", "eventid":"6", "dialoguetype": 0, "children": [1], "condition":[], "option":"Where can I find Francisco J. Ayala?", "isroot": false}, 
{"id":98, "dialogueline":"Hello.", "eventid":"-1", "dialoguetype": 0, "children": [99], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":99, "dialogueline":"Ok, but please be quick.", "eventid":"28", "dialoguetype": 0, "children": [100], "condition":[], "option":"Please, would you help answer some questions?", "isroot": false}, 
{"id":100, "dialogueline":"You can call me Alphonse.", "eventid":"29", "dialoguetype": 0, "children": [101], "condition":[], "option":"Please state your name.", "isroot": false}, 
{"id":101, "dialogueline":"Switzerland. he used to go there.", "eventid":"30", "dialoguetype": 0, "children": [102], "condition":[], "option":"Is there anything that comes to your mind?", "isroot": false}, 
{"id":102, "dialogueline":"I think Michael Sternberg", "eventid":"31", "dialoguetype": 0, "children": [98], "condition":[], "option":"Do you have any hints?", "isroot": false}, 
{"id":75, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [76,146], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":146, "dialogueline":"Francisco J. Ayala has for doctoraladvisor", "eventid":"69", "dialoguetype": 0, "children": [148], "condition":[-1], "option":"Have you seen someone suspicious?", "isroot": false}, 
{"id":148, "dialogueline":"Paco Axel Lagerstrom is know for field. asymptotic expansion", "eventid":"71", "dialoguetype": 0, "children": [75], "condition":[69], "option":"Is there someone you suspect?", "isroot": false}, 
{"id":76, "dialogueline":"Maybe...", "eventid":"21", "dialoguetype": 0, "children": [77], "condition":[], "option":"Please, would you help answer some questions?", "isroot": false}, 
{"id":77, "dialogueline":"Sure. My name is William Thomson, Baron Kelvin.", "eventid":"22", "dialoguetype": 0, "children": [78], "condition":[], "option":"Please state your name.", "isroot": false}, 
{"id":78, "dialogueline":"I think he went to Joseph Goebbels", "eventid":"23", "dialoguetype": 0, "children": [79,80], "condition":[], "option":"Do you know anything that would help with the investigation?", "isroot": false}, 
{"id":80, "dialogueline":"I think Jacob Palis could have done it", "eventid":"24", "dialoguetype": 0, "children": [75], "condition":[], "option":"Do you have any hints?", "isroot": false}, 
{"id":79, "dialogueline":"Joseph Goebbels used to visit German Empire", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"Do you know where Joseph Goebbels is?", "isroot": false}, 
{"id":40, "dialogueline":"Please, leave me alone.", "eventid":"-1", "dialoguetype": 0, "children": [41,132], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":132, "dialogueline":"Jacob Palis is know for subject. members of the french academy of sciences", "eventid":"55", "dialoguetype": 0, "children": [40], "condition":[-1], "option":"Have you seen someone suspicious?", "isroot": false}, 
{"id":41, "dialogueline":"Maybe...", "eventid":"14", "dialoguetype": 0, "children": [42], "condition":[], "option":"I'm sorry to disturb, but I have some questions for you.", "isroot": false}, 
{"id":42, "dialogueline":"I guess... My name is Thomas Young.", "eventid":"15", "dialoguetype": 0, "children": [43], "condition":[], "option":"Tell me your name, please", "isroot": false}, 
{"id":43, "dialogueline":"I think he often spoke of Thurgood Marshall", "eventid":"16", "dialoguetype": 0, "children": [44,45], "condition":[], "option":"Did the victim mention something to you?", "isroot": false}, 
{"id":45, "dialogueline":"I think Paco Lagerstrom", "eventid":"17", "dialoguetype": 0, "children": [40], "condition":[], "option":"Do you have any hints?", "isroot": false}, 
{"id":44, "dialogueline":"Baltimore, Maryland. Thurgood Marshall liked there.", "eventid":"-1", "dialoguetype": 0, "children": [], "condition":[], "option":"Have you seen Thurgood Marshall?", "isroot": false}, 
{"id":16, "dialogueline":"...", "eventid":"-1", "dialoguetype": 0, "children": [18], "condition":[], "option":"I have some more questions.", "isroot": true}, 
{"id":18, "dialogueline":"Maybe...", "eventid":"7", "dialoguetype": 0, "children": [19], "condition":[], "option":"Could you answer some questions for me?", "isroot": false}, 
{"id":19, "dialogueline":"I'm Arthur Kaufmann.", "eventid":"8", "dialoguetype": 0, "children": [20], "condition":[], "option":"Tell me your name, please", "isroot": false}, 
{"id":20, "dialogueline":"Berlin. he liked there.", "eventid":"9", "dialoguetype": 0, "children": [21], "condition":[], "option":"Is there anything that comes to your mind?", "isroot": false}, 
{"id":21, "dialogueline":"Otto Wallach ", "eventid":"10", "dialoguetype": 0, "children": [16], "condition":[], "option":"Do you have any hints?", "isroot": false}, 
{"id":3, "dialogueline":"...", "eventid":"-1", "dialoguetype": 0, "children": [4,124], "condition":[], "option":"Wait, I have more questions.", "isroot": true}, 
{"id":124, "dialogueline":"Otto Wallach is know for subject. category:german jews", "eventid":"47", "dialoguetype": 0, "children": [3], "condition":[-1], "option":"Have you seen someone suspicious?", "isroot": false}, 
{"id":4, "dialogueline":"Yes, anything to help", "eventid":"0", "dialoguetype": 0, "children": [5], "condition":[], "option":"I'm sorry, but would you answer some questions?", "isroot": false}, 
{"id":5, "dialogueline":"Sure. I'm Adolf Hitler.", "eventid":"1", "dialoguetype": 0, "children": [6], "condition":[], "option":"Can you tell me your name?", "isroot": false}, 
{"id":6, "dialogueline":"I think he mentioned a place called Madrid", "eventid":"2", "dialoguetype": 0, "children": [7], "condition":[], "option":"Did the victim mention something to you?", "isroot": false}, 
{"id":7, "dialogueline":"Francisco J. Ayala ", "eventid":"3", "dialoguetype": 0, "children": [3], "condition":[], "option":"Is there anyone you suspect?", "isroot": false}],
"crime":{"suspects":[2,5,14,21,25],"culprit":25,"facts":[{"pid":2,"factoid":"Francisco J. Ayala is know for field. biology","condition":37},{"pid":2,"factoid":"Francisco J. Ayala has for almamater","condition":35},{"pid":2,"factoid":"Francisco J. Ayala is know for subject. members of the united states national academy of sciences","condition":57},{"pid":2,"factoid":"Francisco J. Ayala has for doctoraladvisor","condition":69},{"pid":5,"factoid":"Otto Wallach is know for field. organic chemistry","condition":73},{"pid":5,"factoid":"Otto Wallach has for almamater","condition":51},{"pid":5,"factoid":"Otto Wallach is know for subject. category:german jews","condition":47},{"pid":5,"factoid":"Otto Wallach has for doctoraladvisor","condition":43},{"pid":14,"factoid":"Paco Axel Lagerstrom is know for field. asymptotic expansion","condition":71},{"pid":14,"factoid":"Paco Axel Lagerstrom has for almamater","condition":39},{"pid":14,"factoid":"Paco Axel Lagerstrom is know for subject. swedish mathematicians","condition":53},{"pid":14,"factoid":"Paco Axel Lagerstrom has for doctoraladvisor","condition":49},{"pid":21,"factoid":"Jacob Palis is know for field. mathematics","condition":67},{"pid":21,"factoid":"Jacob Palis has for almamater","condition":41},{"pid":21,"factoid":"Jacob Palis is know for subject. members of the french academy of sciences","condition":55},{"pid":21,"factoid":"Jacob Palis has for doctoraladvisor","condition":61},{"pid":25,"factoid":"Michael Sternberg is know for field. systems biology","condition":59},{"pid":25,"factoid":"Michael Sternberg has for almamater","condition":63},{"pid":25,"factoid":"Michael Sternberg is know for subject. category:living people","condition":65},{"pid":25,"factoid":"Michael Sternberg has for doctoraladvisor","condition":45}]}}
