{
"people" : [
{"id":3, "name":"Wilhelm Wien", "description":"Wilhelm Carl Werner Otto Fritz Franz Wien  was a German physicist who, in 1893, used theories about heat and electromagnetism to deduce Wien's displacement law, which calculates the emission of a blackbody at any temperature from the emission at any one reference temperature.  He also formulated an expression for the black-body radiation which is correct in the photon-gas limit.", "drootid": 3, "condition":[], "buildingid":0, "image":"PERSON3.png"}, 
{"id":6, "name":"Alfred Kleiner", "description":"Alfred Kleiner  was a Swiss physicist and Professor of Experimental Physics at the University of Zurich.  He was Albert Einstein's doctoral advisor or Doktorvater.", "drootid": 18, "condition":[], "buildingid":0, "image":"PERSON6.png"}, 
{"id":10, "name":"Sylvester James Gates", "description":"Sylvester James Gates Jr.  , known as S. James Gates Jr. ", "drootid": 36, "condition":[], "buildingid":0, "image":"PERSON10.png"}, 
{"id":1, "name":"Hans Albert Einstein", "description":" Hans Albert Einstein  was a Swiss-American engineer and educator, and the second child and first son of Albert Einstein and Mileva Mari?.  He is best known for his research on sediment transport.", "drootid": 9, "condition":[2], "buildingid":1, "image":"PERSON1.png"}, 
{"id":2, "name":"Eberhard Klagemann", "description":"Eberhard Klagemann  was a German film producer.  During the 1930s, he worked for UFA as an assistant producer under Erich Pommer and later for 20th Century Fox's German subsidiary.", "drootid": 14, "condition":[5], "buildingid":2, "image":"PERSON2.png"}, 
{"id":11, "name":"Ulrich Kutschera", "description":"Ulrich Kutschera  is a Professor of plant physiology and evolutionary biology who works at the University of Kassel, Germany, and as a Visiting Scientist in Stanford, California, USA.  He is the founder and head of Evolutionbiologie, the Association of Evolutionary Biologists of Germany Kutschera is critical of creationism and intelligent design.", "drootid": 47, "condition":[16], "buildingid":2, "image":"PERSON11.png"}, 
{"id":5, "name":"Fritz Kirchhoff", "description":"Fritz Kirchhoff  was a German screenwriter, film producer and director.  He was a noted director during the Nazi era, directing film such as the anti-British propaganda thriller Attack on Baku .", "drootid": 32, "condition":[11], "buildingid":5, "image":"PERSON5.png"}, 
{"id":7, "name":"William Wrede", "description":"Georg Friedrich Eduard William Wrede  was a German Lutheran theologian.  Wrede was born at Bücken in Hanover.", "drootid": 29, "condition":[10], "buildingid":5, "image":"PERSON7.png"}, 
{"id":8, "name":"Hans Reichenbach", "description":"Hans Reichenbach  was a leading philosopher of science, educator, and proponent of logical empiricism.  He was influential in the areas of science, education, and of logical empiricism.", "drootid": 43, "condition":[14], "buildingid":6, "image":"PERSON8.png"}, 
{"id":9, "name":"Franz Weber", "description":"Franz Weber  was a German actor who appeared in more than a hundred films during a lengthy screen career.  He appeared in a diverse range of productions which encompassed the Weimar, Nazi and post-war  eras.", "drootid": 50, "condition":[17], "buildingid":7, "image":"PERSON9.png"}, 
{"id":4, "name":"Kurt Mendelssohn", "description":"Kurt Alfred Georg Mendelssohn FRS  was a German-born British medical physicist, elected a Fellow of the Royal Society 1951.  He was a great-great-grandson of Saul Mendelssohn, the younger brother of philosopher Moses Mendelssohn.", "drootid": 25, "condition":[8], "buildingid":4, "image":"PERSON4.png"}],
"items":[{"id":1, "name":"Flashlight", "description":"A flashlight with batteries", "condition": [], "eventid": -1, "buildingid":0, "itemtype":"flashlight", "image":"null"}, 
{"id":0, "name":"1904 births", "description":"It is a photograph about 1904 births. In a corner, it says:1904 births.  There are things written behind: Hans Albert Einstein Eberhard Klagemann   And the following place: German Empire", "condition": [4], "eventid": 5, "buildingid":3, "itemtype":"photograph", "image":"PHOTO0.png"}],
"buildings":[{"id":0, "name":"House of Albert Einstein", "description":" and Swiss Confederation  Switzerland , officially the Swiss Confederation is a federal republic in Europe", "locktype": "null", "coordx": 316, "coordy": 178, "condition":[], "cityid":0, "peopleid":[3,6,10], "itemsid":[1], "image":"BUILDING0.png"}, 
{"id":3, "name":"Theatre", "description":" While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\"  The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east", "locktype": "null", "coordx": 123, "coordy": 108, "condition":[4], "cityid":0, "peopleid":[], "itemsid":[0], "image":"BUILDING3.png"}, 
{"id":1, "name":"House of Hans Albert Einstein", "description":"The city of Bern  or Berne  is the de facto capital of Switzerland, referred to by the Swiss as their  Bundesstadt, or \"federal city\" With a population of 141,107 , Bern is the fourth most populous city in Switzerland", "locktype": "null", "coordx": 75, "coordy": 276, "condition":[2], "cityid":1, "peopleid":[1], "itemsid":[], "image":"BUILDING1.png"}, 
{"id":2, "name":"House of Eberhard Klagemann", "description":"The German Empire  was the historical German nation state that existed from the unification of Germany in 1871 to the abdication of Kaiser Wilhelm II in November 1918, when Germany became a federal republic The German Empire consisted of 26 constituent territories, with most being ruled by royal families", "locktype": "null", "coordx": 248, "coordy": 174, "condition":[5,16], "cityid":2, "peopleid":[2,11], "itemsid":[], "image":"BUILDING2.png"}, 
{"id":5, "name":"House of Fritz Kirchhoff", "description":" This included four kingdoms, six grand duchies, five duchies , seven principalities, three free Hanseatic cities, and one imperial territory Although the Kingdom of Prussia contained most of the Empire's population and territory, it played a lesser role", "locktype": "null", "coordx": 77, "coordy": 276, "condition":[11,10], "cityid":2, "peopleid":[5,7], "itemsid":[], "image":"BUILDING5.png"}, 
{"id":6, "name":"House of Hans Reichenbach", "description":" As Dwyer  points out, Prussia's \"political and cultural influence had diminished considerably\" by the 1890s After 1850, the states of Germany had rapidly become industrialized, with particular strengths in coal, iron , chemicals, and railways", "locktype": "null", "coordx": 102, "coordy": 82, "condition":[14], "cityid":2, "peopleid":[8], "itemsid":[], "image":"BUILDING6.png"}, 
{"id":7, "name":"House of Franz Weber", "description":" In 1871 it had a population of 41 million people, and by 1913 this had increased to 68 million A heavily rural collection of states in 1815, the united Germany became predominantly urban", "locktype": "null", "coordx": 232, "coordy": 253, "condition":[17], "cityid":2, "peopleid":[9], "itemsid":[], "image":"BUILDING7.png"}, 
{"id":4, "name":"House of Kurt Mendelssohn", "description":"The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom  or Britain, is a sovereign state in Europe Lying off the north-western coast of the European mainland, it includes the island of Great Britain , the north-eastern part of the island of Ireland, and many smaller islands", "locktype": "null", "coordx": 321, "coordy": 248, "condition":[8], "cityid":4, "peopleid":[4], "itemsid":[], "image":"BUILDING4.png"}],
"cities":[{"id":0, "name":"Switzerland", "description":" and Swiss Confederation . Switzerland , officially the Swiss Confederation is a federal republic in Europe. While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\" . The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2 . While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zürich and Geneva. The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. The country has a history of armed neutrality going back to the Reformation, it has not been in a state of war internationally since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. In addition to being the birthplace of the Red Cross, Switzerland is home to numerous international organisations, including the second largest UN office. On the European level, it is a founding member of the European Free Trade Association, but notably it is not part of the European Union, nor the European Economic Area. However, the country does participate in the Schengen Area and the EU's single market through a number of bilateral treaties. Spanning the intersection of Germanic and Romance Europe, Switzerland comprises four main linguistic and cultural regions: German, French, Italian and Romansh. Although the majority of the population are German speaking, Swiss national identity is rooted in a common historical background, shared values such as federalism and direct democracy, and Alpine symbolism. Due to its linguistic diversity, Switzerland is known by a variety of native names: Schweiz [??va?ts] ; Suisse [s?is] ; Svizzera [?zvittsera] ; and Svizra [??vi?tsr?] or [??vi?ts???] . On coins and stamps, Latin  is used instead of the four living languages. Switzerland is one of the most developed countries in the world, with the highest nominal wealth per adult and the eighth-highest per capita gross domestic product according to the IMF. Switzerland ranks at or near the top globally in several metrics of national performance, including government transparency, civil liberties, quality of life, economic competitiveness, and human development. Zürich and Geneva have each been ranked among the top cities in the world in terms of quality of life, with the former ranked second globally, according to Mercer.", "coordx": 210, "coordy": 124, "condition":[], "buildingid":[0,3], "image":"CITY0.png"}, 
{"id":1, "name":"Bern", "description":"The city of Bern  or Berne  is the de facto capital of Switzerland, referred to by the Swiss as their  Bundesstadt, or \"federal city\". With a population of 141,107 , Bern is the fourth most populous city in Switzerland. The Bern agglomeration, which includes 36 municipalities, had a population of 406,900 in 2014. The metropolitan area had a population of 660,000 in 2000. Bern is also the capital of the Canton of Bern, the second most populous of Switzerland's cantons. The official language in Bern is the Swiss variety of Standard German, but the most-spoken language is an Alemannic Swiss German dialect, Bernese German. In 1983, the historic old town in the centre of Bern became a UNESCO World Heritage Site. Bern is ranked among the world’s top ten cities for the best quality of life .", "coordx": 210, "coordy": 124, "condition":[2], "buildingid":[1], "image":"CITY1.png"}, 
{"id":2, "name":"German Empire", "description":"The German Empire  was the historical German nation state that existed from the unification of Germany in 1871 to the abdication of Kaiser Wilhelm II in November 1918, when Germany became a federal republic. The German Empire consisted of 26 constituent territories, with most being ruled by royal families. This included four kingdoms, six grand duchies, five duchies , seven principalities, three free Hanseatic cities, and one imperial territory. Although the Kingdom of Prussia contained most of the Empire's population and territory, it played a lesser role. As Dwyer  points out, Prussia's \"political and cultural influence had diminished considerably\" by the 1890s. After 1850, the states of Germany had rapidly become industrialized, with particular strengths in coal, iron , chemicals, and railways. In 1871 it had a population of 41 million people, and by 1913 this had increased to 68 million. A heavily rural collection of states in 1815, the united Germany became predominantly urban. During its 47 years of existence, the German Empire operated as an industrial, technological, and scientific giant, gaining more Nobel Prizes in science than any other country. Germany became a great power, boasting a rapidly growing rail network, the world's strongest army, and a fast-growing industrial base. In less than a decade, its navy became second only to Britain's Royal Navy. When the great crisis of 1914 arrived, the German Empire had only one ally – Austria-Hungary. They were later joined by the Ottoman Empire and Bulgaria to form the Central Powers or Quadruple Alliance. In the First World War, German plans to capture Paris quickly in autumn 1914 failed, and the war on the Western Front became a stalemate. The Allied naval blockade caused severe shortages of food. Germany was repeatedly forced to send troops to bolster Austria and Turkey on other fronts. However, Germany had great success on the Eastern Front; it occupied large Eastern territories following the Treaty of Brest-Litovsk. German declaration of unrestricted submarine warfare in early 1917 was designed to strangle the British; it failed, because of the use of a trans-Atlantic convoy system. But the declaration—along with the Zimmermann Telegram—did bring the United States into the war. Meanwhile, German civilians and soldiers had become war-weary and radicalised by the Russian Revolution. The high command under Paul von Hindenburg and Erich Ludendorff increasingly controlled the country, as they gambled on one last offensive in spring 1918 before the Americans could arrive in force, using large numbers of troops, aeroplanes and artillery withdrawn from the Eastern Front. This failed, and by October the armies were in retreat, the Austro-Hungarian Empire and the Ottoman Empire had collapsed, and the German people had lost faith in their political system. The Empire collapsed in the November 1918 Revolution as the Emperor and all the ruling monarchs abdicated, and a republic took over.", "coordx": 219, "coordy": 111, "condition":[5,16,11,10,14,17], "buildingid":[2,5,6,7], "image":"CITY2.png"}, 
{"id":4, "name":"United Kingdom", "description":"The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom  or Britain, is a sovereign state in Europe. Lying off the north-western coast of the European mainland, it includes the island of Great Britain , the north-eastern part of the island of Ireland, and many smaller islands. Northern Ireland is the only part of the UK that shares a land border with another sovereign state—the Republic of Ireland. Apart from this land border, the UK is surrounded by the Atlantic Ocean, with the North Sea to its east, the English Channel to its south and the Celtic Sea to its south-southwest, giving it the 12th longest coastline in the world. The Irish Sea lies between Great Britain and Ireland. With an area of 242,500 square kilometres , the UK is the 78th-largest sovereign state in the world and the 11th-largest in Europe. It is also the 21st-most populous country, with an estimated 65.1 million inhabitants. Together, this makes it the fourth most densely populated country in the European Union. The United Kingdom is a constitutional monarchy with a parliamentary system of governance. The monarch—since 6 February 1952—is Queen Elizabeth II. The capital of UK and its largest city is London, a global city and financial centre with an urban area population of 10.3 million, the fourth-largest in Europe and second-largest in the European Union. Other major urban areas in the UK include the regions of Manchester, Birmingham, Leeds, Glasgow and Liverpool. The UK consists of four countries, England, Scotland, Wales and Northern Ireland. The latter three have devolved administrations, each with varying powers, based in their capitals, Edinburgh, Cardiff, and Belfast, respectively. The nearby Isle of Man, Bailiwick of Guernsey and Bailiwick of Jersey are not part of the United Kingdom, being Crown dependencies with the British Government responsible for defence and international representation. The relationships among the countries of the United Kingdom have changed over time. Wales was annexed by the Kingdom of England under the Acts of Union of 1536 and 1542. A treaty between England and Scotland resulted in 1707 in a unified Kingdom of Great Britain, which merged in 1801 with the Kingdom of Ireland to form the United Kingdom of Great Britain and Ireland. In 1922, five-sixths of Ireland seceded from the country, leaving the present formulation of the United Kingdom of Great Britain and Northern Ireland. There are fourteen British Overseas Territories. These are the remnants of the British Empire which, at its height in the 1920s, encompassed almost a quarter of the world's land mass and was the largest empire in history. British influence can be observed in the language, culture, and legal systems of many of its former colonies. The United Kingdom is a developed country and has the world's fifth-largest economy by nominal GDP and ninth-largest economy by purchasing power parity. The UK is considered to have a high-income economy and is categorised as very high in the Human Development Index, ranking 14th in the world. It was the world's first industrialised country and the world's foremost power during the 19th and early 20th centuries. The UK remains a great power with considerable economic, cultural, military, scientific, and political influence internationally. It is a recognised nuclear weapons state and its military expenditure ranks fourth or fifth in the world. The UK has been a permanent member of the United Nations Security Council since its first session in 1946. It has been a leading member state of the European Union  and its predecessor, the European Economic Community , since 1973. However, on 23 June 2016, a national referendum on the UK's membership of the EU resulted in a 51.9% vote to exit. The UK is also a member of the Commonwealth of Nations, the Council of Europe, the G7 finance ministers, the G7 forum, the G20, NATO, the Organisation for Economic Co-operation and Development , and the World Trade Organization .", "coordx": 199, "coordy": 114, "condition":[8], "buildingid":[4], "image":"CITY4.png"}],
"dialoguenodes":[{"id":25, "dialogueline":"Hello? Can I help you?", "eventid":"-1", "dialoguetype": 0, "children": [26], "keywords": ["Fritz Kirchhoff","William Wrede","House of Fritz Kirchhoff","German Empire"], "condition":[], "option":"", "isroot": true}, 
{"id":26, "dialogueline":"Are you sure you need me?", "eventid":"-1", "dialoguetype": 100, "children": [27], "keywords": ["Fritz Kirchhoff","William Wrede","House of Fritz Kirchhoff","German Empire"], "condition":[], "option":"Hi, I'm a private investigator. Could I ask you some questions?", "isroot": false}, 
{"id":27, "dialogueline":"I think the House of Fritz Kirchhoff could reveal something.", "eventid":"-1", "dialoguetype": 0, "children": [28], "keywords": ["Fritz Kirchhoff","William Wrede","House of Fritz Kirchhoff","German Empire"], "condition":[], "option":"Somebody hinted to me to look for Fritz Kirchhoff. Have you heard of them?", "isroot": false}, 
{"id":28, "dialogueline":"I recommend you check out German Empire. Try there.", "eventid":"10", "dialoguetype": 0, "children": [26], "keywords": ["Fritz Kirchhoff","William Wrede","House of Fritz Kirchhoff","German Empire"], "condition":[], "option":"Where is the House of Fritz Kirchhoff?", "isroot": false}, 
{"id":50, "dialogueline":"I don't have to speak to you", "eventid":"-1", "dialoguetype": 100, "children": [51,59,61], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":61, "dialogueline":"I am a subject of german male film actor", "eventid":"27", "dialoguetype": 626, "children": [50], "keywords": [], "condition":[26], "option":"Tell me about yourself.", "isroot": false}, 
{"id":59, "dialogueline":"I died in west germany", "eventid":"25", "dialoguetype": 626, "children": [50], "keywords": [], "condition":[24], "option":"Tell me about yourself.", "isroot": false}, 
{"id":51, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [50], "keywords": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":43, "dialogueline":"Hello?", "eventid":"-1", "dialoguetype": 0, "children": [44], "keywords": ["Franz Weber","Ulrich Kutschera","House of Eberhard Klagemann","German Empire"], "condition":[], "option":"", "isroot": true}, 
{"id":44, "dialogueline":"Yeah.", "eventid":"-1", "dialoguetype": 100, "children": [45,56,58], "keywords": ["Franz Weber","Ulrich Kutschera","House of Eberhard Klagemann","German Empire"], "condition":[], "option":"Hi, I'm working on the victim's case. Thank you for your time, I request that you answer some questions.", "isroot": false}, 
{"id":58, "dialogueline":"Franz Weber died in west berlin", "eventid":"24", "dialoguetype": 616, "children": [44], "keywords": ["died","dead","west berlin","Franz Weber"], "condition":[-1], "option":"I need your cooperation. Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":56, "dialogueline":"Eberhard Klagemann is a subject of german film producer", "eventid":"22", "dialoguetype": 616, "children": [44], "keywords": ["german film producer","subject","Eberhard Klagemann"], "condition":[-1], "option":"I need a lead. Do you recall any information about one of the suspects?", "isroot": false}, 
{"id":45, "dialogueline":"I think the House of Eberhard Klagemann might have a clue.", "eventid":"-1", "dialoguetype": 0, "children": [46], "keywords": ["Franz Weber","Ulrich Kutschera","House of Eberhard Klagemann","German Empire"], "condition":[], "option":"I am searching for Franz Weber. Do you know where they could be?", "isroot": false}, 
{"id":46, "dialogueline":"Last I had heard it is located in German Empire. Try travelling there.", "eventid":"16", "dialoguetype": 0, "children": [44], "keywords": ["Franz Weber","Ulrich Kutschera","House of Eberhard Klagemann","German Empire"], "condition":[], "option":"Where is the House of Eberhard Klagemann?", "isroot": false}, 
{"id":29, "dialogueline":"Hello?", "eventid":"-1", "dialoguetype": 0, "children": [30], "keywords": ["Fritz Kirchhoff","Fritz Kirchhoff","German Empire"], "condition":[], "option":"", "isroot": true}, 
{"id":30, "dialogueline":"Okay. I'll do my best.", "eventid":"-1", "dialoguetype": 100, "children": [31], "keywords": ["Fritz Kirchhoff","Fritz Kirchhoff","German Empire"], "condition":[], "option":"Greetings, I'm a super sleuth. Please can you help answer some questions?", "isroot": false}, 
{"id":31, "dialogueline":"A friend told me they were rumored to be in German Empire.", "eventid":"11", "dialoguetype": 0, "children": [30], "keywords": ["Fritz Kirchhoff","Fritz Kirchhoff","German Empire"], "condition":[], "option":"Someone advised me to look for Fritz Kirchhoff. Any idea where they might have gone?", "isroot": false}, 
{"id":32, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 100, "children": [33,53,63], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":63, "dialogueline":"I am a subject of german film producer", "eventid":"29", "dialoguetype": 626, "children": [32], "keywords": [], "condition":[28], "option":"Tell me about yourself.", "isroot": false}, 
{"id":53, "dialogueline":"I died in west germany", "eventid":"19", "dialoguetype": 626, "children": [32], "keywords": [], "condition":[18], "option":"Tell me about yourself.", "isroot": false}, 
{"id":33, "dialogueline":"You have no proof.", "eventid":"-1", "dialoguetype": 0, "children": [32], "keywords": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":47, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [48], "keywords": ["Franz Weber","Franz Weber","German Empire"], "condition":[], "option":"", "isroot": true}, 
{"id":48, "dialogueline":"Of course. Whatever I can do to help.", "eventid":"-1", "dialoguetype": 100, "children": [49], "keywords": ["Franz Weber","Franz Weber","German Empire"], "condition":[], "option":"Hello, I'm a super sleuth. Thank you for your time, could I ask you some questions?", "isroot": false}, 
{"id":49, "dialogueline":"They located in German Empire. They probably will be there.", "eventid":"17", "dialoguetype": 0, "children": [48], "keywords": ["Franz Weber","Franz Weber","German Empire"], "condition":[], "option":"Someone told me to search for Franz Weber. Any idea where they could have gone?", "isroot": false}, 
{"id":14, "dialogueline":"I want my lawyer", "eventid":"-1", "dialoguetype": 100, "children": [15,55,57], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":57, "dialogueline":"I am a subject of german film producer", "eventid":"23", "dialoguetype": 626, "children": [14], "keywords": [], "condition":[22], "option":"Tell me about yourself.", "isroot": false}, 
{"id":55, "dialogueline":"I died in west germany", "eventid":"21", "dialoguetype": 626, "children": [14], "keywords": [], "condition":[20], "option":"Tell me about yourself.", "isroot": false}, 
{"id":15, "dialogueline":"You have no proof.", "eventid":"-1", "dialoguetype": 0, "children": [14], "keywords": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":9, "dialogueline":"Hello? May I assist you?", "eventid":"-1", "dialoguetype": 0, "children": [10], "keywords": ["Eberhard Klagemann","Theatre","Switzerland"], "condition":[], "option":"", "isroot": true}, 
{"id":10, "dialogueline":"I'm not sure I'll be very helpful...", "eventid":"-1", "dialoguetype": 100, "children": [11,13], "keywords": ["Eberhard Klagemann","Theatre","Switzerland"], "condition":[], "option":"Greetings, I'm a detective. If you don't mind, I have some questions for you.", "isroot": false}, 
{"id":13, "dialogueline":"I reside at 22-rdf-syntax-ns#langString.", "eventid":"-1", "dialoguetype": 2, "children": [10], "keywords": [], "condition":[], "option":"Where is your current residence? It might be important to the case.", "isroot": false}, 
{"id":11, "dialogueline":"I'm not sure. However, I would look in the Theatre if I were you. You might find something.", "eventid":"-1", "dialoguetype": 0, "children": [12], "keywords": ["Eberhard Klagemann","Theatre","Switzerland"], "condition":[], "option":"Somebody advised me to find Eberhard Klagemann. Any idea where they might have gone?", "isroot": false}, 
{"id":12, "dialogueline":"I suggest you travel to Switzerland. Try there.", "eventid":"4", "dialoguetype": 0, "children": [10], "keywords": ["Eberhard Klagemann","Theatre","Switzerland"], "condition":[], "option":"Where could I go to find the Theatre?", "isroot": false}, 
{"id":36, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [37], "keywords": [], "condition":[], "option":"", "isroot": true}, 
{"id":37, "dialogueline":"Certainly. I'll do my best.", "eventid":"12", "dialoguetype": 100, "children": [38,60,62], "keywords": ["Franz Weber","Hans Reichenbach","Franz Weber (actor)","German Empire","Sylvester James Gates","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Hello, I'm a super sleuth. I'm sorry to disturb, I ask that you answer some questions.", "isroot": false}, 
{"id":62, "dialogueline":"Fritz Kirchhoff is a subject of german film producer", "eventid":"28", "dialoguetype": 616, "children": [37], "keywords": ["german film producer","subject","Fritz Kirchhoff"], "condition":[12], "option":"Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":60, "dialogueline":"Franz Weber is a subject of german male film actor", "eventid":"26", "dialoguetype": 616, "children": [37], "keywords": ["german male film actor","subject","Franz Weber"], "condition":[12], "option":"I need some cooperation. Could you tell me some information about one of the suspects?", "isroot": false}, 
{"id":38, "dialogueline":"I'm Sylvester James Gates.", "eventid":"13", "dialoguetype": 0, "children": [40], "keywords": ["Franz Weber","Hans Reichenbach","Franz Weber (actor)","German Empire","Sylvester James Gates","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Please, tell me your name.", "isroot": false}, 
{"id":40, "dialogueline":"Someone told me Hans Reichenbach was seen in German Empire.", "eventid":"14", "dialoguetype": 0, "children": [41], "keywords": ["Franz Weber","Hans Reichenbach","Franz Weber (actor)","German Empire","Sylvester James Gates","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Is there something specific about the victim that you recollect?", "isroot": false}, 
{"id":41, "dialogueline":"I am suspicious of Franz Weber (actor).", "eventid":"15", "dialoguetype": 0, "children": [37], "keywords": ["Franz Weber","Hans Reichenbach","Franz Weber (actor)","German Empire","Sylvester James Gates","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Can you think of anybody who could be involved?", "isroot": false}, 
{"id":18, "dialogueline":"Hello?", "eventid":"-1", "dialoguetype": 0, "children": [19], "keywords": [], "condition":[], "option":"", "isroot": true}, 
{"id":19, "dialogueline":"Yeah.", "eventid":"6", "dialoguetype": 100, "children": [20,54], "keywords": ["Fritz Kirchhoff","Kurt Mendelssohn","Fritz Kirchhoff","United Kingdom","Alfred Kleiner","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Hi, I'm working on the victim's case. If you don't mind, please would you help answer some questions?", "isroot": false}, 
{"id":54, "dialogueline":"Eberhard Klagemann died in west germany", "eventid":"20", "dialoguetype": 616, "children": [19], "keywords": ["died","dead","west germany","Eberhard Klagemann"], "condition":[6], "option":"I could use a lead. Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":20, "dialogueline":"I am known as Alfred Kleiner.", "eventid":"7", "dialoguetype": 0, "children": [22], "keywords": ["Fritz Kirchhoff","Kurt Mendelssohn","Fritz Kirchhoff","United Kingdom","Alfred Kleiner","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Please, state your name.", "isroot": false}, 
{"id":22, "dialogueline":"Kurt Mendelssohn travelled to United Kingdom.", "eventid":"8", "dialoguetype": 0, "children": [23], "keywords": ["Fritz Kirchhoff","Kurt Mendelssohn","Fritz Kirchhoff","United Kingdom","Alfred Kleiner","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Is there anything specific you think I should know about?", "isroot": false}, 
{"id":23, "dialogueline":"It is hard to say. However, I am suspicious of Fritz Kirchhoff.", "eventid":"9", "dialoguetype": 0, "children": [19], "keywords": ["Fritz Kirchhoff","Kurt Mendelssohn","Fritz Kirchhoff","United Kingdom","Alfred Kleiner","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Can you think of anyone who might know something?", "isroot": false}, 
{"id":3, "dialogueline":"Hi. Do you need something?", "eventid":"-1", "dialoguetype": 0, "children": [4], "keywords": [], "condition":[], "option":"", "isroot": true}, 
{"id":4, "dialogueline":"Okay. I can try.", "eventid":"0", "dialoguetype": 100, "children": [5], "keywords": ["Eberhard Klagemann","Hans Albert Einstein","Eberhard Klagemann","Bern","Wilhelm Wien","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Hi, I'm assigned to the victim's case. Can you answer some questions for me?", "isroot": false}, 
{"id":5, "dialogueline":"I am known as Wilhelm Wien.", "eventid":"1", "dialoguetype": 0, "children": [7], "keywords": ["Eberhard Klagemann","Hans Albert Einstein","Eberhard Klagemann","Bern","Wilhelm Wien","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"What is your name?", "isroot": false}, 
{"id":7, "dialogueline":"Hans Albert Einstein was travelling to Bern.", "eventid":"2", "dialoguetype": 0, "children": [8], "keywords": ["Eberhard Klagemann","Hans Albert Einstein","Eberhard Klagemann","Bern","Wilhelm Wien","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Is there something specific about the victim that you recall?", "isroot": false}, 
{"id":8, "dialogueline":"I'm unsure. However, I am suspicious of Eberhard Klagemann.", "eventid":"3", "dialoguetype": 0, "children": [4], "keywords": ["Eberhard Klagemann","Hans Albert Einstein","Eberhard Klagemann","Bern","Wilhelm Wien","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Do you have any more information?", "isroot": false}],
"crime":{"suspects":[2,9,5],"culprit":9},
"facts":[{"id":0,"pid":2,"factoid":"Eberhard Klagemann is a subject of german film producer","condition":22},{"id":0,"pid":2,"factoid":"Eberhard Klagemann died in west germany","condition":20},{"id":0,"pid":9,"factoid":"Franz Weber is a subject of german male film actor","condition":26},{"id":0,"pid":9,"factoid":"Franz Weber died in west berlin","condition":24},{"id":0,"pid":5,"factoid":"Fritz Kirchhoff is a subject of german film producer","condition":28},{"id":0,"pid":5,"factoid":"Fritz Kirchhoff died in west germany","condition":18}]}
