{
"people" : [
{"id":3, "name":"Lev Landau", "description":"Lev Davidovich Landau  was a Soviet physicist who made fundamental contributions to many areas of theoretical physics.  His accomplishments include the independent co-discovery of the density matrix method in quantum mechanics , the quantum mechanical theory of diamagnetism, the theory of superfluidity, the theory of second-order phase transitions, the Ginzburg–Landau theory of superconductivity, the theory of Fermi liquid, the explanation of Landau damping in plasma physics, the Landau pole in quantum electrodynamics, the two-component theory of neutrinos, and Landau's equations for S matrix singularities.", "drootid": 3, "condition":[], "buildingid":0, "image":"PERSON3.png"}, 
{"id":6, "name":"Rabindranath Tagore", "description":"Rabindranath Tagore FRAS , also written Ravīndranātha Thākura , sobriquet Gurudev, was a Bengali polymath who reshaped Bengali literature and music, as well as Indian art with Contextual Modernism in the late 19th and early 20th centuries.  Author of Gitanjali and its \"profoundly sensitive, fresh and beautiful verse\", he became the first non-European to win the Nobel Prize in Literature in 1913.", "drootid": 15, "condition":[], "buildingid":0, "image":"PERSON6.png"}, 
{"id":10, "name":"David Hume", "description":"David Hume  – 25 August 1776  was a Scottish philosopher, historian, economist, and essayist, who is best known today for his highly influential system of radical philosophical empiricism, skepticism, and naturalism.  Hume's empiricist approach to philosophy places him with John Locke, George Berkeley, Francis Bacon, and Thomas Hobbes as a British Empiricist.", "drootid": 28, "condition":[], "buildingid":0, "image":"PERSON10.png"}, 
{"id":15, "name":"Austen Chamberlain", "description":"Sir Joseph Austen Chamberlain KG  was a British statesman, son of Joseph Chamberlain and half-brother of Neville Chamberlain.  He stood for the Liberal Unionist party, which merged with the Conservatives in 1912, and led the Conservatives in the Commons in 1921-22.", "drootid": 41, "condition":[], "buildingid":0, "image":"PERSON15.png"}, 
{"id":20, "name":"Ernst Mach", "description":"Ernst Waldfried Josef Wenzel Mach  was an Austrian physicist and philosopher, noted for his contributions to physics such as study of shock waves.  The ratio of one's speed to that of sound is named the Mach number in his honor.", "drootid": 63, "condition":[], "buildingid":0, "image":"PERSON20.png"}, 
{"id":1, "name":"Mary Pickford", "description":"Gladys Louise Smith , known professionally as Mary Pickford, was a Canadian-American film actress, writer, director, and producer.  She was a co-founder of the film studio United Artists and one of the original 36 founders of the Academy of Motion Picture Arts and Sciences.", "drootid": 8, "condition":[4], "buildingid":1, "image":"PERSON1.png"}, 
{"id":2, "name":"Douglas Fairbanks", "description":"Douglas Fairbanks  was an American actor, screenwriter, director, and producer.  He was best known for his swashbuckling roles in silent films such as The Thief of Bagdad, Robin Hood, and The Mark of Zorro but spent the early part of his career making comedies.", "drootid": 11, "condition":[5], "buildingid":2, "image":"PERSON2.png"}, 
{"id":7, "name":"William Vickrey", "description":"William Spencer Vickrey  was a Canadian-born professor of economics and Nobel Laureate.  Vickrey was awarded the 1996 Nobel Memorial Prize in Economic Sciences with James Mirrlees for their research into the economic theory of incentives under asymmetric information, becoming the only Nobel laureate born in British Columbia.", "drootid": 21, "condition":[10], "buildingid":6, "image":"PERSON7.png"}, 
{"id":5, "name":"Paul A. Freund", "description":"Paul A.  Freund  was an American jurist and law professor.", "drootid": 24, "condition":[11], "buildingid":4, "image":"PERSON5.png"}, 
{"id":9, "name":"Myron Mathisson", "description":"Myron Mathisson  was a theoretical physicist of Polish and Jewish descent.  He is known for his work in general relativity, for developing a new method to analyze the properties of fundamental solutions of linear hyperbolic partial differential equations, and proved, in a special case, the Hadamard conjecture on the class of equations that satisfy the Huygens principle.", "drootid": 36, "condition":[17], "buildingid":7, "image":"PERSON9.png"}, 
{"id":11, "name":"Einstein field equations", "description":"The Einstein field equations  are the set of 10 equations in Albert Einstein's general theory of relativity that describes the fundamental interaction of gravitation as a result of spacetime being curved by matter and energy.  First published by Einstein in 1915 as a tensor equation, the EFE equate local spacetime curvature  with the local energy and momentum within that spacetime .", "drootid": 34, "condition":[17], "buildingid":7, "image":"PERSON11.png"}, 
{"id":13, "name":"Théophile de Donder", "description":"Théophile Ernest de Donder  was a Belgian mathematician and physicist famous for his work  in developing correlations between the Newtonian concept of chemical affinity and the Gibbsian concept of free energy.", "drootid": 47, "condition":[20], "buildingid":10, "image":"PERSON13.png"}, 
{"id":14, "name":"Louise Schroeder", "description":"Louise Dorothea Schroeder  – 4 June 1957 in Berlin was a German politician of the Social Democratic Party of Germany  party.  She was the first female member of the Weimar National Assembly during the Weimar Republic.", "drootid": 58, "condition":[23], "buildingid":11, "image":"PERSON14.png"}, 
{"id":16, "name":"Théophile de Donder", "description":"Théophile Ernest de Donder  was a Belgian mathematician and physicist famous for his work  in developing correlations between the Newtonian concept of chemical affinity and the Gibbsian concept of free energy.", "drootid": 56, "condition":[23], "buildingid":11, "image":"PERSON16.png"}, 
{"id":21, "name":"James Parker", "description":"James Parker  was an American art historian.  He served for nearly three decades as a curator at The Metropolitan Museum of Art.", "drootid": 74, "condition":[28], "buildingid":15, "image":"PERSON21.png"}, 
{"id":18, "name":"Léon Brillouin", "description":"Léon Nicolas Brillouin  was a French physicist.  He made contributions to quantum mechanics, radio wave propagation in the atmosphere, solid state physics, and information theory.", "drootid": 70, "condition":[26], "buildingid":13, "image":"PERSON18.png"}, 
{"id":19, "name":"Dick Van Patten", "description":"Richard Vincent \"Dick\" Van Patten  was an American actor, businessman, and animal welfare advocate, best known for his role as patriarch Tom Bradford on the ABC television comedy-drama Eight Is Enough.  He began work as a child actor and was successful on the New York stage, appearing in more than a dozen plays as a teenager.", "drootid": 77, "condition":[29], "buildingid":14, "image":"PERSON19.png"}],
"items":[{"id":0, "name":"People with acquired American citizenship", "description":"It is a photograph about People with acquired American citizenship. In a corner, it says:People with acquired American citizenship.  There are things written behind: Albert Einstein Mary Pickford   And the following places: Beverly Hills, California and Denver, Colorado", "condition": [2], "eventid": 4, "buildingid":3, "itemtype":"photograph", "image":"PHOTO0.png"}, 
{"id":1, "name":"American Association of University Professors", "description":"It is a letter about American Association of University Professors. It says: The American Association of University Professors  is an organization of professors and other academics in the United States.  AAUP membership is about 47,000, with over 500 local campus chapters and 39 state organizations.  The following people are mentioned:  United States United_States Frank Phillips College Benedict College Our Lady of Holy Cross College Organizations established in 1915 Albertus Magnus College", "condition": [8], "eventid": 10, "buildingid":5, "itemtype":"letter", "image":"null"}, 
{"id":2, "name":"موجة ثقالية", "description":"It is a photograph about موجة ثقالية. In a corner, it says:Gravitational waves are ripples in the curvature of spacetime that propagate as waves at the speed of light, generated in certain gravitational interactions that propagate outward from their source.  The possibility of gravitational waves was discussed in 1893 by Oliver Heaviside using the analogy between the inverse-square law in gravitation and electricity.  There are things written behind: General relativity Two-body problem Gravitomagnetism Age of the Universe Light-year Wavy.gif  And the following place: Poland", "condition": [14], "eventid": 16, "buildingid":8, "itemtype":"photograph", "image":"PHOTO2.png"}, 
{"id":3, "name":"General relativity", "description":"It is a book about General relativity. It says: General relativity  is the geometric theory of gravitation published by Albert Einstein in 1915 and the current description of gravitation in modern physics.  General relativity generalizes special relativity and Newton's law of universal gravitation, providing a unified description of gravity as a geometric property of space and time, or spacetime.  The following people are mentioned:  Myron Mathisson Einstein field equations Theories by Albert Einstein   And the following place: Poland", "condition": [16], "eventid": 17, "buildingid":9, "itemtype":"book", "image":"null"}, 
{"id":4, "name":"1957 deaths", "description":"It is a book about 1957 deaths. It says: 1957 deaths.  The following people are mentioned:  Louise Schroeder Théophile de Donder   And the following place: Altona", "condition": [22], "eventid": 23, "buildingid":12, "itemtype":"book", "image":"null"}],
"buildings":[{"id":0, "name":"House of Albert Einstein", "description":" and Swiss Confederation  Switzerland , officially the Swiss Confederation is a federal republic in Europe", "locktype": "null", "coordx": 204, "coordy": 232, "condition":[], "cityid":0, "peopleid":[3,6,10,15,20], "itemsid":[], "image":"BUILDING0.png"}, 
{"id":1, "name":"House of Mary Pickford", "description":"Beverly Hills is a city in Los Angeles County, California, United States, surrounded by the cities of Los Angeles and West Hollywood Originally a Spanish ranch where lima beans were grown, Beverly Hills was incorporated in 1914 by a group of investors who had failed to find oil, but found water instead and eventually decided to develop it into a town", "locktype": "null", "coordx": 236, "coordy": 72, "condition":[4], "cityid":1, "peopleid":[1], "itemsid":[], "image":"BUILDING1.png"}, 
{"id":2, "name":"House of Douglas Fairbanks", "description":"Denver , officially the City and County of Denver, is the capital and most populous municipality of the US", "locktype": "null", "coordx": 207, "coordy": 200, "condition":[5], "cityid":2, "peopleid":[2], "itemsid":[], "image":"BUILDING2.png"}, 
{"id":3, "name":"Bar", "description":" state of Colorado Denver is located in the South Platte River Valley on the western edge of the High Plains just east of the Front Range of the Rocky Mountains", "locktype": "null", "coordx": 302, "coordy": 299, "condition":[2], "cityid":2, "peopleid":[], "itemsid":[0], "image":"BUILDING3.png"}, 
{"id":5, "name":"School", "description":" The Denver downtown district is located immediately east of the confluence of Cherry Creek with the South Platte River, approximately 12 mi  east of the foothills of the Rocky Mountains Denver is nicknamed the Mile-High City because its official elevation is exactly one mile  above sea level, making it one of the highest major cities in the United States", "locktype": "null", "coordx": 317, "coordy": 198, "condition":[8], "cityid":2, "peopleid":[], "itemsid":[1], "image":"BUILDING5.png"}, 
{"id":6, "name":"Museum", "description":", US , USA , and United States  The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions", "locktype": "null", "coordx": 240, "coordy": 290, "condition":[10], "cityid":3, "peopleid":[7], "itemsid":[], "image":"BUILDING6.png"}, 
{"id":4, "name":"House of Paul A. Freund", "description":"St Louis  is an independent city and inland port in the U", "locktype": "null", "coordx": 166, "coordy": 270, "condition":[11], "cityid":4, "peopleid":[5], "itemsid":[], "image":"BUILDING4.png"}, 
{"id":7, "name":"House of Myron Mathisson", "description":"Poland , officially the Republic of Poland , is a country in Central Europe, situated between the Baltic Sea in the north and two mountain ranges  in the south Bordered by Germany to the west; the Czech Republic and Slovakia to the south; Ukraine and Belarus to the east; and the Baltic Sea, Kaliningrad Oblast  and Lithuania to the north", "locktype": "null", "coordx": 208, "coordy": 275, "condition":[17,17], "cityid":5, "peopleid":[9,11], "itemsid":[], "image":"BUILDING7.png"}, 
{"id":8, "name":"Villa", "description":" The total area of Poland is 312,679 square kilometres , making it the 69th largest country in the world and the 9th largest in Europe With a population of over 38", "locktype": "null", "coordx": 246, "coordy": 124, "condition":[14], "cityid":5, "peopleid":[], "itemsid":[2], "image":"BUILDING8.png"}, 
{"id":9, "name":"Bar", "description":"5 million people, Poland is the 34th most populous country in the world, the 8th most populous country in Europe and the sixth most populous member of the European Union, as well as the most populous post-communist member of the European Union Poland is a unitary state divided into 16 administrative subdivisions and its capital and largest city is Warsaw", "locktype": "null", "coordx": 204, "coordy": 130, "condition":[16], "cityid":5, "peopleid":[], "itemsid":[3], "image":"BUILDING9.png"}, 
{"id":12, "name":"Hotel", "description":" Other metropolises include Kraków, Wrocław, Poznań, Gdańsk and Szczecin The country's largest agglomeration is the Silesian Metropolis", "locktype": "null", "coordx": 94, "coordy": 65, "condition":[22], "cityid":5, "peopleid":[], "itemsid":[4], "image":"BUILDING12.png"}, 
{"id":10, "name":"House of Théophile de Donder", "description":"Belgium , officially the Kingdom of Belgium, is a sovereign state in Western Europe It is a small, densely populated country which covers an area of 30,528 square kilometres  and has a population of about 11 million people", "locktype": "null", "coordx": 129, "coordy": 276, "condition":[20], "cityid":6, "peopleid":[13], "itemsid":[], "image":"BUILDING10.png"}, 
{"id":11, "name":"House of Louise Schroeder", "description":"Altona  is the westernmost urban borough  of the German city state of Hamburg, on the right bank of the Elbe river From 1640 to 1864 Altona was under the administration of the Danish monarchy", "locktype": "null", "coordx": 277, "coordy": 271, "condition":[23,23], "cityid":7, "peopleid":[14,16], "itemsid":[], "image":"BUILDING11.png"}, 
{"id":15, "name":"Cottage", "description":"The City of New York, often called New York City, New York, or simply The City, is the most populous city in the United States Located at the southern tip of the state of New York, the city is the center of the New York metropolitan area, one of the most populous urban agglomerations in the world", "locktype": "null", "coordx": 154, "coordy": 176, "condition":[28], "cityid":8, "peopleid":[21], "itemsid":[], "image":"BUILDING15.png"}, 
{"id":13, "name":"House of Léon Brillouin", "description":"Seine-et-Oise was a département of France encompassing the western, northern, and southern parts of the metropolitan area of Paris Its préfecture  was Versailles and its official number was 78", "locktype": "null", "coordx": 326, "coordy": 256, "condition":[26], "cityid":9, "peopleid":[18], "itemsid":[], "image":"BUILDING13.png"}, 
{"id":14, "name":"House of Dick Van Patten", "description":"Queens is the easternmost and largest in area of the five boroughs of New York City It is geographically adjacent to the borough of Brooklyn at the southwestern end of Long Island, and to Nassau County further east on Long Island; in addition, Queens shares water borders with the boroughs of Manhattan and the Bronx", "locktype": "null", "coordx": 308, "coordy": 116, "condition":[29], "cityid":10, "peopleid":[19], "itemsid":[], "image":"BUILDING14.png"}],
"cities":[{"id":0, "name":"Switzerland", "description":" and Swiss Confederation . Switzerland , officially the Swiss Confederation is a federal republic in Europe. While still named the \"Swiss Confederation\" for historical reasons, modern Switzerland is a federal directorial republic consisting of 26 cantons, with Bern as the seat of the federal authorities, called '\"federal city\" . The country is situated in Western-Central Europe, and is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. Switzerland is a landlocked country geographically divided between the Alps, the Swiss Plateau and the Jura, spanning an area of 41,285 km2 . While the Alps occupy the greater part of the territory, the Swiss population of approximately eight million people is concentrated mostly on the plateau, where the largest cities are to be found: among them are the two global and economic centres Zürich and Geneva. The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. The country has a history of armed neutrality going back to the Reformation, it has not been in a state of war internationally since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. In addition to being the birthplace of the Red Cross, Switzerland is home to numerous international organisations, including the second largest UN office. On the European level, it is a founding member of the European Free Trade Association, but notably it is not part of the European Union, nor the European Economic Area. However, the country does participate in the Schengen Area and the EU's single market through a number of bilateral treaties. Spanning the intersection of Germanic and Romance Europe, Switzerland comprises four main linguistic and cultural regions: German, French, Italian and Romansh. Although the majority of the population are German speaking, Swiss national identity is rooted in a common historical background, shared values such as federalism and direct democracy, and Alpine symbolism. Due to its linguistic diversity, Switzerland is known by a variety of native names: Schweiz [ˈʃvaɪts] ; Suisse [sɥis] ; Svizzera [ˈzvittsera] ; and Svizra [ˈʒviːtsrɐ] or [ˈʒviːtsʁːɐ] . On coins and stamps, Latin  is used instead of the four living languages. Switzerland is one of the most developed countries in the world, with the highest nominal wealth per adult and the eighth-highest per capita gross domestic product according to the IMF. Switzerland ranks at or near the top globally in several metrics of national performance, including government transparency, civil liberties, quality of life, economic competitiveness, and human development. Zürich and Geneva have each been ranked among the top cities in the world in terms of quality of life, with the former ranked second globally, according to Mercer.", "coordx": 210, "coordy": 124, "condition":[], "buildingid":[0], "image":"CITY0.png"}, 
{"id":1, "name":"Beverly Hills, California", "description":"Beverly Hills is a city in Los Angeles County, California, United States, surrounded by the cities of Los Angeles and West Hollywood. Originally a Spanish ranch where lima beans were grown, Beverly Hills was incorporated in 1914 by a group of investors who had failed to find oil, but found water instead and eventually decided to develop it into a town. By 2013, its population had grown to 34,658. Sometimes referred to as \"90210\", one of its primary ZIP codes, it was home to many actors and celebrities throughout the 20th century. The city includes the Rodeo Drive shopping district and the Beverly Hills Oil Field.", "coordx": 31, "coordy": 148, "condition":[4], "buildingid":[1], "image":"CITY1.png"}, 
{"id":2, "name":"Denver, Colorado", "description":"Denver , officially the City and County of Denver, is the capital and most populous municipality of the U.S. state of Colorado. Denver is located in the South Platte River Valley on the western edge of the High Plains just east of the Front Range of the Rocky Mountains. The Denver downtown district is located immediately east of the confluence of Cherry Creek with the South Platte River, approximately 12 mi  east of the foothills of the Rocky Mountains. Denver is nicknamed the Mile-High City because its official elevation is exactly one mile  above sea level, making it one of the highest major cities in the United States. The 105th meridian west of Greenwich, the longitudinal reference for the Mountain Time Zone, passes directly through Denver Union Station. Denver is ranked as a Beta- world city by the Globalization and World Cities Research Network. With a 2015 estimated population of 682,545, Denver ranks as the 19th-most populous U.S. city, and with a 2.8% increase in 2015, the city is also the fastest growing major city in the United States. The 10-county Denver-Aurora-Lakewood, CO Metropolitan Statistical Area had an estimated 2015 population of 2,814,330 and ranked as the 19th most populous U.S. metropolitan statistical area. The 12-city Denver-Aurora, CO Combined Statistical Area had an estimated 2015 population of 3,418,876, which ranks as the 16th most populous U.S. metropolitan area. Denver is the most populous city of the 18-county Front Range Urban Corridor, an oblong urban region stretching across two states with an estimated 2015 population of 4,757,713. Denver is the most populous city within a 500-mile  radius in the Mountain West and the second-most populous city in the Southwestern United States after Phoenix, Arizona. In 2016, Denver was named the best place to live in the USA by U.S. News & World Report.", "coordx": 50, "coordy": 138, "condition":[5,2,8], "buildingid":[2,3,5], "image":"CITY2.png"}, 
{"id":3, "name":"the United States", "description":", US , USA , and United States . The United States of America , commonly referred to as the United States  or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.The 48 contiguous states and federal district are in central North America between Canada and Mexico, with the state of Alaska in the northwestern part of North America and the state of Hawaii comprising an archipelago in the mid-Pacific. The territories are scattered about the Pacific Ocean and the Caribbean Sea. At 3.8 million square miles  and with over 324 million people, the United States is the world's third-largest country by total area  and the third-most populous. It is one of the world's most ethnically diverse and multicultural nations, the product of large-scale immigration from many other countries. The country's capital is Washington, D.C. and its largest city is New York City; other major metropolitan areas include Los Angeles, Chicago, Dallas, San Francisco, Boston, Philadelphia, Houston, Atlanta, and Miami. The geography, climate and wildlife of the country are extremely diverse. Paleo-Indians migrated from Asia to the North American mainland at least 15,000 years ago, with European colonization beginning in the 16th century. The United States emerged from 13 British colonies along the East Coast. Numerous disputes between Great Britain and the colonies in the aftermath of the Seven Years War led to the American Revolution, which began in 1775. On July 4, 1776, as the colonies were fighting Great Britain in the American Revolutionary War, delegates from the 13 colonies unanimously adopted the Declaration of Independence. The war ended in 1783 with recognition of the independence of the United States by Great Britain, and was the first successful war of independence against a European colonial empire. The current constitution was adopted in 1788, after the Articles of Confederation, adopted in 1781, were felt to have provided inadequate federal powers. The first ten amendments, collectively named the Bill of Rights, were ratified in 1791 and designed to guarantee many fundamental civil liberties. The United States embarked on a vigorous expansion across North America throughout the 19th century, displacing American Indian tribes, acquiring new territories, and gradually admitting new states until it spanned the continent by 1848. During the second half of the 19th century, the American Civil War led to the end of legal slavery in the country. By the end of that century, the United States extended into the Pacific Ocean, and its economy, driven in large part by the Industrial Revolution, began to soar. The Spanish–American War and World War I confirmed the country's status as a global military power. The United States emerged from World War II as a global superpower, the first country to develop nuclear weapons, the only country to use them in warfare, and a permanent member of the United Nations Security Council. The end of the Cold War and the dissolution of the Soviet Union in 1991 left the United States as the world's sole superpower. The United States is a highly developed country, with the world's largest economy by nominal GDP. It ranks highly in several measures of socioeconomic performance, including average wage, human development, per capita GDP, and productivity per person. While the U.S. economy is considered post-industrial, characterized by the dominance of services, the manufacturing sector remains the second-largest in the world. Though its population is only 4.4% of the world total, the United States accounts for nearly a quarter of world GDP and almost a third of global military spending, making it the world's foremost military and economic power. The United States is a prominent political and cultural force internationally, and a leader in scientific research and technological innovations.", "coordx": 90, "coordy": 139, "condition":[10], "buildingid":[6], "image":"CITY3.png"}, 
{"id":4, "name":"St. Louis", "description":"St. Louis  is an independent city and inland port in the U.S. state of Missouri. The city developed along the western bank of the Mississippi River, which forms Missouri's border with Illinois. In 2010, St. Louis had a population of 319,294; a 2015 estimate put the population at 315,685, making it the 60th-most populous U.S. city and the second-largest city in Missouri after Kansas City. The St. Louis metropolitan area includes the city as well as nearby areas in Missouri and Illinois; with an estimated population of 2,916,447, it has the largest metropolitan area in Missouri and is the nineteenth largest in the United States. St. Louis was founded in 1764 by fur traders Pierre Laclède and Auguste Chouteau, and named after Louis IX of France. Claimed first by the French, who settled mostly east of the Mississippi River, the region in which the city stands was ceded to Spain following France's defeat in the Seven Years' War. Its territory east of the Mississippi was ceded to the Kingdom of Great Britain, the victor. The area of present-day Missouri was part of Spanish Louisiana from 1762 until 1803; the French persuaded King Charles IV of Spain to cede Louisiana back to France in 1800, but the Spanish continued as administrators of the territory until the Louisiana Purchase in 1803. After the United States acquired this territory in the Louisiana Purchase, St. Louis developed as a major port on the Mississippi River. In the late-19th century, St. Louis was ranked as the fourth-largest city in the United States. It separated from St. Louis County in 1877, becoming an independent city and limiting its own political boundaries. In 1904, it hosted the Louisiana Purchase Exposition and the Summer Olympics. Immigration has increased, and the city is the center of the largest Bosnian population in the world outside their homeland. The economy of metro St. Louis relies on service, manufacturing, trade, transportation of goods, and tourism. Its metro area is home to major corporations, including Anheuser-Busch, Express Scripts, Centene, Boeing Air Defense, Emerson, Energizer, Panera, Enterprise, Peabody Energy, Ameren, Ralcorp, Monsanto, Scottrade, Edward Jones, Go Jet, Purina and Sigma-Aldrich. This city has also become known for a growing medical, pharmaceutical and research city. St. Louis has two professional sports teams: the St. Louis Cardinals of Major League Baseball and the St. Louis Blues of the National Hockey League. The city is commonly identified with the 630-foot  tall Gateway Arch in Downtown St. Louis.", "coordx": 71, "coordy": 140, "condition":[11], "buildingid":[4], "image":"CITY4.png"}, 
{"id":5, "name":"Poland", "description":"Poland , officially the Republic of Poland , is a country in Central Europe, situated between the Baltic Sea in the north and two mountain ranges  in the south. Bordered by Germany to the west; the Czech Republic and Slovakia to the south; Ukraine and Belarus to the east; and the Baltic Sea, Kaliningrad Oblast  and Lithuania to the north. The total area of Poland is 312,679 square kilometres , making it the 69th largest country in the world and the 9th largest in Europe. With a population of over 38.5 million people, Poland is the 34th most populous country in the world, the 8th most populous country in Europe and the sixth most populous member of the European Union, as well as the most populous post-communist member of the European Union. Poland is a unitary state divided into 16 administrative subdivisions and its capital and largest city is Warsaw. Other metropolises include Kraków, Wrocław, Poznań, Gdańsk and Szczecin. The country's largest agglomeration is the Silesian Metropolis. The establishment of a Polish state can be traced back to 966, when Mieszko I, ruler of a territory roughly coextensive with that of present-day Poland, converted to Christianity. The Kingdom of Poland was founded in 1025, and in 1569 it cemented a longstanding political association with the Grand Duchy of Lithuania by signing the Union of Lublin. This union formed the Polish–Lithuanian Commonwealth, one of the largest and most populous countries of 16th and 17th century Europe. The Commonwealth ceased to exist in the years 1772–95, when its territory was partitioned among Prussia, the Russian Empire, and Austria. Poland regained its independence  at the end of World War I, in 1918. In September 1939, World War II started with the invasions of Poland by Nazi Germany and the Soviet Union . More than six million Polish citizens died in the war. The borders of Poland were shifted westwards according to the Potsdam Conference in the aftermath of World War II. In 1944, a Soviet-backed Polish Committee of National Liberation was formed and, after a falsified referendum in 1946, it took control of the country and Poland became a satellite state of the Soviet Union, as People's Republic of Poland. During the Revolutions of 1989 Poland's Communist government was overthrown and Poland adopted a new constitution establishing itself as a democracy. Despite the large number of casualties and destruction the country experienced during World War II, the country managed to preserve much of its cultural wealth. There are 14 heritage sites inscribed on the UNESCO World Heritage and 54 Historical Monuments and many objects of cultural heritage in Poland. Since the beginning of the transition to a primarily market-based economy that took place in the early 1990s, Poland has achieved a \"very high\" ranking on the Human Development Index, as well as gradually improving economic freedom. Poland is a democratic country with an advanced high-income economy, a high quality of life and a very high standard of living. Moreover, the country is visited by nearly 16 million tourists every year , which makes it one of the most visited countries in the world. Poland is the eighth largest economy in the European Union and among the fastest growing European economies. Furthermore, according to the Global Peace Index for 2014, Poland is one of the safest countries in the world to live in.", "coordx": 229, "coordy": 112, "condition":[17,17,14,16,22], "buildingid":[7,8,9,12], "image":"CITY5.png"}, 
{"id":6, "name":"Belgium", "description":"Belgium , officially the Kingdom of Belgium, is a sovereign state in Western Europe. It is a small, densely populated country which covers an area of 30,528 square kilometres  and has a population of about 11 million people. Straddling the cultural boundary between Germanic and Latin Europe, Belgium is home to two main linguistic groups: the Dutch-speaking, mostly Flemish community, which constitutes about 59% of the population, and the French-speaking, mostly Walloon population, which comprises 41% of all Belgians. Additionally, there is a small group of German-speakers who live in the East Cantons located around the High Fens area, and bordering Germany. Historically, Belgium, the Netherlands and Luxembourg  were known as the Low Countries; it once covered a somewhat larger area than the current Benelux group of states. The region was called Belgica in Latin, after the Roman province of Gallia Belgica. From the end of the Middle Ages until the 17th century, the area of Belgium was a prosperous and cosmopolitan centre of commerce and culture. From the 16th century until the Belgian Revolution in 1830, when Belgium seceded from the Netherlands, the area of Belgium served as the battleground between many European powers, causing it to be dubbed the \"Battlefield of Europe,\"a reputation strengthened by both world wars. Today, Belgium is a federal constitutional monarchy with a parliamentary system of governance. It is divided into three regions and three communities, that exist next to each other. Its two largest regions are the Dutch-speaking region of Flanders in the north and the French-speaking southern region of Wallonia. The Brussels-Capital Region is an officially bilingual  enclave within the Flemish Region.A German-speaking Community exists in eastern Wallonia.Belgium's linguistic diversity and related political conflicts are reflected in its political history and complex system of governance, made up of six different governments. Upon its independence, declared in 1830, Belgium participated in the Industrial Revolutionand, during the course of the 20th century, possessed a number of colonies in Africa. The second half of the 20th century was marked by rising tensions between the Dutch-speaking and the French-speaking citizens fueled by differences in language and culture and the unequal economic development of Flanders and Wallonia. This continuing antagonism has led to several far-reaching reforms, resulting in a transition from a unitary to a federal arrangement during the period from 1970 to 1993. Despite the reforms, tensions between the groups remain, if not increased; there is significant separatism particularly among the Flemish; controversial language laws exist such as the municipalities with language facilities; and the formation of a coalition government took 18 months following the June 2010 federal election, a world record. Belgium is a founding member of the European Union, Eurozone, NATO, OECD and WTO, and a part of the trilateral Benelux Union. Its capital, Brussels, hosts several of the EU's official seats as well as the headquarters of many major international organizations such as NATO. Belgium is also a part of the Schengen Area. Belgium is a developed country, with an advanced high-income economy and is categorized as \"very high\" in the Human Development Index.", "coordx": 206, "coordy": 115, "condition":[20], "buildingid":[10], "image":"CITY6.png"}, 
{"id":7, "name":"Altona", "description":"Altona  is the westernmost urban borough  of the German city state of Hamburg, on the right bank of the Elbe river. From 1640 to 1864 Altona was under the administration of the Danish monarchy. Altona was an independent city until 1937. In 2006 the population was 243,972.", "coordx": 214, "coordy": 109, "condition":[23,23], "buildingid":[11], "image":"CITY7.png"}, 
{"id":8, "name":"New York City", "description":"The City of New York, often called New York City, New York, or simply The City, is the most populous city in the United States. Located at the southern tip of the state of New York, the city is the center of the New York metropolitan area, one of the most populous urban agglomerations in the world. With a U.S. Census Bureau-estimated 2015 population of 8,550,405 distributed over a land area of just 305 square miles , New York is also the most densely populated major city in the United States. A global power city, New York City exerts a significant impact upon commerce, finance, media, art, fashion, research, technology, education, and entertainment, its fast pace defining the term New York minute. Home to the headquarters of the United Nations, New York is an important center for international diplomacy and has been described as the cultural and financial capital of the world. Situated on one of the world's largest natural harbors, New York City consists of five boroughs, each of which is a separate county of New York State. The five boroughs – Brooklyn, Queens, Manhattan, The Bronx, and Staten Island – were consolidated into a single city in 1898. The city and its metropolitan area constitute the premier gateway for legal immigration to the United States, and as many as 800 languages are spoken in New York, making it the most linguistically diverse city in the world. By 2015 estimates, the New York City metropolitan region remains by a significant margin the most populous in the United States, as defined by both the Metropolitan Statistical Area  and the Combined Statistical Area . In 2013, the MSA produced a gross metropolitan product  of nearly US$1.39 trillion, while in 2012, the CSA generated a GMP of over US$1.55 trillion, both ranking first nationally by a wide margin and behind the GDP of only twelve and eleven countries, respectively. New York City traces its origin to its 1624 founding in Lower Manhattan as a trading post by colonists of the Dutch Republic and was named New Amsterdam in 1626. The city and its surroundings came under English control in 1664 and were renamed New York after King Charles II of England granted the lands to his brother, the Duke of York. New York served as the capital of the United States from 1785 until 1790. It has been the country's largest city since 1790. The Statue of Liberty greeted millions of immigrants as they came to the Americas by ship in the late 19th and early 20th centuries and is a symbol of the United States and its democracy. In the 21st century, New York has emerged as a global node of creativity and entrepreneurship, social tolerance, and environmental sustainability. Many districts and landmarks in New York City have become well known, and the city received a record of nearly 60 million tourists in 2015, hosting three of the world's ten most visited tourist attractions in 2013. Several sources have ranked New York the most photographed city in the world. Times Square, iconic as the world's \"heart\" and its \"Crossroads\", is the brightly illuminated hub of the Broadway Theater District, one of the world's busiest pedestrian intersections, and a major center of the world's entertainment industry. The names of many of the city's bridges, tapered skyscrapers, and parks are known around the world. Anchored by Wall Street in the Financial District of Lower Manhattan, New York City has been called both the most economically powerful city and the leading financial center of the world, and the city is home to the world's two largest stock exchanges by total market capitalization, the New York Stock Exchange and NASDAQ. Manhattan's real estate market is among the most expensive in the world. Manhattan's Chinatown incorporates the highest concentration of Chinese people in the Western Hemisphere, with multiple signature Chinatowns developing across the city. Providing continuous 24/7 service, the New York City Subway is one of the most extensive metro systems worldwide, with 469 stations in operation. New York City's higher education network comprises over 120 colleges and universities, including Columbia University, New York University, and Rockefeller University, which have been ranked among the top 35 in the world.", "coordx": 94, "coordy": 136, "condition":[28], "buildingid":[15], "image":"CITY8.png"}, 
{"id":9, "name":"Seine-et-Oise", "description":"Seine-et-Oise was a département of France encompassing the western, northern, and southern parts of the metropolitan area of Paris. Its préfecture  was Versailles and its official number was 78. Seine-et-Oise was abolished in 1968 as part of the reorganization of the départements of the Paris metropolitan area.", "coordx": 203, "coordy": 120, "condition":[26], "buildingid":[13], "image":"CITY9.png"}, 
{"id":10, "name":"Queens", "description":"Queens is the easternmost and largest in area of the five boroughs of New York City. It is geographically adjacent to the borough of Brooklyn at the southwestern end of Long Island, and to Nassau County further east on Long Island; in addition, Queens shares water borders with the boroughs of Manhattan and the Bronx. Coterminous with Queens County since 1899, the borough of Queens is the second-largest in population , with a census-estimated 2,339,150 residents in 2015, approximately 48% of them foreign-born. Queens County is also the second-most populous county in the U.S. state of New York, behind the neighboring borough of Brooklyn, which is coterminous with Kings County. Queens is the fourth-most densely populated county among New York City's boroughs, as well as in the United States. If each New York City borough were an independent city, Queens would also be the nation's fourth most populous city, after Los Angeles, Chicago, and Brooklyn. Queens is the most ethnically diverse urban area in the world. Queens was established in 1683, as one of the original 12 counties of New York and was named for the Portuguese Princess Catherine of Braganza , Queen of England, Scotland, and Ireland. It became a borough of New York City in 1898, and from 1683 until 1899, the County of Queens included what is now Nassau County. Queens has the most diversified economy of the five boroughs of New York City and is home to JFK International Airport and LaGuardia Airport. These airports are among the busiest in the world, causing the airspace above Queens to be the most congested in the country. Attractions in Queens include Flushing Meadows Park — whose Citi Field athletic stadium is home to the New York Mets baseball team — and the US Open tennis tournament; as well as Kaufman Astoria Studios, Silvercup Studios, and Aqueduct Racetrack. The borough has diverse housing, ranging from high-rise apartment buildings in the urban areas of western and central Queens, such as Jackson Heights, Flushing, Astoria, and Long Island City, to suburban neighborhoods in the eastern part of the borough such as Little Neck, Douglaston, and Bayside.", "coordx": 94, "coordy": 136, "condition":[29], "buildingid":[14], "image":"CITY10.png"}],
"dialoguenodes":[{"id":77, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 100, "children": [78,86,108,110,118], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":118, "dialogueline":"I am know for deathplace. unknown", "eventid":"69", "dialoguetype": 626, "children": [77], "keywords": [], "condition":[68], "option":"Tell me about yourself.", "isroot": false}, 
{"id":110, "dialogueline":"What, birthplace? I don't know anything about that.", "eventid":"61", "dialoguetype": 626, "children": [77], "keywords": [], "condition":[60], "option":"Tell me about yourself.", "isroot": false}, 
{"id":108, "dialogueline":"I am a subject of 20th-century american male actor", "eventid":"59", "dialoguetype": 626, "children": [77], "keywords": [], "condition":[58], "option":"Tell me about yourself.", "isroot": false}, 
{"id":86, "dialogueline":"I died in 2015", "eventid":"37", "dialoguetype": 626, "children": [77], "keywords": [], "condition":[36], "option":"Tell me about yourself.", "isroot": false}, 
{"id":78, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [77], "keywords": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":70, "dialogueline":"Hello? Do you need something?", "eventid":"-1", "dialoguetype": 0, "children": [71], "keywords": ["Dick Van Patten","James Parker","Cottage","New York City"], "condition":[], "option":"", "isroot": true}, 
{"id":71, "dialogueline":"Okay. Whatever I can do to help.", "eventid":"-1", "dialoguetype": 0, "children": [72,113,115], "keywords": ["Dick Van Patten","James Parker","Cottage","New York City"], "condition":[], "option":"Hi, I'm a detective assigned to the victim's case. Please can you help answer some questions?", "isroot": false}, 
{"id":115, "dialogueline":"No one knows what deathyear Myron Mathisson has.", "eventid":"66", "dialoguetype": 616, "children": [71], "keywords": ["deathyear","Myron Mathisson"], "condition":[-1], "option":"Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":113, "dialogueline":"Paul A. Freund was born in 1908", "eventid":"64", "dialoguetype": 616, "children": [71], "keywords": ["born","birth","1908","Paul A. Freund"], "condition":[-1], "option":"I need a lead. Could you give me any information about one of the suspects?", "isroot": false}, 
{"id":72, "dialogueline":"I think the Cottage might have a clue.", "eventid":"-1", "dialoguetype": 0, "children": [73], "keywords": ["Dick Van Patten","James Parker","Cottage","New York City"], "condition":[], "option":"I am seeking Dick Van Patten. Do you know where they might be?", "isroot": false}, 
{"id":73, "dialogueline":"I suggest you go to New York City. Try there.", "eventid":"28", "dialoguetype": 0, "children": [71], "keywords": ["Dick Van Patten","James Parker","Cottage","New York City"], "condition":[], "option":"Where might I go to see the Cottage?", "isroot": false}, 
{"id":74, "dialogueline":"Hello? Do you need something?", "eventid":"-1", "dialoguetype": 0, "children": [75], "keywords": ["Dick Van Patten","Dick Van Patten","Queens"], "condition":[], "option":"", "isroot": true}, 
{"id":75, "dialogueline":"Whatever I can do to help.", "eventid":"-1", "dialoguetype": 100, "children": [76], "keywords": ["Dick Van Patten","Dick Van Patten","Queens"], "condition":[], "option":"Greetings, I'm assigned to the victim's case. If it's not too much trouble, would I ask you some questions?", "isroot": false}, 
{"id":76, "dialogueline":"Someone told me they were seen in Queens.", "eventid":"29", "dialoguetype": 0, "children": [75], "keywords": ["Dick Van Patten","Dick Van Patten","Queens"], "condition":[], "option":"I am tracking down Dick Van Patten. Any idea where they could be?", "isroot": false}, 
{"id":56, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 100, "children": [57], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":57, "dialogueline":"Please go away", "eventid":"-1", "dialoguetype": 0, "children": [56], "keywords": [], "condition":[], "option":"I'm looking for Louise Schroeder?...", "isroot": false}, 
{"id":58, "dialogueline":"You can't prove anything!", "eventid":"-1", "dialoguetype": 100, "children": [59,84,92,98,106], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":106, "dialogueline":"What, birthplace? I don't know anything about that.", "eventid":"57", "dialoguetype": 626, "children": [58], "keywords": [], "condition":[56], "option":"Tell me about yourself.", "isroot": false}, 
{"id":98, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"49", "dialoguetype": 626, "children": [58], "keywords": [], "condition":[48], "option":"Tell me about yourself.", "isroot": false}, 
{"id":92, "dialogueline":"I died in 1957", "eventid":"43", "dialoguetype": 626, "children": [58], "keywords": [], "condition":[42], "option":"Tell me about yourself.", "isroot": false}, 
{"id":84, "dialogueline":"I am a subject of 1957 death", "eventid":"35", "dialoguetype": 626, "children": [58], "keywords": [], "condition":[34], "option":"Tell me about yourself.", "isroot": false}, 
{"id":59, "dialogueline":"But I didn't do it!", "eventid":"-1", "dialoguetype": 0, "children": [58], "keywords": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":47, "dialogueline":"Greetings. Do you need something?", "eventid":"-1", "dialoguetype": 0, "children": [48], "keywords": ["Louise Schroeder","Hotel","Poland"], "condition":[], "option":"", "isroot": true}, 
{"id":48, "dialogueline":"Are you sure you need me?", "eventid":"-1", "dialoguetype": 100, "children": [49,51,53,54], "keywords": ["Louise Schroeder","Hotel","Poland"], "condition":[], "option":"Hi, I'm a detective. If it's not too much trouble, please would you help answer some questions?", "isroot": false}, 
{"id":54, "dialogueline":"That is none of your business.", "eventid":"-1", "dialoguetype": 2, "children": [48], "keywords": [], "condition":[], "option":"Where is your current residence? It might be important to the case.", "isroot": false}, 
{"id":53, "dialogueline":"You are asking a lot of questions...I don't like this.", "eventid":"-1", "dialoguetype": 3, "children": [48], "keywords": [], "condition":[], "option":"You seem familiar, remind me why?", "isroot": false}, 
{"id":51, "dialogueline":"Why does it matter where I was born..?", "eventid":"-1", "dialoguetype": 1, "children": [52], "keywords": [], "condition":[], "option":"Where were you born?", "isroot": false}, 
{"id":52, "dialogueline":"Stop questioning me!", "eventid":"-1", "dialoguetype": 1, "children": [48], "keywords": [], "condition":[], "option":"When were you born?", "isroot": false}, 
{"id":49, "dialogueline":"The Hotel could have a clue.", "eventid":"-1", "dialoguetype": 0, "children": [50], "keywords": ["Louise Schroeder","Hotel","Poland"], "condition":[], "option":"I am tracking down Louise Schroeder. Have you heard of them?", "isroot": false}, 
{"id":50, "dialogueline":"Have you gone to in Poland?", "eventid":"22", "dialoguetype": 0, "children": [48], "keywords": ["Louise Schroeder","Hotel","Poland"], "condition":[], "option":"Where is the Hotel?", "isroot": false}, 
{"id":34, "dialogueline":"Hi?", "eventid":"-1", "dialoguetype": 100, "children": [35], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":35, "dialogueline":"Do I look like I know?", "eventid":"-1", "dialoguetype": 0, "children": [34], "keywords": [], "condition":[], "option":"I'm looking for Myron Mathisson?...", "isroot": false}, 
{"id":36, "dialogueline":"I want my lawyer", "eventid":"-1", "dialoguetype": 100, "children": [37,80,102,104,116], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":116, "dialogueline":"What, deathyear? I don't know anything about that.", "eventid":"67", "dialoguetype": 626, "children": [36], "keywords": [], "condition":[66], "option":"Tell me about yourself.", "isroot": false}, 
{"id":104, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"55", "dialoguetype": 626, "children": [36], "keywords": [], "condition":[54], "option":"Tell me about yourself.", "isroot": false}, 
{"id":102, "dialogueline":"What, birthplace? I don't know anything about that.", "eventid":"53", "dialoguetype": 626, "children": [36], "keywords": [], "condition":[52], "option":"Tell me about yourself.", "isroot": false}, 
{"id":80, "dialogueline":"I am a subject of general relativity", "eventid":"31", "dialoguetype": 626, "children": [36], "keywords": [], "condition":[30], "option":"Tell me about yourself.", "isroot": false}, 
{"id":37, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [36], "keywords": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":24, "dialogueline":"You can't prove anything!", "eventid":"-1", "dialoguetype": 100, "children": [25,90,96,100,114], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":114, "dialogueline":"I was born in 1908", "eventid":"65", "dialoguetype": 626, "children": [24], "keywords": [], "condition":[64], "option":"Tell me about yourself.", "isroot": false}, 
{"id":100, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"51", "dialoguetype": 626, "children": [24], "keywords": [], "condition":[50], "option":"Tell me about yourself.", "isroot": false}, 
{"id":96, "dialogueline":"What, birthplace? I don't know anything about that.", "eventid":"47", "dialoguetype": 626, "children": [24], "keywords": [], "condition":[46], "option":"Tell me about yourself.", "isroot": false}, 
{"id":90, "dialogueline":"What, deathyear? I don't know anything about that.", "eventid":"41", "dialoguetype": 626, "children": [24], "keywords": [], "condition":[40], "option":"Tell me about yourself.", "isroot": false}, 
{"id":25, "dialogueline":"You have no proof.", "eventid":"-1", "dialoguetype": 0, "children": [24], "keywords": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":21, "dialogueline":"Hello? How may I help you?", "eventid":"-1", "dialoguetype": 0, "children": [22], "keywords": ["Paul A. Freund","Paul A. Freund","St. Louis"], "condition":[], "option":"", "isroot": true}, 
{"id":22, "dialogueline":"Whatever I can do to help.", "eventid":"-1", "dialoguetype": 100, "children": [23], "keywords": ["Paul A. Freund","Paul A. Freund","St. Louis"], "condition":[], "option":"Hi, I'm a detective assigned to the victim's case. If you don't mind, I would appreciate it if you answer some questions for me.", "isroot": false}, 
{"id":23, "dialogueline":"I would explore St. Louis.", "eventid":"11", "dialoguetype": 0, "children": [22], "keywords": ["Paul A. Freund","Paul A. Freund","St. Louis"], "condition":[], "option":"I am seeking Paul A. Freund. Do you know where they might be?", "isroot": false}, 
{"id":11, "dialogueline":"It wasn't me.", "eventid":"-1", "dialoguetype": 100, "children": [12,82,88,94,112], "keywords": [], "condition":[], "option":"I have some questions.", "isroot": true}, 
{"id":112, "dialogueline":"What, deathplace? I don't know anything about that.", "eventid":"63", "dialoguetype": 626, "children": [11], "keywords": [], "condition":[62], "option":"Tell me about yourself.", "isroot": false}, 
{"id":94, "dialogueline":"I died in 1939", "eventid":"45", "dialoguetype": 626, "children": [11], "keywords": [], "condition":[44], "option":"Tell me about yourself.", "isroot": false}, 
{"id":88, "dialogueline":"I am a subject of presidents of the academy of motion picture arts and science", "eventid":"39", "dialoguetype": 626, "children": [11], "keywords": [], "condition":[38], "option":"Tell me about yourself.", "isroot": false}, 
{"id":82, "dialogueline":"What, birthplace? I don't know anything about that.", "eventid":"33", "dialoguetype": 626, "children": [11], "keywords": [], "condition":[32], "option":"Tell me about yourself.", "isroot": false}, 
{"id":12, "dialogueline":"Why don't you go play something else?", "eventid":"-1", "dialoguetype": 0, "children": [11], "keywords": [], "condition":[], "option":"We are still investigating.", "isroot": false}, 
{"id":8, "dialogueline":"Hello?", "eventid":"-1", "dialoguetype": 0, "children": [9], "keywords": ["Douglas Fairbanks","Douglas Fairbanks","Denver, Colorado"], "condition":[], "option":"", "isroot": true}, 
{"id":9, "dialogueline":"Of course. Ask away.", "eventid":"-1", "dialoguetype": 100, "children": [10,81,83], "keywords": ["Douglas Fairbanks","Douglas Fairbanks","Denver, Colorado"], "condition":[], "option":"Greetings, I'm investigating the victim's case. Could I ask you some questions?", "isroot": false}, 
{"id":83, "dialogueline":"Louise Schroeder is a subject of 1957 death", "eventid":"34", "dialoguetype": 616, "children": [9], "keywords": ["1957 death","subject","Louise Schroeder"], "condition":[-1], "option":"I could use a lead. Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":81, "dialogueline":"No one knows what birthplace Douglas Fairbanks has.", "eventid":"32", "dialoguetype": 616, "children": [9], "keywords": ["birthplace","Douglas Fairbanks"], "condition":[-1], "option":"Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":10, "dialogueline":"They were seen in Denver, Colorado. They probably will be there.", "eventid":"5", "dialoguetype": 0, "children": [9], "keywords": ["Douglas Fairbanks","Douglas Fairbanks","Denver, Colorado"], "condition":[], "option":"I am tracking down Douglas Fairbanks. Any idea where they might have gone?", "isroot": false}, 
{"id":63, "dialogueline":"Greetings. May I help you?", "eventid":"-1", "dialoguetype": 0, "children": [64], "keywords": [], "condition":[], "option":"", "isroot": true}, 
{"id":64, "dialogueline":"Of course. Ask away.", "eventid":"24", "dialoguetype": 100, "children": [65,117], "keywords": ["Dick Van Patten","Léon Brillouin","Dick Van Patten","Seine-et-Oise","Ernst Mach","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Greetings, I'm a private-eye assigned to the victim's case. If you don't mind, I ask that you answer some questions.", "isroot": false}, 
{"id":117, "dialogueline":"No one knows what deathplace Dick Van Patten has.", "eventid":"68", "dialoguetype": 616, "children": [64], "keywords": ["deathplace","Dick Van Patten"], "condition":[24], "option":"I could use a lead. Do you know some information about one of the suspects?", "isroot": false}, 
{"id":65, "dialogueline":"You can call me Ernst Mach.", "eventid":"25", "dialoguetype": 0, "children": [67], "keywords": ["Dick Van Patten","Léon Brillouin","Dick Van Patten","Seine-et-Oise","Ernst Mach","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"State your name.", "isroot": false}, 
{"id":67, "dialogueline":"Léon Brillouin was seen in Seine-et-Oise. Hopefully that helps you.", "eventid":"26", "dialoguetype": 0, "children": [68], "keywords": ["Dick Van Patten","Léon Brillouin","Dick Van Patten","Seine-et-Oise","Ernst Mach","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Did the victim mention anything specific that you can recollect?", "isroot": false}, 
{"id":68, "dialogueline":"I'm uncertain. But, I believe Dick Van Patten might be guilty.", "eventid":"27", "dialoguetype": 0, "children": [64], "keywords": ["Dick Van Patten","Léon Brillouin","Dick Van Patten","Seine-et-Oise","Ernst Mach","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Can you think of somebody who has a motive?", "isroot": false}, 
{"id":41, "dialogueline":"Hello?", "eventid":"-1", "dialoguetype": 0, "children": [42], "keywords": [], "condition":[], "option":"", "isroot": true}, 
{"id":42, "dialogueline":"I can try.", "eventid":"18", "dialoguetype": 100, "children": [43,107,109,111], "keywords": ["Louise Schroeder","Théophile de Donder","Louise Schroeder","Belgium","Austen Chamberlain","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Greetings, I'm a private-eye. Could I ask you some questions?", "isroot": false}, 
{"id":111, "dialogueline":"No one knows what deathplace Douglas Fairbanks has.", "eventid":"62", "dialoguetype": 616, "children": [42], "keywords": ["deathplace","Douglas Fairbanks"], "condition":[18], "option":"Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":109, "dialogueline":"No one knows what birthplace Dick Van Patten has.", "eventid":"60", "dialoguetype": 616, "children": [42], "keywords": ["birthplace","Dick Van Patten"], "condition":[18], "option":"Do you have some information about one of the suspects?", "isroot": false}, 
{"id":107, "dialogueline":"Dick Van Patten is a subject of 20th-century american male actor", "eventid":"58", "dialoguetype": 616, "children": [42], "keywords": ["20th-century american male actor","subject","Dick Van Patten"], "condition":[18], "option":"Do you remember some information about one of the suspects?", "isroot": false}, 
{"id":43, "dialogueline":"I am known as Austen Chamberlain.", "eventid":"19", "dialoguetype": 0, "children": [45], "keywords": ["Louise Schroeder","Théophile de Donder","Louise Schroeder","Belgium","Austen Chamberlain","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Will you tell me your name?", "isroot": false}, 
{"id":45, "dialogueline":"Last I heard, Théophile de Donder travelled to Belgium. I hope that helps.", "eventid":"20", "dialoguetype": 0, "children": [46], "keywords": ["Louise Schroeder","Théophile de Donder","Louise Schroeder","Belgium","Austen Chamberlain","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Is there something specific you recollect that might be of use to the investigation?", "isroot": false}, 
{"id":46, "dialogueline":"I think Louise Schroeder might be connected. However, I'm not completely convinced.", "eventid":"21", "dialoguetype": 0, "children": [42], "keywords": ["Louise Schroeder","Théophile de Donder","Louise Schroeder","Belgium","Austen Chamberlain","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Do you have any more information?", "isroot": false}, 
{"id":28, "dialogueline":"Hi.", "eventid":"-1", "dialoguetype": 0, "children": [29], "keywords": [], "condition":[], "option":"", "isroot": true}, 
{"id":29, "dialogueline":"Yes. Ask away.", "eventid":"12", "dialoguetype": 100, "children": [30,99,101,103,105], "keywords": ["Myron Mathisson","Myron Mathisson","Poland","David Hume","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Greetings, I'm working on the victim's case. If it's not too much trouble, please would you help answer some questions?", "isroot": false}, 
{"id":105, "dialogueline":"No one knows what birthplace Louise Schroeder has.", "eventid":"56", "dialoguetype": 616, "children": [29], "keywords": ["birthplace","Louise Schroeder"], "condition":[12], "option":"Do you have some information about one of the suspects?", "isroot": false}, 
{"id":103, "dialogueline":"No one knows what deathplace Myron Mathisson has.", "eventid":"54", "dialoguetype": 616, "children": [29], "keywords": ["deathplace","Myron Mathisson"], "condition":[12], "option":"Do you recall any information about one of the suspects?", "isroot": false}, 
{"id":101, "dialogueline":"No one knows what birthplace Myron Mathisson has.", "eventid":"52", "dialoguetype": 616, "children": [29], "keywords": ["birthplace","Myron Mathisson"], "condition":[12], "option":"I need your assistance. Do you remember any information about one of the suspects?", "isroot": false}, 
{"id":99, "dialogueline":"No one knows what deathplace Paul A. Freund has.", "eventid":"50", "dialoguetype": 616, "children": [29], "keywords": ["deathplace","Paul A. Freund"], "condition":[12], "option":"I need your cooperation. Would you tell me some information about one of the suspects?", "isroot": false}, 
{"id":30, "dialogueline":"I am known as David Hume.", "eventid":"13", "dialoguetype": 0, "children": [31], "keywords": ["Myron Mathisson","Myron Mathisson","Poland","David Hume","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Tell me your name.", "isroot": false}, 
{"id":31, "dialogueline":"If I recall correctly, the victim mentioned Poland.", "eventid":"14", "dialoguetype": 0, "children": [32], "keywords": ["Myron Mathisson","Myron Mathisson","Poland","David Hume","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Did the victim remark anything that you can recollect?", "isroot": false}, 
{"id":32, "dialogueline":"I am suspicious of Myron Mathisson.", "eventid":"15", "dialoguetype": 0, "children": [29], "keywords": ["Myron Mathisson","Myron Mathisson","Poland","David Hume","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"I could use a lead. Can you think of anyone who has a reason to do this?", "isroot": false}, 
{"id":15, "dialogueline":"Hello?", "eventid":"-1", "dialoguetype": 0, "children": [16], "keywords": [], "condition":[], "option":"", "isroot": true}, 
{"id":16, "dialogueline":"Whatever I can do to help.", "eventid":"6", "dialoguetype": 100, "children": [17,93,95,97], "keywords": ["Paul A. Freund","Paul A. Freund","Denver, Colorado","Rabindranath Tagore","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Greetings, I'm a detective working on the victim's case. I'm sorry to disturb, I have some questions for you.", "isroot": false}, 
{"id":97, "dialogueline":"No one knows what deathplace Louise Schroeder has.", "eventid":"48", "dialoguetype": 616, "children": [16], "keywords": ["deathplace","Louise Schroeder"], "condition":[6], "option":"I need your cooperation. Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":95, "dialogueline":"No one knows what birthplace Paul A. Freund has.", "eventid":"46", "dialoguetype": 616, "children": [16], "keywords": ["birthplace","Paul A. Freund"], "condition":[6], "option":"Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":93, "dialogueline":"Douglas Fairbanks died in 1939", "eventid":"44", "dialoguetype": 616, "children": [16], "keywords": ["died","dead","1939","Douglas Fairbanks"], "condition":[6], "option":"I could use some cooperation. Do you remember any information about one of the suspects?", "isroot": false}, 
{"id":17, "dialogueline":"I'm Rabindranath Tagore.", "eventid":"7", "dialoguetype": 0, "children": [18], "keywords": ["Paul A. Freund","Paul A. Freund","Denver, Colorado","Rabindranath Tagore","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"State your name.", "isroot": false}, 
{"id":18, "dialogueline":"I think the victim talked about Denver, Colorado.", "eventid":"8", "dialoguetype": 0, "children": [19], "keywords": ["Paul A. Freund","Paul A. Freund","Denver, Colorado","Rabindranath Tagore","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Is there something specific you think I should know about?", "isroot": false}, 
{"id":19, "dialogueline":"Personally, I think Paul A. Freund might have a motive.", "eventid":"9", "dialoguetype": 0, "children": [16], "keywords": ["Paul A. Freund","Paul A. Freund","Denver, Colorado","Rabindranath Tagore","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Do you have any more information?", "isroot": false}, 
{"id":3, "dialogueline":"Hi. How may I help you?", "eventid":"-1", "dialoguetype": 0, "children": [4], "keywords": [], "condition":[], "option":"", "isroot": true}, 
{"id":4, "dialogueline":"Yes. Ask away.", "eventid":"0", "dialoguetype": 100, "children": [5,85,87,89,91], "keywords": ["Douglas Fairbanks","Douglas Fairbanks","Denver, Colorado","Lev Landau","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Hi, I'm a detective. Could I ask you some questions?", "isroot": false}, 
{"id":91, "dialogueline":"Louise Schroeder died in 1957", "eventid":"42", "dialoguetype": 616, "children": [4], "keywords": ["died","dead","1957","Louise Schroeder"], "condition":[0], "option":"I could use some assistance. Could you give me some information about one of the suspects?", "isroot": false}, 
{"id":89, "dialogueline":"No one knows what deathyear Paul A. Freund has.", "eventid":"40", "dialoguetype": 616, "children": [4], "keywords": ["deathyear","Paul A. Freund"], "condition":[0], "option":"Would you give me any information about one of the suspects?", "isroot": false}, 
{"id":87, "dialogueline":"Douglas Fairbanks is a subject of presidents of the academy of motion picture arts and science", "eventid":"38", "dialoguetype": 616, "children": [4], "keywords": ["presidents of the academy of motion picture arts and science","subject","Douglas Fairbanks"], "condition":[0], "option":"I could use some help. Would you give me some information about one of the suspects?", "isroot": false}, 
{"id":85, "dialogueline":"Dick Van Patten died in 2015", "eventid":"36", "dialoguetype": 616, "children": [4], "keywords": ["died","dead","2015","Dick Van Patten"], "condition":[0], "option":"I need a lead. Would you tell me some information about one of the suspects?", "isroot": false}, 
{"id":5, "dialogueline":"Okay, I am named Lev Landau.", "eventid":"1", "dialoguetype": 0, "children": [6], "keywords": ["Douglas Fairbanks","Douglas Fairbanks","Denver, Colorado","Lev Landau","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Can you tell me who you are?", "isroot": false}, 
{"id":6, "dialogueline":"I think the victim talked about Denver, Colorado.", "eventid":"2", "dialoguetype": 0, "children": [7], "keywords": ["Douglas Fairbanks","Douglas Fairbanks","Denver, Colorado","Lev Landau","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"Did the victim remark something that you can recall?", "isroot": false}, 
{"id":7, "dialogueline":"Personally, I think Douglas Fairbanks could be connected.", "eventid":"3", "dialoguetype": 0, "children": [4], "keywords": ["Douglas Fairbanks","Douglas Fairbanks","Denver, Colorado","Lev Landau","wik[a-z] [A-Z]ag[a-z] [A-Z]ik[a-z] [A-Z]ink"], "condition":[], "option":"I would like your help. Do you have any more information?", "isroot": false}],
"crime":{"suspects":[19,2,5,9,14],"culprit":19},
"facts":[{"id":0,"pid":19,"factoid":"Dick Van Patten died in 2015","condition":36},{"id":0,"pid":19,"factoid":"Dick Van Patten is a subject of 20th-century american male actor","condition":58},{"id":0,"pid":19,"factoid":"No one knows what birthplace Dick Van Patten has.","condition":60},{"id":0,"pid":19,"factoid":"No one knows what deathplace Dick Van Patten has.","condition":68},{"id":0,"pid":2,"factoid":"Douglas Fairbanks died in 1939","condition":44},{"id":0,"pid":2,"factoid":"Douglas Fairbanks is a subject of presidents of the academy of motion picture arts and science","condition":38},{"id":0,"pid":2,"factoid":"No one knows what birthplace Douglas Fairbanks has.","condition":32},{"id":0,"pid":2,"factoid":"No one knows what deathplace Douglas Fairbanks has.","condition":62},{"id":0,"pid":5,"factoid":"No one knows what deathyear Paul A. Freund has.","condition":40},{"id":0,"pid":5,"factoid":"Paul A. Freund was born in 1908","condition":64},{"id":0,"pid":5,"factoid":"No one knows what birthplace Paul A. Freund has.","condition":46},{"id":0,"pid":5,"factoid":"No one knows what deathplace Paul A. Freund has.","condition":50},{"id":0,"pid":9,"factoid":"No one knows what deathyear Myron Mathisson has.","condition":66},{"id":0,"pid":9,"factoid":"Myron Mathisson is a subject of general relativity","condition":30},{"id":0,"pid":9,"factoid":"No one knows what birthplace Myron Mathisson has.","condition":52},{"id":0,"pid":9,"factoid":"No one knows what deathplace Myron Mathisson has.","condition":54},{"id":0,"pid":14,"factoid":"Louise Schroeder died in 1957","condition":42},{"id":0,"pid":14,"factoid":"Louise Schroeder is a subject of 1957 death","condition":34},{"id":0,"pid":14,"factoid":"No one knows what birthplace Louise Schroeder has.","condition":56},{"id":0,"pid":14,"factoid":"No one knows what deathplace Louise Schroeder has.","condition":48}]}
